[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
,
0
1
2
3
4
5
6
7
8
9
=
a
b
c
d
e
f
i
l
n
o
s
t
u
v
##0
##9
##7
##8
##3
##6
##4
##2
##1
##5
##t
##a
##e
##n
##f
##o
##d
##b
##c
##l
##u
in
st
va
##te
##ate
##fo
##lu
info
state
valu
value
infod
infoa
infob
infoc
10
11
##90
##97
##98
##93
##96
##94
##92
##91
##95
##70
##78
##73
##76
##74
##72
##71
##75
##80
##83
##86
##84
##82
##81
##85
##30
##36
##34
##32
##31
##35
##60
##64
##62
##61
##65
##40
##42
##41
##45
##20
##21
##25
##50
##51
##00
##99
##77
##88
##33
##66
##44
##22
##11
##55
##01
21
31
41
51
61
71
81
91
101
111
##79
##38
##46
##52
20
30
40
50
60
70
80
90
100
110
##89
##87
##39
##37
##26
##24
##56
##54
15
25
35
45
55
65
75
85
95
105
115
12
22
32
42
52
62
72
82
92
102
112
14
24
34
44
54
64
74
84
94
104
114
16
26
36
46
56
66
76
86
96
106
116
13
23
33
43
53
63
73
83
93
103
113
18
28
38
48
58
68
78
88
98
108
118
##69
##67
##68
##63
##49
##47
##48
##43
##29
##27
##28
##23
##59
##57
##58
##53
17
27
37
47
57
67
77
87
97
107
117
190
197
198
193
196
194
192
191
195
170
178
173
176
174
172
171
175
180
183
186
184
182
181
185
130
136
134
132
131
135
160
164
162
161
165
140
142
141
145
120
121
125
150
151
290
297
298
293
296
294
292
291
295
270
278
273
276
274
272
271
275
280
283
286
284
282
281
285
230
236
234
232
231
235
260
264
262
261
265
240
242
241
245
220
221
225
250
251
200
211
390
397
398
393
396
394
392
391
395
370
378
373
376
374
372
371
375
380
383
386
384
382
381
385
330
336
334
332
331
335
360
364
362
361
365
340
342
341
345
320
321
325
350
351
300
311
490
497
498
493
496
494
492
491
495
470
478
473
476
474
472
471
475
480
483
486
484
482
481
485
430
436
434
432
431
435
460
464
462
461
465
440
442
441
445
420
421
425
450
451
400
411
590
597
598
593
596
594
592
591
595
570
578
573
576
574
572
571
575
580
583
586
584
582
581
585
530
536
534
532
531
535
560
564
562
561
565
540
542
541
545
520
521
525
550
551
500
511
690
697
698
693
696
694
692
691
695
670
678
673
676
674
672
671
675
680
683
686
684
682
681
685
630
636
634
632
631
635
660
664
662
661
665
640
642
641
645
620
621
625
650
651
600
611
790
797
798
793
796
794
792
791
795
770
778
773
776
774
772
771
775
780
783
786
784
782
781
785
730
736
734
732
731
735
760
764
762
761
765
740
742
741
745
720
721
725
750
751
700
711
890
897
898
893
896
894
892
891
895
870
878
873
876
874
872
871
875
880
883
886
884
882
881
885
830
836
834
832
831
835
860
864
862
861
865
840
842
841
845
820
821
825
850
851
800
811
990
997
998
993
996
994
992
991
995
970
978
973
976
974
972
971
975
980
983
986
984
982
981
985
930
936
934
932
931
935
960
964
962
961
965
940
942
941
945
920
921
925
950
951
900
911
##990
##997
##998
##993
##996
##994
##992
##991
##995
1090
1097
1098
1093
1096
1094
1092
1091
1095
1070
1078
1073
1076
1074
1072
1071
1075
1080
1083
1086
1084
1082
1081
1085
1030
1036
1034
1032
1031
1035
1060
1064
1062
1061
1065
1040
1042
1041
1045
1020
1021
1025
1050
1051
1000
1011
1190
1197
1198
1193
1196
1194
1192
1191
1195
1170
1178
1173
1176
1174
1172
1171
1175
1180
1183
1186
1184
1182
1181
1185
1130
1136
1134
1132
1131
1135
1160
1164
1162
1161
1165
1140
1142
1141
1145
1120
1121
1125
1150
1151
1100
1111
##999
##779
##777
##889
##887
##888
##339
##337
##338
##333
##669
##667
##668
##663
##666
##449
##447
##448
##443
##446
##444
##229
##227
##228
##223
##226
##224
##222
##559
##557
##558
##553
##556
##554
##552
##555
##389
##387
##469
##467
##468
##463
##529
##527
##528
##523
##526
##524
##269
##267
##268
##263
##249
##247
##248
##243
##569
##567
##568
##563
##549
##547
##548
##543
201
301
401
501
601
701
801
901
##09
##07
##08
##03
##06
##04
##02
##05
1001
1101
19
199
177
188
133
166
144
122
155
179
138
146
152
189
187
139
137
126
124
156
154
1990
1997
1998
1993
1996
1994
1992
1991
1995
1999
1779
1777
1889
1887
1888
1339
1337
1338
1333
1669
1667
1668
1663
1666
1449
1447
1448
1443
1446
1444
1229
1227
1228
1223
1226
1224
1222
1559
1557
1558
1553
1556
1554
1552
1555
1389
1387
1469
1467
1468
1463
1529
1527
1528
1523
1526
1524
1269
1267
1268
1263
1249
1247
1248
1243
1569
1567
1568
1563
1549
1547
1548
1543
29
299
277
288
233
266
244
222
255
279
238
246
252
289
287
239
237
226
224
256
254
2990
2997
2998
2993
2996
2994
2992
2991
2995
2999
2779
2777
2889
2887
2888
2339
2337
2338
2333
2669
2667
2668
2663
2666
2449
2447
2448
2443
2446
2444
2229
2227
2228
2223
2226
2224
2222
2559
2557
2558
2553
2556
2554
2552
2555
2389
2387
2469
2467
2468
2463
2529
2527
2528
2523
2526
2524
2269
2267
2268
2263
2249
2247
2248
2243
2569
2567
2568
2563
2549
2547
2548
2543
39
399
377
388
333
366
344
322
355
379
338
346
352
389
387
339
337
326
324
356
354
3990
3997
3998
3993
3996
3994
3992
3991
3995
3999
3779
3777
3889
3887
3888
3339
3337
3338
3333
3669
3667
3668
3663
3666
3449
3447
3448
3443
3446
3444
3229
3227
3228
3223
3226
3224
3222
3559
3557
3558
3553
3556
3554
3552
3555
3389
3387
3469
3467
3468
3463
3529
3527
3528
3523
3526
3524
3269
3267
3268
3263
3249
3247
3248
3243
3569
3567
3568
3563
3549
3547
3548
3543
49
499
477
488
433
466
444
422
455
479
438
446
452
489
487
439
437
426
424
456
454
4990
4997
4998
4993
4996
4994
4992
4991
4995
4999
4779
4777
4889
4887
4888
4339
4337
4338
4333
4669
4667
4668
4663
4666
4449
4447
4448
4443
4446
4444
4229
4227
4228
4223
4226
4224
4222
4559
4557
4558
4553
4556
4554
4552
4555
4389
4387
4469
4467
4468
4463
4529
4527
4528
4523
4526
4524
4269
4267
4268
4263
4249
4247
4248
4243
4569
4567
4568
4563
4549
4547
4548
4543
59
599
577
588
533
566
544
522
555
579
538
546
552
589
587
539
537
526
524
556
554
5990
5997
5998
5993
5996
5994
5992
5991
5995
5999
5779
5777
5889
5887
5888
5339
5337
5338
5333
5669
5667
5668
5663
5666
5449
5447
5448
5443
5446
5444
5229
5227
5228
5223
5226
5224
5222
5559
5557
5558
5553
5556
5554
5552
5555
5389
5387
5469
5467
5468
5463
5529
5527
5528
5523
5526
5524
5269
5267
5268
5263
5249
5247
5248
5243
5569
5567
5568
5563
5549
5547
5548
5543
69
699
677
688
633
666
644
622
655
679
638
646
652
689
687
639
637
626
624
656
654
6990
6997
6998
6993
6996
6994
6992
6991
6995
6999
6779
6777
6889
6887
6888
6339
6337
6338
6333
6669
6667
6668
6663
6666
6449
6447
6448
6443
6446
6444
6229
6227
6228
6223
6226
6224
6222
6559
6557
6558
6553
6556
6554
6552
6555
6389
6387
6469
6467
6468
6463
6529
6527
6528
6523
6526
6524
6269
6267
6268
6263
6249
6247
6248
6243
6569
6567
6568
6563
6549
6547
6548
6543
79
799
777
788
733
766
744
722
755
779
738
746
752
789
787
739
737
726
724
756
754
7990
7997
7998
7993
7996
7994
7992
7991
7995
7999
7779
7777
7889
7887
7888
7339
7337
7338
7333
7669
7667
7668
7663
7666
7449
7447
7448
7443
7446
7444
7229
7227
7228
7223
7226
7224
7222
7559
7557
7558
7553
7556
7554
7552
7555
7389
7387
7469
7467
7468
7463
7529
7527
7528
7523
7526
7524
7269
7267
7268
7263
7249
7247
7248
7243
7569
7567
7568
7563
7549
7547
7548
7543
89
899
877
888
833
866
844
822
855
879
838
846
852
889
887
839
837
826
824
856
854
8990
8997
8998
8993
8996
8994
8992
8991
8995
8999
8779
8777
8889
8887
8888
8339
8337
8338
8333
8669
8667
8668
8663
8666
8449
8447
8448
8443
8446
8444
8229
8227
8228
8223
8226
8224
8222
8559
8557
8558
8553
8556
8554
8552
8555
8389
8387
8469
8467
8468
8463
8529
8527
8528
8523
8526
8524
8269
8267
8268
8263
8249
8247
8248
8243
8569
8567
8568
8563
8549
8547
8548
8543
99
999
977
988
933
966
944
922
955
979
938
946
952
989
987
939
937
926
924
956
954
9990
9997
9998
9993
9996
9994
9992
9991
9995
9999
9779
9777
9889
9887
9888
9339
9337
9338
9333
9669
9667
9668
9663
9666
9449
9447
9448
9443
9446
9444
9229
9227
9228
9223
9226
9224
9222
9559
9557
9558
9553
9556
9554
9552
9555
9389
9387
9469
9467
9468
9463
9529
9527
9528
9523
9526
9524
9269
9267
9268
9263
9249
9247
9248
9243
9569
9567
9568
9563
9549
9547
9548
9543
109
1099
1077
1088
1033
1066
1044
1022
1055
1079
1038
1046
1052
1089
1087
1039
1037
1026
1024
1056
1054
10990
10997
10998
10993
10996
10994
10992
10991
10995
10999
10779
10777
10889
10887
10888
10339
10337
10338
10333
10669
10667
10668
10663
10666
10449
10447
10448
10443
10446
10444
10229
10227
10228
10223
10226
10224
10222
10559
10557
10558
10553
10556
10554
10552
10555
10389
10387
10469
10467
10468
10463
10529
10527
10528
10523
10526
10524
10269
10267
10268
10263
10249
10247
10248
10243
10569
10567
10568
10563
10549
10547
10548
10543
119
1199
1177
1188
1133
1166
1144
1122
1155
1179
1138
1146
1152
1189
1187
1139
1137
1126
1124
1156
1154
11990
11997
11998
11993
11996
11994
11992
11991
11995
11999
11779
11777
11889
11887
11888
11339
11337
11338
11333
11669
11667
11668
11663
11666
11449
11447
11448
11443
11446
11444
11229
11227
11228
11223
11226
11224
11222
11559
11557
11558
11553
11556
11554
11552
11555
11389
11387
11469
11467
11468
11463
11529
11527
11528
11523
11526
11524
11269
11267
11268
11263
11249
11247
11248
11243
11569
11567
11568
11563
11549
11547
11548
11543
210
219
217
218
213
216
214
212
215
2190
2197
2198
2193
2196
2194
2192
2191
2195
2170
2178
2173
2176
2174
2172
2171
2175
2180
2183
2186
2184
2182
2181
2185
2130
2136
2134
2132
2131
2135
2160
2164
2162
2161
2165
2140
2142
2141
2145
2120
2121
2125
2150
2151
2100
2199
2177
2188
2133
2166
2144
2122
2155
2101
2179
2138
2146
2152
2189
2187
2139
2137
2126
2124
2156
2154
2169
2167
2168
2163
2149
2147
2148
2143
2129
2127
2128
2123
2159
2157
2158
2153
2109
2107
2108
2103
2106
2104
2102
2105
310
319
317
318
313
316
314
312
315
3190
3197
3198
3193
3196
3194
3192
3191
3195
3170
3178
3173
3176
3174
3172
3171
3175
3180
3183
3186
3184
3182
3181
3185
3130
3136
3134
3132
3131
3135
3160
3164
3162
3161
3165
3140
3142
3141
3145
3120
3121
3125
3150
3151
3100
3199
3177
3188
3133
3166
3144
3122
3155
3101
3179
3138
3146
3152
3189
3187
3139
3137
3126
3124
3156
3154
3169
3167
3168
3163
3149
3147
3148
3143
3129
3127
3128
3123
3159
3157
3158
3153
3109
3107
3108
3103
3106
3104
3102
3105
410
419
417
418
413
416
414
412
415
4190
4197
4198
4193
4196
4194
4192
4191
4195
4170
4178
4173
4176
4174
4172
4171
4175
4180
4183
4186
4184
4182
4181
4185
4130
4136
4134
4132
4131
4135
4160
4164
4162
4161
4165
4140
4142
4141
4145
4120
4121
4125
4150
4151
4100
4199
4177
4188
4133
4166
4144
4122
4155
4101
4179
4138
4146
4152
4189
4187
4139
4137
4126
4124
4156
4154
4169
4167
4168
4163
4149
4147
4148
4143
4129
4127
4128
4123
4159
4157
4158
4153
4109
4107
4108
4103
4106
4104
4102
4105
510
519
517
518
513
516
514
512
515
5190
5197
5198
5193
5196
5194
5192
5191
5195
5170
5178
5173
5176
5174
5172
5171
5175
5180
5183
5186
5184
5182
5181
5185
5130
5136
5134
5132
5131
5135
5160
5164
5162
5161
5165
5140
5142
5141
5145
5120
5121
5125
5150
5151
5100
5199
5177
5188
5133
5166
5144
5122
5155
5101
5179
5138
5146
5152
5189
5187
5139
5137
5126
5124
5156
5154
5169
5167
5168
5163
5149
5147
5148
5143
5129
5127
5128
5123
5159
5157
5158
5153
5109
5107
5108
5103
5106
5104
5102
5105
610
619
617
618
613
616
614
612
615
6190
6197
6198
6193
6196
6194
6192
6191
6195
6170
6178
6173
6176
6174
6172
6171
6175
6180
6183
6186
6184
6182
6181
6185
6130
6136
6134
6132
6131
6135
6160
6164
6162
6161
6165
6140
6142
6141
6145
6120
6121
6125
6150
6151
6100
6199
6177
6188
6133
6166
6144
6122
6155
6101
6179
6138
6146
6152
6189
6187
6139
6137
6126
6124
6156
6154
6169
6167
6168
6163
6149
6147
6148
6143
6129
6127
6128
6123
6159
6157
6158
6153
6109
6107
6108
6103
6106
6104
6102
6105
710
719
717
718
713
716
714
712
715
7190
7197
7198
7193
7196
7194
7192
7191
7195
7170
7178
7173
7176
7174
7172
7171
7175
7180
7183
7186
7184
7182
7181
7185
7130
7136
7134
7132
7131
7135
7160
7164
7162
7161
7165
7140
7142
7141
7145
7120
7121
7125
7150
7151
7100
7199
7177
7188
7133
7166
7144
7122
7155
7101
7179
7138
7146
7152
7189
7187
7139
7137
7126
7124
7156
7154
7169
7167
7168
7163
7149
7147
7148
7143
7129
7127
7128
7123
7159
7157
7158
7153
7109
7107
7108
7103
7106
7104
7102
7105
810
819
817
818
813
816
814
812
815
8190
8197
8198
8193
8196
8194
8192
8191
8195
8170
8178
8173
8176
8174
8172
8171
8175
8180
8183
8186
8184
8182
8181
8185
8130
8136
8134
8132
8131
8135
8160
8164
8162
8161
8165
8140
8142
8141
8145
8120
8121
8125
8150
8151
8100
8199
8177
8188
8133
8166
8144
8122
8155
8101
8179
8138
8146
8152
8189
8187
8139
8137
8126
8124
8156
8154
8169
8167
8168
8163
8149
8147
8148
8143
8129
8127
8128
8123
8159
8157
8158
8153
8109
8107
8108
8103
8106
8104
8102
8105
910
919
917
918
913
916
914
912
915
9190
9197
9198
9193
9196
9194
9192
9191
9195
9170
9178
9173
9176
9174
9172
9171
9175
9180
9183
9186
9184
9182
9181
9185
9130
9136
9134
9132
9131
9135
9160
9164
9162
9161
9165
9140
9142
9141
9145
9120
9121
9125
9150
9151
9100
9199
9177
9188
9133
9166
9144
9122
9155
9101
9179
9138
9146
9152
9189
9187
9139
9137
9126
9124
9156
9154
9169
9167
9168
9163
9149
9147
9148
9143
9129
9127
9128
9123
9159
9157
9158
9153
9109
9107
9108
9103
9106
9104
9102
9105
1010
1019
1017
1018
1013
1016
1014
1012
1015
10190
10197
10198
10193
10196
10194
10192
10191
10195
10170
10178
10173
10176
10174
10172
10171
10175
10180
10183
10186
10184
10182
10181
10185
10130
10136
10134
10132
10131
10135
10160
10164
10162
10161
10165
10140
10142
10141
10145
10120
10121
10125
10150
10151
10100
10199
10177
10188
10133
10166
10144
10122
10155
10101
10179
10138
10146
10152
10189
10187
10139
10137
10126
10124
10156
10154
10169
10167
10168
10163
10149
10147
10148
10143
10129
10127
10128
10123
10159
10157
10158
10153
10109
10107
10108
10103
10106
10104
10102
10105
1110
1119
1117
1118
1113
1116
1114
1112
1115
11190
11197
11198
11193
11196
11194
11192
11191
11195
11170
11178
11173
11176
11174
11172
11171
11175
11180
11183
11186
11184
11182
11181
11185
11130
11136
11134
11132
11131
11135
11160
11164
11162
11161
11165
11140
11142
11141
11145
11120
11121
11125
11150
11151
11100
11199
11177
11188
11133
11166
11144
11122
11155
11101
11179
11138
11146
11152
11189
11187
11139
11137
11126
11124
11156
11154
11169
11167
11168
11163
11149
11147
11148
11143
11129
11127
11128
11123
11159
11157
11158
11153
11109
11107
11108
11103
11106
11104
11102
11105
209
207
208
203
206
204
202
205
2090
2097
2098
2093
2096
2094
2092
2091
2095
2070
2078
2073
2076
2074
2072
2071
2075
2080
2083
2086
2084
2082
2081
2085
2030
2036
2034
2032
2031
2035
2060
2064
2062
2061
2065
2040
2042
2041
2045
2020
2021
2025
2050
2051
2099
2077
2088
2033
2066
2044
2022
2011
2055
2079
2038
2046
2052
2089
2087
2039
2037
2026
2024
2056
2054
2069
2067
2068
2063
2049
2047
2048
2043
2029
2027
2028
2023
2059
2057
2058
2053
309
307
308
303
306
304
302
305
3090
3097
3098
3093
3096
3094
3092
3091
3095
3070
3078
3073
3076
3074
3072
3071
3075
3080
3083
3086
3084
3082
3081
3085
3030
3036
3034
3032
3031
3035
3060
3064
3062
3061
3065
3040
3042
3041
3045
3020
3021
3025
3050
3051
3099
3077
3088
3033
3066
3044
3022
3011
3055
3079
3038
3046
3052
3089
3087
3039
3037
3026
3024
3056
3054
3069
3067
3068
3063
3049
3047
3048
3043
3029
3027
3028
3023
3059
3057
3058
3053
409
407
408
403
406
404
402
405
4090
4097
4098
4093
4096
4094
4092
4091
4095
4070
4078
4073
4076
4074
4072
4071
4075
4080
4083
4086
4084
4082
4081
4085
4030
4036
4034
4032
4031
4035
4060
4064
4062
4061
4065
4040
4042
4041
4045
4020
4021
4025
4050
4051
4099
4077
4088
4033
4066
4044
4022
4011
4055
4079
4038
4046
4052
4089
4087
4039
4037
4026
4024
4056
4054
4069
4067
4068
4063
4049
4047
4048
4043
4029
4027
4028
4023
4059
4057
4058
4053
509
507
508
503
506
504
502
505
5090
5097
5098
5093
5096
5094
5092
5091
5095
5070
5078
5073
5076
5074
5072
5071
5075
5080
5083
5086
5084
5082
5081
5085
5030
5036
5034
5032
5031
5035
5060
5064
5062
5061
5065
5040
5042
5041
5045
5020
5021
5025
5050
5051
5099
5077
5088
5033
5066
5044
5022
5011
5055
5079
5038
5046
5052
5089
5087
5039
5037
5026
5024
5056
5054
5069
5067
5068
5063
5049
5047
5048
5043
5029
5027
5028
5023
5059
5057
5058
5053
609
607
608
603
606
604
602
605
6090
6097
6098
6093
6096
6094
6092
6091
6095
6070
6078
6073
6076
6074
6072
6071
6075
6080
6083
6086
6084
6082
6081
6085
6030
6036
6034
6032
6031
6035
6060
6064
6062
6061
6065
6040
6042
6041
6045
6020
6021
6025
6050
6051
6099
6077
6088
6033
6066
6044
6022
6011
6055
6079
6038
6046
6052
6089
6087
6039
6037
6026
6024
6056
6054
6069
6067
6068
6063
6049
6047
6048
6043
6029
6027
6028
6023
6059
6057
6058
6053
709
707
708
703
706
704
702
705
7090
7097
7098
7093
7096
7094
7092
7091
7095
7070
7078
7073
7076
7074
7072
7071
7075
7080
7083
7086
7084
7082
7081
7085
7030
7036
7034
7032
7031
7035
7060
7064
7062
7061
7065
7040
7042
7041
7045
7020
7021
7025
7050
7051
7099
7077
7088
7033
7066
7044
7022
7011
7055
7079
7038
7046
7052
7089
7087
7039
7037
7026
7024
7056
7054
7069
7067
7068
7063
7049
7047
7048
7043
7029
7027
7028
7023
7059
7057
7058
7053
809
807
808
803
806
804
802
805
8090
8097
8098
8093
8096
8094
8092
8091
8095
8070
8078
8073
8076
8074
8072
8071
8075
8080
8083
8086
8084
8082
8081
8085
8030
8036
8034
8032
8031
8035
8060
8064
8062
8061
8065
8040
8042
8041
8045
8020
8021
8025
8050
8051
8099
8077
8088
8033
8066
8044
8022
8011
8055
8079
8038
8046
8052
8089
8087
8039
8037
8026
8024
8056
8054
8069
8067
8068
8063
8049
8047
8048
8043
8029
8027
8028
8023
8059
8057
8058
8053
909
907
908
903
906
904
902
905
9090
9097
9098
9093
9096
9094
9092
9091
9095
9070
9078
9073
9076
9074
9072
9071
9075
9080
9083
9086
9084
9082
9081
9085
9030
9036
9034
9032
9031
9035
9060
9064
9062
9061
9065
9040
9042
9041
9045
9020
9021
9025
9050
9051
9099
9077
9088
9033
9066
9044
9022
9011
9055
9079
9038
9046
9052
9089
9087
9039
9037
9026
9024
9056
9054
9069
9067
9068
9063
9049
9047
9048
9043
9029
9027
9028
9023
9059
9057
9058
9053
1009
1007
1008
1003
1006
1004
1002
1005
10090
10097
10098
10093
10096
10094
10092
10091
10095
10070
10078
10073
10076
10074
10072
10071
10075
10080
10083
10086
10084
10082
10081
10085
10030
10036
10034
10032
10031
10035
10060
10064
10062
10061
10065
10040
10042
10041
10045
10020
10021
10025
10050
10051
10099
10077
10088
10033
10066
10044
10022
10011
10055
10079
10038
10046
10052
10089
10087
10039
10037
10026
10024
10056
10054
10069
10067
10068
10063
10049
10047
10048
10043
10029
10027
10028
10023
10059
10057
10058
10053
1109
1107
1108
1103
1106
1104
1102
1105
11090
11097
11098
11093
11096
11094
11092
11091
11095
11070
11078
11073
11076
11074
11072
11071
11075
11080
11083
11086
11084
11082
11081
11085
11030
11036
11034
11032
11031
11035
11060
11064
11062
11061
11065
11040
11042
11041
11045
11020
11021
11025
11050
11051
11099
11077
11088
11033
11066
11044
11022
11011
11055
11079
11038
11046
11052
11089
11087
11039
11037
11026
11024
11056
11054
11069
11067
11068
11063
11049
11047
11048
11043
11029
11027
11028
11023
11059
11057
11058
11053
159
157
158
153
1590
1597
1598
1593
1596
1594
1592
1591
1595
1570
1578
1573
1576
1574
1572
1571
1575
1580
1583
1586
1584
1582
1581
1585
1530
1536
1534
1532
1531
1535
1560
1564
1562
1561
1565
1540
1542
1541
1545
1520
1521
1525
1550
1551
1599
1577
1588
1533
1566
1544
1522
1579
1538
1546
1589
1587
1539
1537
259
257
258
253
2590
2597
2598
2593
2596
2594
2592
2591
2595
2570
2578
2573
2576
2574
2572
2571
2575
2580
2583
2586
2584
2582
2581
2585
2530
2536
2534
2532
2531
2535
2560
2564
2562
2561
2565
2540
2542
2541
2545
2520
2521
2525
2550
2551
2599
2577
2588
2533
2566
2544
2522
2579
2538
2546
2589
2587
2539
2537
359
357
358
353
3590
3597
3598
3593
3596
3594
3592
3591
3595
3570
3578
3573
3576
3574
3572
3571
3575
3580
3583
3586
3584
3582
3581
3585
3530
3536
3534
3532
3531
3535
3560
3564
3562
3561
3565
3540
3542
3541
3545
3520
3521
3525
3550
3551
3599
3577
3588
3533
3566
3544
3522
3579
3538
3546
3589
3587
3539
3537
459
457
458
453
4590
4597
4598
4593
4596
4594
4592
4591
4595
4570
4578
4573
4576
4574
4572
4571
4575
4580
4583
4586
4584
4582
4581
4585
4530
4536
4534
4532
4531
4535
4560
4564
4562
4561
4565
4540
4542
4541
4545
4520
4521
4525
4550
4551
4599
4577
4588
4533
4566
4544
4522
4579
4538
4546
4589
4587
4539
4537
559
557
558
553
5590
5597
5598
5593
5596
5594
5592
5591
5595
5570
5578
5573
5576
5574
5572
5571
5575
5580
5583
5586
5584
5582
5581
5585
5530
5536
5534
5532
5531
5535
5560
5564
5562
5561
5565
5540
5542
5541
5545
5520
5521
5525
5550
5551
5599
5577
5588
5533
5566
5544
5522
5579
5538
5546
5589
5587
5539
5537
659
657
658
653
6590
6597
6598
6593
6596
6594
6592
6591
6595
6570
6578
6573
6576
6574
6572
6571
6575
6580
6583
6586
6584
6582
6581
6585
6530
6536
6534
6532
6531
6535
6560
6564
6562
6561
6565
6540
6542
6541
6545
6520
6521
6525
6550
6551
6599
6577
6588
6533
6566
6544
6522
6579
6538
6546
6589
6587
6539
6537
759
757
758
753
7590
7597
7598
7593
7596
7594
7592
7591
7595
7570
7578
7573
7576
7574
7572
7571
7575
7580
7583
7586
7584
7582
7581
7585
7530
7536
7534
7532
7531
7535
7560
7564
7562
7561
7565
7540
7542
7541
7545
7520
7521
7525
7550
7551
7599
7577
7588
7533
7566
7544
7522
7579
7538
7546
7589
7587
7539
7537
859
857
858
853
8590
8597
8598
8593
8596
8594
8592
8591
8595
8570
8578
8573
8576
8574
8572
8571
8575
8580
8583
8586
8584
8582
8581
8585
8530
8536
8534
8532
8531
8535
8560
8564
8562
8561
8565
8540
8542
8541
8545
8520
8521
8525
8550
8551
8599
8577
8588
8533
8566
8544
8522
8579
8538
8546
8589
8587
8539
8537
959
957
958
953
9590
9597
9598
9593
9596
9594
9592
9591
9595
9570
9578
9573
9576
9574
9572
9571
9575
9580
9583
9586
9584
9582
9581
9585
9530
9536
9534
9532
9531
9535
9560
9564
9562
9561
9565
9540
9542
9541
9545
9520
9521
9525
9550
9551
9599
9577
9588
9533
9566
9544
9522
9579
9538
9546
9589
9587
9539
9537
1059
1057
1058
1053
10590
10597
10598
10593
10596
10594
10592
10591
10595
10570
10578
10573
10576
10574
10572
10571
10575
10580
10583
10586
10584
10582
10581
10585
10530
10536
10534
10532
10531
10535
10560
10564
10562
10561
10565
10540
10542
10541
10545
10520
10521
10525
10550
10551
10599
10577
10588
10533
10566
10544
10522
10579
10538
10546
10589
10587
10539
10537
1159
1157
1158
1153
11590
11597
11598
11593
11596
11594
11592
11591
11595
11570
11578
11573
11576
11574
11572
11571
11575
11580
11583
11586
11584
11582
11581
11585
11530
11536
11534
11532
11531
11535
11560
11564
11562
11561
11565
11540
11542
11541
11545
11520
11521
11525
11550
11551
11599
11577
11588
11533
11566
11544
11522
11579
11538
11546
11589
11587
11539
11537
129
127
128
123
1290
1297
1298
1293
1296
1294
1292
1291
1295
1270
1278
1273
1276
1274
1272
1271
1275
1280
1283
1286
1284
1282
1281
1285
1230
1236
1234
1232
1231
1235
1260
1264
1262
1261
1265
1240
1242
1241
1245
1220
1221
1225
1299
1277
1288
1233
1266
1244
1279
1238
1246
1289
1287
1239
1237
229
227
228
223
2290
2297
2298
2293
2296
2294
2292
2291
2295
2270
2278
2273
2276
2274
2272
2271
2275
2280
2283
2286
2284
2282
2281
2285
2230
2236
2234
2232
2231
2235
2260
2264
2262
2261
2265
2240
2242
2241
2245
2220
2221
2225
2299
2277
2288
2233
2266
2244
2279
2238
2246
2289
2287
2239
2237
329
327
328
323
3290
3297
3298
3293
3296
3294
3292
3291
3295
3270
3278
3273
3276
3274
3272
3271
3275
3280
3283
3286
3284
3282
3281
3285
3230
3236
3234
3232
3231
3235
3260
3264
3262
3261
3265
3240
3242
3241
3245
3220
3221
3225
3299
3277
3288
3233
3266
3244
3279
3238
3246
3289
3287
3239
3237
429
427
428
423
4290
4297
4298
4293
4296
4294
4292
4291
4295
4270
4278
4273
4276
4274
4272
4271
4275
4280
4283
4286
4284
4282
4281
4285
4230
4236
4234
4232
4231
4235
4260
4264
4262
4261
4265
4240
4242
4241
4245
4220
4221
4225
4299
4277
4288
4233
4266
4244
4279
4238
4246
4289
4287
4239
4237
529
527
528
523
5290
5297
5298
5293
5296
5294
5292
5291
5295
5270
5278
5273
5276
5274
5272
5271
5275
5280
5283
5286
5284
5282
5281
5285
5230
5236
5234
5232
5231
5235
5260
5264
5262
5261
5265
5240
5242
5241
5245
5220
5221
5225
5299
5277
5288
5233
5266
5244
5279
5238
5246
5289
5287
5239
5237
629
627
628
623
6290
6297
6298
6293
6296
6294
6292
6291
6295
6270
6278
6273
6276
6274
6272
6271
6275
6280
6283
6286
6284
6282
6281
6285
6230
6236
6234
6232
6231
6235
6260
6264
6262
6261
6265
6240
6242
6241
6245
6220
6221
6225
6299
6277
6288
6233
6266
6244
6279
6238
6246
6289
6287
6239
6237
729
727
728
723
7290
7297
7298
7293
7296
7294
7292
7291
7295
7270
7278
7273
7276
7274
7272
7271
7275
7280
7283
7286
7284
7282
7281
7285
7230
7236
7234
7232
7231
7235
7260
7264
7262
7261
7265
7240
7242
7241
7245
7220
7221
7225
7299
7277
7288
7233
7266
7244
7279
7238
7246
7289
7287
7239
7237
829
827
828
823
8290
8297
8298
8293
8296
8294
8292
8291
8295
8270
8278
8273
8276
8274
8272
8271
8275
8280
8283
8286
8284
8282
8281
8285
8230
8236
8234
8232
8231
8235
8260
8264
8262
8261
8265
8240
8242
8241
8245
8220
8221
8225
8299
8277
8288
8233
8266
8244
8279
8238
8246
8289
8287
8239
8237
929
927
928
923
9290
9297
9298
9293
9296
9294
9292
9291
9295
9270
9278
9273
9276
9274
9272
9271
9275
9280
9283
9286
9284
9282
9281
9285
9230
9236
9234
9232
9231
9235
9260
9264
9262
9261
9265
9240
9242
9241
9245
9220
9221
9225
9299
9277
9288
9233
9266
9244
9279
9238
9246
9289
9287
9239
9237
1029
1027
1028
1023
10290
10297
10298
10293
10296
10294
10292
10291
10295
10270
10278
10273
10276
10274
10272
10271
10275
10280
10283
10286
10284
10282
10281
10285
10230
10236
10234
10232
10231
10235
10260
10264
10262
10261
10265
10240
10242
10241
10245
10220
10221
10225
10299
10277
10288
10233
10266
10244
10279
10238
10246
10289
10287
10239
10237
1129
1127
1128
1123
11290
11297
11298
11293
11296
11294
11292
11291
11295
11270
11278
11273
11276
11274
11272
11271
11275
11280
11283
11286
11284
11282
11281
11285
11230
11236
11234
11232
11231
11235
11260
11264
11262
11261
11265
11240
11242
11241
11245
11220
11221
11225
11299
11277
11288
11233
11266
11244
11279
11238
11246
11289
11287
11239
11237
149
147
148
143
1490
1497
1498
1493
1496
1494
1492
1491
1495
1470
1478
1473
1476
1474
1472
1471
1475
1480
1483
1486
1484
1482
1481
1485
1430
1436
1434
1432
1431
1435
1460
1464
1462
1461
1465
1440
1442
1441
1445
1499
1477
1488
1433
1466
1479
1438
1489
1487
1439
1437
249
247
248
243
2490
2497
2498
2493
2496
2494
2492
2491
2495
2470
2478
2473
2476
2474
2472
2471
2475
2480
2483
2486
2484
2482
2481
2485
2430
2436
2434
2432
2431
2435
2460
2464
2462
2461
2465
2440
2442
2441
2445
2499
2477
2488
2433
2466
2479
2438
2489
2487
2439
2437
349
347
348
343
3490
3497
3498
3493
3496
3494
3492
3491
3495
3470
3478
3473
3476
3474
3472
3471
3475
3480
3483
3486
3484
3482
3481
3485
3430
3436
3434
3432
3431
3435
3460
3464
3462
3461
3465
3440
3442
3441
3445
3499
3477
3488
3433
3466
3479
3438
3489
3487
3439
3437
449
447
448
443
4490
4497
4498
4493
4496
4494
4492
4491
4495
4470
4478
4473
4476
4474
4472
4471
4475
4480
4483
4486
4484
4482
4481
4485
4430
4436
4434
4432
4431
4435
4460
4464
4462
4461
4465
4440
4442
4441
4445
4499
4477
4488
4433
4466
4479
4438
4489
4487
4439
4437
549
547
548
543
5490
5497
5498
5493
5496
5494
5492
5491
5495
5470
5478
5473
5476
5474
5472
5471
5475
5480
5483
5486
5484
5482
5481
5485
5430
5436
5434
5432
5431
5435
5460
5464
5462
5461
5465
5440
5442
5441
5445
5499
5477
5488
5433
5466
5479
5438
5489
5487
5439
5437
649
647
648
643
6490
6497
6498
6493
6496
6494
6492
6491
6495
6470
6478
6473
6476
6474
6472
6471
6475
6480
6483
6486
6484
6482
6481
6485
6430
6436
6434
6432
6431
6435
6460
6464
6462
6461
6465
6440
6442
6441
6445
6499
6477
6488
6433
6466
6479
6438
6489
6487
6439
6437
749
747
748
743
7490
7497
7498
7493
7496
7494
7492
7491
7495
7470
7478
7473
7476
7474
7472
7471
7475
7480
7483
7486
7484
7482
7481
7485
7430
7436
7434
7432
7431
7435
7460
7464
7462
7461
7465
7440
7442
7441
7445
7499
7477
7488
7433
7466
7479
7438
7489
7487
7439
7437
849
847
848
843
8490
8497
8498
8493
8496
8494
8492
8491
8495
8470
8478
8473
8476
8474
8472
8471
8475
8480
8483
8486
8484
8482
8481
8485
8430
8436
8434
8432
8431
8435
8460
8464
8462
8461
8465
8440
8442
8441
8445
8499
8477
8488
8433
8466
8479
8438
8489
8487
8439
8437
949
947
948
943
9490
9497
9498
9493
9496
9494
9492
9491
9495
9470
9478
9473
9476
9474
9472
9471
9475
9480
9483
9486
9484
9482
9481
9485
9430
9436
9434
9432
9431
9435
9460
9464
9462
9461
9465
9440
9442
9441
9445
9499
9477
9488
9433
9466
9479
9438
9489
9487
9439
9437
1049
1047
1048
1043
10490
10497
10498
10493
10496
10494
10492
10491
10495
10470
10478
10473
10476
10474
10472
10471
10475
10480
10483
10486
10484
10482
10481
10485
10430
10436
10434
10432
10431
10435
10460
10464
10462
10461
10465
10440
10442
10441
10445
10499
10477
10488
10433
10466
10479
10438
10489
10487
10439
10437
1149
1147
1148
1143
11490
11497
11498
11493
11496
11494
11492
11491
11495
11470
11478
11473
11476
11474
11472
11471
11475
11480
11483
11486
11484
11482
11481
11485
11430
11436
11434
11432
11431
11435
11460
11464
11462
11461
11465
11440
11442
11441
11445
11499
11477
11488
11433
11466
11479
11438
11489
11487
11439
11437
169
167
168
163
1690
1697
1698
1693
1696
1694
1692
1691
1695
1670
1678
1673
1676
1674
1672
1671
1675
1680
1683
1686
1684
1682
1681
1685
1630
1636
1634
1632
1631
1635
1660
1664
1662
1661
1665
1699
1677
1688
1633
1679
1638
1689
1687
1639
1637
269
267
268
263
2690
2697
2698
2693
2696
2694
2692
2691
2695
2670
2678
2673
2676
2674
2672
2671
2675
2680
2683
2686
2684
2682
2681
2685
2630
2636
2634
2632
2631
2635
2660
2664
2662
2661
2665
2699
2677
2688
2633
2679
2638
2689
2687
2639
2637
369
367
368
363
3690
3697
3698
3693
3696
3694
3692
3691
3695
3670
3678
3673
3676
3674
3672
3671
3675
3680
3683
3686
3684
3682
3681
3685
3630
3636
3634
3632
3631
3635
3660
3664
3662
3661
3665
3699
3677
3688
3633
3679
3638
3689
3687
3639
3637
469
467
468
463
4690
4697
4698
4693
4696
4694
4692
4691
4695
4670
4678
4673
4676
4674
4672
4671
4675
4680
4683
4686
4684
4682
4681
4685
4630
4636
4634
4632
4631
4635
4660
4664
4662
4661
4665
4699
4677
4688
4633
4679
4638
4689
4687
4639
4637
569
567
568
563
5690
5697
5698
5693
5696
5694
5692
5691
5695
5670
5678
5673
5676
5674
5672
5671
5675
5680
5683
5686
5684
5682
5681
5685
5630
5636
5634
5632
5631
5635
5660
5664
5662
5661
5665
5699
5677
5688
5633
5679
5638
5689
5687
5639
5637
669
667
668
663
6690
6697
6698
6693
6696
6694
6692
6691
6695
6670
6678
6673
6676
6674
6672
6671
6675
6680
6683
6686
6684
6682
6681
6685
6630
6636
6634
6632
6631
6635
6660
6664
6662
6661
6665
6699
6677
6688
6633
6679
6638
6689
6687
6639
6637
769
767
768
763
7690
7697
7698
7693
7696
7694
7692
7691
7695
7670
7678
7673
7676
7674
7672
7671
7675
7680
7683
7686
7684
7682
7681
7685
7630
7636
7634
7632
7631
7635
7660
7664
7662
7661
7665
7699
7677
7688
7633
7679
7638
7689
7687
7639
7637
869
867
868
863
8690
8697
8698
8693
8696
8694
8692
8691
8695
8670
8678
8673
8676
8674
8672
8671
8675
8680
8683
8686
8684
8682
8681
8685
8630
8636
8634
8632
8631
8635
8660
8664
8662
8661
8665
8699
8677
8688
8633
8679
8638
8689
8687
8639
8637
969
967
968
963
9690
9697
9698
9693
9696
9694
9692
9691
9695
9670
9678
9673
9676
9674
9672
9671
9675
9680
9683
9686
9684
9682
9681
9685
9630
9636
9634
9632
9631
9635
9660
9664
9662
9661
9665
9699
9677
9688
9633
9679
9638
9689
9687
9639
9637
1069
1067
1068
1063
10690
10697
10698
10693
10696
10694
10692
10691
10695
10670
10678
10673
10676
10674
10672
10671
10675
10680
10683
10686
10684
10682
10681
10685
10630
10636
10634
10632
10631
10635
10660
10664
10662
10661
10665
10699
10677
10688
10633
10679
10638
10689
10687
10639
10637
1169
1167
1168
1163
11690
11697
11698
11693
11696
11694
11692
11691
11695
11670
11678
11673
11676
11674
11672
11671
11675
11680
11683
11686
11684
11682
11681
11685
11630
11636
11634
11632
11631
11635
11660
11664
11662
11661
11665
11699
11677
11688
11633
11679
11638
11689
11687
11639
11637
1390
1397
1398
1393
1396
1394
1392
1391
1395
1370
1378
1373
1376
1374
1372
1371
1375
1380
1383
1386
1384
1382
1381
1385
1330
1336
1334
1332
1331
1335
1399
1377
1388
1379
2390
2397
2398
2393
2396
2394
2392
2391
2395
2370
2378
2373
2376
2374
2372
2371
2375
2380
2383
2386
2384
2382
2381
2385
2330
2336
2334
2332
2331
2335
2399
2377
2388
2379
3390
3397
3398
3393
3396
3394
3392
3391
3395
3370
3378
3373
3376
3374
3372
3371
3375
3380
3383
3386
3384
3382
3381
3385
3330
3336
3334
3332
3331
3335
3399
3377
3388
3379
4390
4397
4398
4393
4396
4394
4392
4391
4395
4370
4378
4373
4376
4374
4372
4371
4375
4380
4383
4386
4384
4382
4381
4385
4330
4336
4334
4332
4331
4335
4399
4377
4388
4379
5390
5397
5398
5393
5396
5394
5392
5391
5395
5370
5378
5373
5376
5374
5372
5371
5375
5380
5383
5386
5384
5382
5381
5385
5330
5336
5334
5332
5331
5335
5399
5377
5388
5379
6390
6397
6398
6393
6396
6394
6392
6391
6395
6370
6378
6373
6376
6374
6372
6371
6375
6380
6383
6386
6384
6382
6381
6385
6330
6336
6334
6332
6331
6335
6399
6377
6388
6379
7390
7397
7398
7393
7396
7394
7392
7391
7395
7370
7378
7373
7376
7374
7372
7371
7375
7380
7383
7386
7384
7382
7381
7385
7330
7336
7334
7332
7331
7335
7399
7377
7388
7379
8390
8397
8398
8393
8396
8394
8392
8391
8395
8370
8378
8373
8376
8374
8372
8371
8375
8380
8383
8386
8384
8382
8381
8385
8330
8336
8334
8332
8331
8335
8399
8377
8388
8379
9390
9397
9398
9393
9396
9394
9392
9391
9395
9370
9378
9373
9376
9374
9372
9371
9375
9380
9383
9386
9384
9382
9381
9385
9330
9336
9334
9332
9331
9335
9399
9377
9388
9379
10390
10397
10398
10393
10396
10394
10392
10391
10395
10370
10378
10373
10376
10374
10372
10371
10375
10380
10383
10386
10384
10382
10381
10385
10330
10336
10334
10332
10331
10335
10399
10377
10388
10379
11390
11397
11398
11393
11396
11394
11392
11391
11395
11370
11378
11373
11376
11374
11372
11371
11375
11380
11383
11386
11384
11382
11381
11385
11330
11336
11334
11332
11331
11335
11399
11377
11388
11379
1890
1897
1898
1893
1896
1894
1892
1891
1895
1870
1878
1873
1876
1874
1872
1871
1875
1880
1883
1886
1884
1882
1881
1885
1899
1877
1879
2890
2897
2898
2893
2896
2894
2892
2891
2895
2870
2878
2873
2876
2874
2872
2871
2875
2880
2883
2886
2884
2882
2881
2885
2899
2877
2879
3890
3897
3898
3893
3896
3894
3892
3891
3895
3870
3878
3873
3876
3874
3872
3871
3875
3880
3883
3886
3884
3882
3881
3885
3899
3877
3879
4890
4897
4898
4893
4896
4894
4892
4891
4895
4870
4878
4873
4876
4874
4872
4871
4875
4880
4883
4886
4884
4882
4881
4885
4899
4877
4879
5890
5897
5898
5893
5896
5894
5892
5891
5895
5870
5878
5873
5876
5874
5872
5871
5875
5880
5883
5886
5884
5882
5881
5885
5899
5877
5879
6890
6897
6898
6893
6896
6894
6892
6891
6895
6870
6878
6873
6876
6874
6872
6871
6875
6880
6883
6886
6884
6882
6881
6885
6899
6877
6879
7890
7897
7898
7893
7896
7894
7892
7891
7895
7870
7878
7873
7876
7874
7872
7871
7875
7880
7883
7886
7884
7882
7881
7885
7899
7877
7879
8890
8897
8898
8893
8896
8894
8892
8891
8895
8870
8878
8873
8876
8874
8872
8871
8875
8880
8883
8886
8884
8882
8881
8885
8899
8877
8879
9890
9897
9898
9893
9896
9894
9892
9891
9895
9870
9878
9873
9876
9874
9872
9871
9875
9880
9883
9886
9884
9882
9881
9885
9899
9877
9879
10890
10897
10898
10893
10896
10894
10892
10891
10895
10870
10878
10873
10876
10874
10872
10871
10875
10880
10883
10886
10884
10882
10881
10885
10899
10877
10879
11890
11897
11898
11893
11896
11894
11892
11891
11895
11870
11878
11873
11876
11874
11872
11871
11875
11880
11883
11886
11884
11882
11881
11885
11899
11877
11879
1790
1797
1798
1793
1796
1794
1792
1791
1795
1770
1778
1773
1776
1774
1772
1771
1775
1799
2790
2797
2798
2793
2796
2794
2792
2791
2795
2770
2778
2773
2776
2774
2772
2771
2775
2799
3790
3797
3798
3793
3796
3794
3792
3791
3795
3770
3778
3773
3776
3774
3772
3771
3775
3799
4790
4797
4798
4793
4796
4794
4792
4791
4795
4770
4778
4773
4776
4774
4772
4771
4775
4799
5790
5797
5798
5793
5796
5794
5792
5791
5795
5770
5778
5773
5776
5774
5772
5771
5775
5799
6790
6797
6798
6793
6796
6794
6792
6791
6795
6770
6778
6773
6776
6774
6772
6771
6775
6799
7790
7797
7798
7793
7796
7794
7792
7791
7795
7770
7778
7773
7776
7774
7772
7771
7775
7799
8790
8797
8798
8793
8796
8794
8792
8791
8795
8770
8778
8773
8776
8774
8772
8771
8775
8799
9790
9797
9798
9793
9796
9794
9792
9791
9795
9770
9778
9773
9776
9774
9772
9771
9775
9799
10790
10797
10798
10793
10796
10794
10792
10791
10795
10770
10778
10773
10776
10774
10772
10771
10775
10799
11790
11797
11798
11793
11796
11794
11792
11791
11795
11770
11778
11773
11776
11774
11772
11771
11775
11799
1900
1909
1907
1908
1903
1906
1904
1902
1901
1905
1970
1979
1977
1978
1973
1976
1974
1972
1971
1975
1980
1989
1987
1988
1983
1986
1984
1982
1981
1985
1930
1939
1937
1938
1933
1936
1934
1932
1931
1935
1960
1969
1967
1968
1963
1966
1964
1962
1961
1965
1940
1949
1947
1948
1943
1946
1944
1942
1941
1945
1920
1929
1927
1928
1923
1926
1924
1922
1921
1925
1910
1919
1917
1918
1913
1916
1914
1912
1911
1915
1950
1959
1957
1958
1953
1956
1954
1952
1951
1955
1700
1709
1707
1708
1703
1706
1704
1702
1701
1705
1780
1789
1787
1788
1783
1786
1784
1782
1781
1785
1730
1739
1737
1738
1733
1736
1734
1732
1731
1735
1760
1769
1767
1768
1763
1766
1764
1762
1761
1765
1740
1749
1747
1748
1743
1746
1744
1742
1741
1745
1720
1729
1727
1728
1723
1726
1724
1722
1721
1725
1710
1719
1717
1718
1713
1716
1714
1712
1711
1715
1750
1759
1757
1758
1753
1756
1754
1752
1751
1755
1800
1809
1807
1808
1803
1806
1804
1802
1801
1805
1830
1839
1837
1838
1833
1836
1834
1832
1831
1835
1860
1869
1867
1868
1863
1866
1864
1862
1861
1865
1840
1849
1847
1848
1843
1846
1844
1842
1841
1845
1820
1829
1827
1828
1823
1826
1824
1822
1821
1825
1810
1819
1817
1818
1813
1816
1814
1812
1811
1815
1850
1859
1857
1858
1853
1856
1854
1852
1851
1855
1300
1309
1307
1308
1303
1306
1304
1302
1301
1305
1360
1369
1367
1368
1363
1366
1364
1362
1361
1365
1340
1349
1347
1348
1343
1346
1344
1342
1341
1345
1320
1329
1327
1328
1323
1326
1324
1322
1321
1325
1310
1319
1317
1318
1313
1316
1314
1312
1311
1315
1350
1359
1357
1358
1353
1356
1354
1352
1351
1355
1600
1609
1607
1608
1603
1606
1604
1602
1601
1605
1640
1649
1647
1648
1643
1646
1644
1642
1641
1645
1620
1629
1627
1628
1623
1626
1624
1622
1621
1625
1610
1619
1617
1618
1613
1616
1614
1612
1611
1615
1650
1659
1657
1658
1653
1656
1654
1652
1651
1655
1400
1409
1407
1408
1403
1406
1404
1402
1401
1405
1420
1429
1427
1428
1423
1426
1424
1422
1421
1425
1410
1419
1417
1418
1413
1416
1414
1412
1411
1415
1450
1459
1457
1458
1453
1456
1454
1452
1451
1455
1200
1209
1207
1208
1203
1206
1204
1202
1201
1205
1210
1219
1217
1218
1213
1216
1214
1212
1211
1215
1250
1259
1257
1258
1253
1256
1254
1252
1251
1255
1500
1509
1507
1508
1503
1506
1504
1502
1501
1505
1510
1519
1517
1518
1513
1516
1514
1512
1511
1515
2900
2909
2907
2908
2903
2906
2904
2902
2901
2905
2970
2979
2977
2978
2973
2976
2974
2972
2971
2975
2980
2989
2987
2988
2983
2986
2984
2982
2981
2985
2930
2939
2937
2938
2933
2936
2934
2932
2931
2935
2960
2969
2967
2968
2963
2966
2964
2962
2961
2965
2940
2949
2947
2948
2943
2946
2944
2942
2941
2945
2920
2929
2927
2928
2923
2926
2924
2922
2921
2925
2910
2919
2917
2918
2913
2916
2914
2912
2911
2915
2950
2959
2957
2958
2953
2956
2954
2952
2951
2955
2700
2709
2707
2708
2703
2706
2704
2702
2701
2705
2780
2789
2787
2788
2783
2786
2784
2782
2781
2785
2730
2739
2737
2738
2733
2736
2734
2732
2731
2735
2760
2769
2767
2768
2763
2766
2764
2762
2761
2765
2740
2749
2747
2748
2743
2746
2744
2742
2741
2745
2720
2729
2727
2728
2723
2726
2724
2722
2721
2725
2710
2719
2717
2718
2713
2716
2714
2712
2711
2715
2750
2759
2757
2758
2753
2756
2754
2752
2751
2755
2800
2809
2807
2808
2803
2806
2804
2802
2801
2805
2830
2839
2837
2838
2833
2836
2834
2832
2831
2835
2860
2869
2867
2868
2863
2866
2864
2862
2861
2865
2840
2849
2847
2848
2843
2846
2844
2842
2841
2845
2820
2829
2827
2828
2823
2826
2824
2822
2821
2825
2810
2819
2817
2818
2813
2816
2814
2812
2811
2815
2850
2859
2857
2858
2853
2856
2854
2852
2851
2855
2300
2309
2307
2308
2303
2306
2304
2302
2301
2305
2360
2369
2367
2368
2363
2366
2364
2362
2361
2365
2340
2349
2347
2348
2343
2346
2344
2342
2341
2345
2320
2329
2327
2328
2323
2326
2324
2322
2321
2325
2310
2319
2317
2318
2313
2316
2314
2312
2311
2315
2350
2359
2357
2358
2353
2356
2354
2352
2351
2355
2600
2609
2607
2608
2603
2606
2604
2602
2601
2605
2640
2649
2647
2648
2643
2646
2644
2642
2641
2645
2620
2629
2627
2628
2623
2626
2624
2622
2621
2625
2610
2619
2617
2618
2613
2616
2614
2612
2611
2615
2650
2659
2657
2658
2653
2656
2654
2652
2651
2655
2400
2409
2407
2408
2403
2406
2404
2402
2401
2405
2420
2429
2427
2428
2423
2426
2424
2422
2421
2425
2410
2419
2417
2418
2413
2416
2414
2412
2411
2415
2450
2459
2457
2458
2453
2456
2454
2452
2451
2455
2200
2209
2207
2208
2203
2206
2204
2202
2201
2205
2210
2219
2217
2218
2213
2216
2214
2212
2211
2215
2250
2259
2257
2258
2253
2256
2254
2252
2251
2255
2500
2509
2507
2508
2503
2506
2504
2502
2501
2505
2510
2519
2517
2518
2513
2516
2514
2512
2511
2515
2000
2009
2007
2008
2003
2006
2004
2002
2001
2005
2110
2119
2117
2118
2113
2116
2114
2112
2111
2115
3900
3909
3907
3908
3903
3906
3904
3902
3901
3905
3970
3979
3977
3978
3973
3976
3974
3972
3971
3975
3980
3989
3987
3988
3983
3986
3984
3982
3981
3985
3930
3939
3937
3938
3933
3936
3934
3932
3931
3935
3960
3969
3967
3968
3963
3966
3964
3962
3961
3965
3940
3949
3947
3948
3943
3946
3944
3942
3941
3945
3920
3929
3927
3928
3923
3926
3924
3922
3921
3925
3910
3919
3917
3918
3913
3916
3914
3912
3911
3915
3950
3959
3957
3958
3953
3956
3954
3952
3951
3955
3700
3709
3707
3708
3703
3706
3704
3702
3701
3705
3780
3789
3787
3788
3783
3786
3784
3782
3781
3785
3730
3739
3737
3738
3733
3736
3734
3732
3731
3735
3760
3769
3767
3768
3763
3766
3764
3762
3761
3765
3740
3749
3747
3748
3743
3746
3744
3742
3741
3745
3720
3729
3727
3728
3723
3726
3724
3722
3721
3725
3710
3719
3717
3718
3713
3716
3714
3712
3711
3715
3750
3759
3757
3758
3753
3756
3754
3752
3751
3755
3800
3809
3807
3808
3803
3806
3804
3802
3801
3805
3830
3839
3837
3838
3833
3836
3834
3832
3831
3835
3860
3869
3867
3868
3863
3866
3864
3862
3861
3865
3840
3849
3847
3848
3843
3846
3844
3842
3841
3845
3820
3829
3827
3828
3823
3826
3824
3822
3821
3825
3810
3819
3817
3818
3813
3816
3814
3812
3811
3815
3850
3859
3857
3858
3853
3856
3854
3852
3851
3855
3300
3309
3307
3308
3303
3306
3304
3302
3301
3305
3360
3369
3367
3368
3363
3366
3364
3362
3361
3365
3340
3349
3347
3348
3343
3346
3344
3342
3341
3345
3320
3329
3327
3328
3323
3326
3324
3322
3321
3325
3310
3319
3317
3318
3313
3316
3314
3312
3311
3315
3350
3359
3357
3358
3353
3356
3354
3352
3351
3355
3600
3609
3607
3608
3603
3606
3604
3602
3601
3605
3640
3649
3647
3648
3643
3646
3644
3642
3641
3645
3620
3629
3627
3628
3623
3626
3624
3622
3621
3625
3610
3619
3617
3618
3613
3616
3614
3612
3611
3615
3650
3659
3657
3658
3653
3656
3654
3652
3651
3655
3400
3409
3407
3408
3403
3406
3404
3402
3401
3405
3420
3429
3427
3428
3423
3426
3424
3422
3421
3425
3410
3419
3417
3418
3413
3416
3414
3412
3411
3415
3450
3459
3457
3458
3453
3456
3454
3452
3451
3455
3200
3209
3207
3208
3203
3206
3204
3202
3201
3205
3210
3219
3217
3218
3213
3216
3214
3212
3211
3215
3250
3259
3257
3258
3253
3256
3254
3252
3251
3255
3500
3509
3507
3508
3503
3506
3504
3502
3501
3505
3510
3519
3517
3518
3513
3516
3514
3512
3511
3515
3000
3009
3007
3008
3003
3006
3004
3002
3001
3005
3110
3119
3117
3118
3113
3116
3114
3112
3111
3115
4900
4909
4907
4908
4903
4906
4904
4902
4901
4905
4970
4979
4977
4978
4973
4976
4974
4972
4971
4975
4980
4989
4987
4988
4983
4986
4984
4982
4981
4985
4930
4939
4937
4938
4933
4936
4934
4932
4931
4935
4960
4969
4967
4968
4963
4966
4964
4962
4961
4965
4940
4949
4947
4948
4943
4946
4944
4942
4941
4945
4920
4929
4927
4928
4923
4926
4924
4922
4921
4925
4910
4919
4917
4918
4913
4916
4914
4912
4911
4915
4950
4959
4957
4958
4953
4956
4954
4952
4951
4955
4700
4709
4707
4708
4703
4706
4704
4702
4701
4705
4780
4789
4787
4788
4783
4786
4784
4782
4781
4785
4730
4739
4737
4738
4733
4736
4734
4732
4731
4735
4760
4769
4767
4768
4763
4766
4764
4762
4761
4765
4740
4749
4747
4748
4743
4746
4744
4742
4741
4745
4720
4729
4727
4728
4723
4726
4724
4722
4721
4725
4710
4719
4717
4718
4713
4716
4714
4712
4711
4715
4750
4759
4757
4758
4753
4756
4754
4752
4751
4755
4800
4809
4807
4808
4803
4806
4804
4802
4801
4805
4830
4839
4837
4838
4833
4836
4834
4832
4831
4835
4860
4869
4867
4868
4863
4866
4864
4862
4861
4865
4840
4849
4847
4848
4843
4846
4844
4842
4841
4845
4820
4829
4827
4828
4823
4826
4824
4822
4821
4825
4810
4819
4817
4818
4813
4816
4814
4812
4811
4815
4850
4859
4857
4858
4853
4856
4854
4852
4851
4855
4300
4309
4307
4308
4303
4306
4304
4302
4301
4305
4360
4369
4367
4368
4363
4366
4364
4362
4361
4365
4340
4349
4347
4348
4343
4346
4344
4342
4341
4345
4320
4329
4327
4328
4323
4326
4324
4322
4321
4325
4310
4319
4317
4318
4313
4316
4314
4312
4311
4315
4350
4359
4357
4358
4353
4356
4354
4352
4351
4355
4600
4609
4607
4608
4603
4606
4604
4602
4601
4605
4640
4649
4647
4648
4643
4646
4644
4642
4641
4645
4620
4629
4627
4628
4623
4626
4624
4622
4621
4625
4610
4619
4617
4618
4613
4616
4614
4612
4611
4615
4650
4659
4657
4658
4653
4656
4654
4652
4651
4655
4400
4409
4407
4408
4403
4406
4404
4402
4401
4405
4420
4429
4427
4428
4423
4426
4424
4422
4421
4425
4410
4419
4417
4418
4413
4416
4414
4412
4411
4415
4450
4459
4457
4458
4453
4456
4454
4452
4451
4455
4200
4209
4207
4208
4203
4206
4204
4202
4201
4205
4210
4219
4217
4218
4213
4216
4214
4212
4211
4215
4250
4259
4257
4258
4253
4256
4254
4252
4251
4255
4500
4509
4507
4508
4503
4506
4504
4502
4501
4505
4510
4519
4517
4518
4513
4516
4514
4512
4511
4515
4000
4009
4007
4008
4003
4006
4004
4002
4001
4005
4110
4119
4117
4118
4113
4116
4114
4112
4111
4115
5900
5909
5907
5908
5903
5906
5904
5902
5901
5905
5970
5979
5977
5978
5973
5976
5974
5972
5971
5975
5980
5989
5987
5988
5983
5986
5984
5982
5981
5985
5930
5939
5937
5938
5933
5936
5934
5932
5931
5935
5960
5969
5967
5968
5963
5966
5964
5962
5961
5965
5940
5949
5947
5948
5943
5946
5944
5942
5941
5945
5920
5929
5927
5928
5923
5926
5924
5922
5921
5925
5910
5919
5917
5918
5913
5916
5914
5912
5911
5915
5950
5959
5957
5958
5953
5956
5954
5952
5951
5955
5700
5709
5707
5708
5703
5706
5704
5702
5701
5705
5780
5789
5787
5788
5783
5786
5784
5782
5781
5785
5730
5739
5737
5738
5733
5736
5734
5732
5731
5735
5760
5769
5767
5768
5763
5766
5764
5762
5761
5765
5740
5749
5747
5748
5743
5746
5744
5742
5741
5745
5720
5729
5727
5728
5723
5726
5724
5722
5721
5725
5710
5719
5717
5718
5713
5716
5714
5712
5711
5715
5750
5759
5757
5758
5753
5756
5754
5752
5751
5755
5800
5809
5807
5808
5803
5806
5804
5802
5801
5805
5830
5839
5837
5838
5833
5836
5834
5832
5831
5835
5860
5869
5867
5868
5863
5866
5864
5862
5861
5865
5840
5849
5847
5848
5843
5846
5844
5842
5841
5845
5820
5829
5827
5828
5823
5826
5824
5822
5821
5825
5810
5819
5817
5818
5813
5816
5814
5812
5811
5815
5850
5859
5857
5858
5853
5856
5854
5852
5851
5855
5300
5309
5307
5308
5303
5306
5304
5302
5301
5305
5360
5369
5367
5368
5363
5366
5364
5362
5361
5365
5340
5349
5347
5348
5343
5346
5344
5342
5341
5345
5320
5329
5327
5328
5323
5326
5324
5322
5321
5325
5310
5319
5317
5318
5313
5316
5314
5312
5311
5315
5350
5359
5357
5358
5353
5356
5354
5352
5351
5355
5600
5609
5607
5608
5603
5606
5604
5602
5601
5605
5640
5649
5647
5648
5643
5646
5644
5642
5641
5645
5620
5629
5627
5628
5623
5626
5624
5622
5621
5625
5610
5619
5617
5618
5613
5616
5614
5612
5611
5615
5650
5659
5657
5658
5653
5656
5654
5652
5651
5655
5400
5409
5407
5408
5403
5406
5404
5402
5401
5405
5420
5429
5427
5428
5423
5426
5424
5422
5421
5425
5410
5419
5417
5418
5413
5416
5414
5412
5411
5415
5450
5459
5457
5458
5453
5456
5454
5452
5451
5455
5200
5209
5207
5208
5203
5206
5204
5202
5201
5205
5210
5219
5217
5218
5213
5216
5214
5212
5211
5215
5250
5259
5257
5258
5253
5256
5254
5252
5251
5255
5500
5509
5507
5508
5503
5506
5504
5502
5501
5505
5510
5519
5517
5518
5513
5516
5514
5512
5511
5515
5000
5009
5007
5008
5003
5006
5004
5002
5001
5005
5110
5119
5117
5118
5113
5116
5114
5112
5111
5115
6900
6909
6907
6908
6903
6906
6904
6902
6901
6905
6970
6979
6977
6978
6973
6976
6974
6972
6971
6975
6980
6989
6987
6988
6983
6986
6984
6982
6981
6985
6930
6939
6937
6938
6933
6936
6934
6932
6931
6935
6960
6969
6967
6968
6963
6966
6964
6962
6961
6965
6940
6949
6947
6948
6943
6946
6944
6942
6941
6945
6920
6929
6927
6928
6923
6926
6924
6922
6921
6925
6910
6919
6917
6918
6913
6916
6914
6912
6911
6915
6950
6959
6957
6958
6953
6956
6954
6952
6951
6955
6700
6709
6707
6708
6703
6706
6704
6702
6701
6705
6780
6789
6787
6788
6783
6786
6784
6782
6781
6785
6730
6739
6737
6738
6733
6736
6734
6732
6731
6735
6760
6769
6767
6768
6763
6766
6764
6762
6761
6765
6740
6749
6747
6748
6743
6746
6744
6742
6741
6745
6720
6729
6727
6728
6723
6726
6724
6722
6721
6725
6710
6719
6717
6718
6713
6716
6714
6712
6711
6715
6750
6759
6757
6758
6753
6756
6754
6752
6751
6755
6800
6809
6807
6808
6803
6806
6804
6802
6801
6805
6830
6839
6837
6838
6833
6836
6834
6832
6831
6835
6860
6869
6867
6868
6863
6866
6864
6862
6861
6865
6840
6849
6847
6848
6843
6846
6844
6842
6841
6845
6820
6829
6827
6828
6823
6826
6824
6822
6821
6825
6810
6819
6817
6818
6813
6816
6814
6812
6811
6815
6850
6859
6857
6858
6853
6856
6854
6852
6851
6855
6300
6309
6307
6308
6303
6306
6304
6302
6301
6305
6360
6369
6367
6368
6363
6366
6364
6362
6361
6365
6340
6349
6347
6348
6343
6346
6344
6342
6341
6345
6320
6329
6327
6328
6323
6326
6324
6322
6321
6325
6310
6319
6317
6318
6313
6316
6314
6312
6311
6315
6350
6359
6357
6358
6353
6356
6354
6352
6351
6355
6600
6609
6607
6608
6603
6606
6604
6602
6601
6605
6640
6649
6647
6648
6643
6646
6644
6642
6641
6645
6620
6629
6627
6628
6623
6626
6624
6622
6621
6625
6610
6619
6617
6618
6613
6616
6614
6612
6611
6615
6650
6659
6657
6658
6653
6656
6654
6652
6651
6655
6400
6409
6407
6408
6403
6406
6404
6402
6401
6405
6420
6429
6427
6428
6423
6426
6424
6422
6421
6425
6410
6419
6417
6418
6413
6416
6414
6412
6411
6415
6450
6459
6457
6458
6453
6456
6454
6452
6451
6455
6200
6209
6207
6208
6203
6206
6204
6202
6201
6205
6210
6219
6217
6218
6213
6216
6214
6212
6211
6215
6250
6259
6257
6258
6253
6256
6254
6252
6251
6255
6500
6509
6507
6508
6503
6506
6504
6502
6501
6505
6510
6519
6517
6518
6513
6516
6514
6512
6511
6515
6000
6009
6007
6008
6003
6006
6004
6002
6001
6005
6110
6119
6117
6118
6113
6116
6114
6112
6111
6115
7900
7909
7907
7908
7903
7906
7904
7902
7901
7905
7970
7979
7977
7978
7973
7976
7974
7972
7971
7975
7980
7989
7987
7988
7983
7986
7984
7982
7981
7985
7930
7939
7937
7938
7933
7936
7934
7932
7931
7935
7960
7969
7967
7968
7963
7966
7964
7962
7961
7965
7940
7949
7947
7948
7943
7946
7944
7942
7941
7945
7920
7929
7927
7928
7923
7926
7924
7922
7921
7925
7910
7919
7917
7918
7913
7916
7914
7912
7911
7915
7950
7959
7957
7958
7953
7956
7954
7952
7951
7955
7700
7709
7707
7708
7703
7706
7704
7702
7701
7705
7780
7789
7787
7788
7783
7786
7784
7782
7781
7785
7730
7739
7737
7738
7733
7736
7734
7732
7731
7735
7760
7769
7767
7768
7763
7766
7764
7762
7761
7765
7740
7749
7747
7748
7743
7746
7744
7742
7741
7745
7720
7729
7727
7728
7723
7726
7724
7722
7721
7725
7710
7719
7717
7718
7713
7716
7714
7712
7711
7715
7750
7759
7757
7758
7753
7756
7754
7752
7751
7755
7800
7809
7807
7808
7803
7806
