[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
3958
2926
4869
9125
8467
540
18
9855
864
6900
3165
2913
5792
1039
6021
7528
1640
410
1151
8863
7150
9996
8553
2569
7518
4622
8810
5636
9389
1313
1354
966
175
3214
2093
5963
2231
5538
3642
6225
71
5339
3708
7736
7075
8730
7381
2414
8532
6144
7447
6537
4925
1555
1781
7848
2561
6510
9618
7476
3096
7130
4793
7872
7790
7720
2622
6796
4676
6961
2028
3887
2067
4972
4176
571
8561
3854
2488
7414
5825
840
1621
4462
8877
4383
9044
2007
2872
6644
5289
7789
8316
3764
9628
6579
9226
9630
2222
3690
1710
6591
9180
3236
4860
7124
7173
5030
9054
9217
6530
2883
2802
2081
5887
3863
8381
3572
4280
7117
8104
2221
7194
7439
8371
3882
4570
9425
2397
3670
9619
1951
9898
7806
1453
4021
7442
1101
8278
770
2610
2210
173
9328
3118
5686
9494
7945
6658
2498
8988
9268
2159
4938
2733
9497
1841
373
5849
3526
2097
4141
962
1019
1620
8513
5489
293
2592
9925
4528
6142
9444
4348
3227
7667
4836
9756
4276
6706
1073
5119
1717
6497
6777
1644
3699
887
281
5678
5458
5583
437
8743
5180
9952
4643
4411
6405
3383
5425
4896
6519
9577
8740
92
4948
9907
5542
1821
8982
8059
7817
943
9224
919
6236
6643
9589
818
598
9066
1055
4849
7263
2170
939
2788
8770
33
904
1601
469
1672
34
1205
9393
688
388
6041
4805
482
8267
5238
514
5473
4539
3742
3285
5998
748
5807
4625
5440
5584
2038
3119
3314
1434
9850
9431
4119
2613
743
4465
8709
4692
9498
2623
791
7750
5501
3934
5510
5603
8747
9713
9516
9554
425
1754
5154
9337
2539
2012
1535
2845
8538
5709
8335
5835
631
9733
6926
1812
4585
3559
1916
6433
4185
6333
8024
3027
3055
9591
4165
3222
1763
2731
5764
1494
5962
4159
6566
5491
3258
227
8579
565
7930
3472
3333
8050
2667
581
7519
9407
4519
3153
6512
9579
2528
2070
5830
543
1339
1164
3485
3632
5197
8339
6674
4695
4530
2751
6354
2207
9659
111
8020
765
7467
5769
1536
6649
22
5776
5733
9735
1588
8390
1531
9813
3936
1815
7206
4560
3449
3042
524
702
5183
6829
881
7792
3435
1927
8363
5609
4645
3481
2179
2824
1495
1061
9604
9999
6205
1558
7713
788
2663
5645
7650
9179
574
9336
9751
5852
7969
223
2370
7937
3599
9690
96
6016
5748
1808
8213
8580
9406
455
6370
8089
8106
1671
3293
8264
8429
7778
7543
4820
8676
4597
1992
4206
4239
2674
1500
7295
3664
3013
4429
4217
6298
7486
8908
4135
907
2127
8122
6913
365
3709
9725
731
8270
2511
4149
9905
5182
7561
7714
7456
2109
2521
1384
1863
5304
944
9322
6935
267
7189
2305
2544
3630
3054
6738
8732
6082
5057
7183
5211
3456
3895
8111
8484
4965
8926
2995
9574
7842
9612
5479
3492
8470
8745
1892
7923
2072
19
5109
499
8785
3669
3560
8733
6543
8183
2359
301
305
3905
9866
4795
4023
6047
1792
6856
5814
2850
5708
8063
1707
2293
8622
9664
4251
3903
4732
7603
2418
7578
4263
526
936
8672
9596
1678
7660
2189
3098
6426
6995
5660
8883
3674
2587
1670
691
4313
7595
9708
3843
5107
5901
9529
9069
2653
1100
8620
7180
1
2358
1308
2701
5995
8362
4443
9844
9293
914
7920
8065
3288
8287
7368
4894
6248
3039
6013
5735
3999
6576
7407
7599
2565
3762
9744
595
9215
2795
6056
1542
8847
6206
5911
7303
2856
3740
9526
9521
4476
6046
3289
7934
8562
6310
496
3706
4571
403
6208
601
8318
333
4721
6951
4455
7645
8673
5968
6189
5989
6440
3775
749
6927
83
5150
2536
4062
8465
9397
4697
5816
1562
7234
1512
6049
2245
3861
9165
58
6107
8879
5766
7845
6350
2248
6855
2345
1824
6377
2173
3790
9465
7332
9807
5201
8224
2814
3520
104
6699
6431
716
653
3610
878
1129
3410
1337
5734
6492
4806
6327
998
4685
3976
7664
3528
9294
6888
509
1655
6165
3625
4007
9330
7665
9495
9610
7594
4689
237
7826
5418
9115
4699
2737
7198
1432
1560
8859
9114
7081
2692
8244
1497
6831
2341
2688
1155
739
8893
837
4538
8462
9982
2675
7858
7900
1376
2716
7152
4716
4513
1460
161
2256
5765
8311
1001
1993
7854
5731
6396
6684
405
1325
1897
2062
4197
5711
7209
784
2464
3307
9503
9395
6615
7799
9670
7533
4584
7468
2026
8605
8958
1846
4696
1236
5605
5357
8324
1803
4386
1371
4130
5178
2979
4529
7741
3009
4184
7821
7
5908
3685
1089
5873
9188
8951
5726
5151
3407
1704
4232
7396
544
6526
8741
2965
7769
2057
4402
830
8956
1716
1576
7378
5486
6971
1016
2404
3649
1641
4629
3890
3788
7800
5400
4031
2074
663
3295
626
5953
1092
8689
5275
4034
4331
5916
9814
8427
6605
2880
4464
3739
4618
5420
5189
6138
9775
5053
7473
2551
3325
4503
8160
1024
2437
1839
2375
6123
2008
4186
6508
9463
8900
9667
1589
3700
7435
6521
8146
550
2994
8295
4046
4632
9904
2224
5567
3095
6141
2636
3725
3180
5188
6147
8401
6093
3171
3356
3810
1958
9706
2152
1213
1224
9046
6143
4461
9629
6910
4506
3243
6546
7888
8756
6499
6745
9283
5808
6691
314
8707
3913
7369
5842
9240
8976
5118
6101
2457
8690
4129
9009
6583
3147
9184
2299
2073
6407
5287
5253
4780
1625
873
5649
6478
3392
460
7393
5330
8457
449
2836
1018
2177
9049
8139
3157
7461
2828
3974
929
1510
2228
2407
9290
7339
7049
5795
8177
9247
9975
604
1791
6847
2111
517
4122
6145
8719
9818
6603
8913
4901
5041
5347
5039
5618
8850
4978
3213
2588
7579
6166
3952
5865
5100
8504
8880
7392
1882
1988
5642
8328
3141
534
5717
8210
5659
9748
8635
5607
9994
8237
3779
2479
2624
4723
1142
3598
654
7679
4319
471
613
6942
7405
9846
5087
9156
3163
4875
2409
8158
1237
9831
5025
9977
5688
2
5671
7752
3212
2853
7812
3741
8657
1317
3688
8907
4343
3059
1361
7955
4742
894
5832
7896
9829
8203
7824
5904
3487
4769
476
5930
9015
5265
3269
7436
8192
6035
4033
1904
6838
1102
128
5008
3701
432
4493
3692
3736
5470
7163
8243
5582
7680
3816
6686
9620
7838
3713
4405
4578
2471
2781
3068
9250
5493
8206
4338
3533
5809
8170
1974
8349
199
6148
4859
5350
309
8653
6904
2792
7952
9178
4120
9820
2064
709
552
1154
465
7774
5635
7685
9129
1652
118
3830
6220
384
9544
206
7050
9197
9364
1679
1532
2235
6840
8066
799
5004
7695
629
5978
7581
5298
4384
3602
6359
4498
1942
4252
8391
9426
9794
8892
1901
6423
2278
1378
879
5987
3195
7425
8389
9903
1823
687
8124
5328
5015
46
2804
6461
926
6476
537
6419
9505
1253
6996
6334
1642
7796
646
4212
7548
2413
6690
5756
6782
7174
6679
6725
2412
3918
1783
3302
6061
9281
4371
8443
159
2160
7232
9295
4136
2894
7361
4052
2890
1520
2087
6126
5565
7591
896
6808
1696
91
4862
6949
3923
6698
1820
4994
9564
2818
3513
5414
8758
4229
5861
7472
5131
3005
775
7458
7909
4736
7508
7362
8341
2147
9816
2175
6990
171
6842
2712
1293
3873
3990
9082
5620
8000
6881
127
4385
9134
3241
4125
2102
4855
6494
5144
2141
1304
7554
9163
2377
9787
783
5245
9235
5349
1844
2446
474
6323
9512
6380
8308
4482
8559
1140
4110
1996
1266
9403
4569
2744
4248
361
394
9547
1448
9841
7797
810
5569
6774
2486
5169
6312
6411
6504
370
2900
9384
5875
9312
7748
2259
2502
7540
1962
8419
4096
2811
1548
8294
2570
9860
6660
4499
7273
6014
4756
9605
4681
5690
9743
5679
3030
9679
8290
4592
1258
3620
8387
5586
1391
4566
9747
4717
1845
2500
3423
1794
4964
5064
6714
5706
5589
7069
6421
4398
8765
5879
353
9060
7624
3101
3672
4169
2895
8137
6092
2952
8618
214
375
4801
9377
8974
7103
1766
2050
6968
2211
5668
5929
9737
6399
6445
6237
9950
1125
9408
4245
1933
1997
3066
6642
4099
4145
594
4644
2769
1840
4686
3506
6536
6106
9093
2298
5789
7982
7995
6424
1698
2199
4949
6894
415
7815
7328
153
5127
3462
4667
2258
7340
2473
176
3216
4939
5369
2940
4691
2764
2018
3474
3748
9734
7243
8782
9199
1096
7429
4054
7575
3193
1740
5924
7974
8086
5477
8885
8404
7843
7471
3167
7740
1046
167
5342
9778
8634
5947
1297
8307
4734
6139
5933
8029
121
1412
3564
3445
7148
9681
1130
5532
8512
3466
5848
9310
1134
3406
8789
9382
9598
4648
63
6352
8173
5368
8917
3160
6233
2897
2643
1768
2844
3965
7491
9688
3355
9854
7000
6072
262
8071
7039
3482
3519
4399
399
238
6973
4162
3463
4087
8962
9447
3150
2964
4822
1133
252
6253
8585
5979
6077
3431
3074
4381
9314
1757
5912
7256
8463
6387
3600
8041
6797
1005
6349
3536
1120
2362
800
8761
9881
6688
2348
1111
838
8007
3260
9081
7829
746
4361
6456
2973
8172
870
3853
8497
9892
55
6464
3760
3894
3248
8874
7539
1353
4146
8498
487
2628
5293
7338
9099
7073
6558
274
2162
5640
3164
3031
6251
3752
8615
4532
1190
4106
1367
2816
5383
5243
3172
3770
9859
6859
1893
6773
1139
4971
4762
3103
7457
2419
9164
6549
7307
3204
9323
5374
5883
6692
9313
1430
1038
7557
6801
4700
651
9864
9936
7780
972
5846
7567
3416
9472
4982
7929
3281
1736
8975
3978
3081
4423
1424
5843
7139
1064
1663
7642
7446
392
1690
4581
6685
6707
3194
6277
8523
815
2247
4791
5466
4633
9452
9287
4457
5495
3837
1940
5139
9795
9442
9715
8851
2825
8327
3337
8665
119
3535
4416
9039
132
2463
4084
6351
9448
3783
6561
4812
7187
1028
6503
727
2961
5424
107
7104
1176
5019
2454
1928
3080
5727
7156
7157
1842
8704
3026
6562
51
8716
7692
2855
8774
409
2163
9303
1278
212
9269
6309
2253
4852
7301
5633
730
1479
129
6721
315
8439
8695
7364
9138
1805
3275
8441
4267
9609
2462
9729
4298
6118
1802
8636
4357
9789
2150
5641
4641
2043
5233
3404
4881
2324
9286
7728
5952
7114
5126
766
2233
2722
7527
6444
7649
6212
4083
8228
4997
8485
54
9722
2948
4549
7729
6902
9876
3326
2265
6635
6970
2003
5768
4796
1722
6792
8949
3662
9059
1767
2340
2180
1986
6981
9685
536
3639
7783
3386
5858
7082
6793
1245
3351
2263
7889
5217
5697
8382
302
5208
7598
3143
8647
1638
4143
6817
2112
4757
9634
7697
8535
3223
7179
949
3502
7410
4352
9097
8748
8678
826
2958
2917
7355
2639
2537
407
8565
8480
9691
8413
2185
7782
5651
5321
3814
6580
8121
6120
150
3931
390
2953
9835
8764
9075
122
5375
3331
2644
2938
3364
8659
5106
3041
7732
9768
628
8442
2400
6079
3072
9351
4478
700
4382
3239
7102
8910
287
5591
6045
6514
62
9420
7744
561
9380
579
6150
2841
4758
7048
1381
9334
4638
9617
4495
8037
2645
1235
8367
7953
4039
8251
825
6810
6367
4943
3272
7882
7315
3262
7469
8433
7587
1489
4015
485
1631
3276
5148
3201
7584
426
5059
7356
354
4115
1340
7803
8640
9229
1706
217
5005
1490
215
48
8967
2337
1527
1511
7270
9847
2459
7029
1456
7370
4009
1135
703
5303
3403
8921
1888
4650
7431
3109
2513
6186
789
7836
9537
7722
8924
4235
1765
168
3511
822
6136
9026
6422
5393
147
1747
4786
3015
9695
9500
3168
9518
7536
7497
8126
4487
3428
5037
5353
1397
4753
2867
1712
2526
294
7246
1784
5043
4074
3678
2442
6467
8842
8313
4155
8952
772
6645
1541
8282
8036
3689
3870
3006
1959
2252
8377
5065
4840
1033
7335
1043
4134
1605
8854
6569
8399
3654
3917
2151
754
7779
9410
5138
8714
6588
573
3395
5066
8568
2145
5503
7911
1150
3695
9649
9650
6222
8556
2749
3231
4479
3349
3538
2989
6158
2336
8663
8331
3980
2930
656
5821
3255
3534
4389
358
9370
3696
9987
339
1861
3644
1688
5099
5943
5255
3939
7545
1779
2040
9458
5480
2373
6465
7302
4283
995
7278
6355
5381
6769
2215
790
5145
2331
2146
9105
7241
4658
2380
3652
2672
7993
3993
9085
8693
6937
2967
8806
969
3888
4325
5097
5413
3169
9102
3821
4380
4290
9786
1944
542
7977
5232
9998
1798
8717
9233
9142
2065
4035
6313
9386
5163
1105
8728
9763
6853
8395
7109
3517
3631
1899
4572
6357
1347
4042
9244
362
3819
5459
1473
9211
1874
7962
5824
1195
4631
6771
1137
6928
456
7899
1797
7231
1230
7253
4627
9565
9647
336
8147
3675
6959
5788
4481
3549
9953
6761
1634
4857
8943
9173
3514
2974
3524
15
3094
2467
1006
9852
3755
7983
9669
4607
8862
3156
9086
2507
5474
803
5332
7374
2912
6723
4274
4468
8798
8972
2481
9013
8614
2776
832
6924
2485
756
3097
2682
7116
675
272
560
1170
2339
2496
7021
5331
7178
433
1600
7207
2206
3274
8358
4394
454
9491
9120
6734
3415
4750
5433
6916
2266
3765
2659
1550
1292
4804
9219
6987
9309
1256
1537
9208
4490
8256
6861
7452
7739
9989
5841
1344
3606
4358
3478
9362
2314
2115
7705
5703
3069
2916
3703
3233
1364
5656
1574
1305
4533
5323
2091
4213
3433
6665
956
53
2271
8814
5515
4250
6656
3004
5366
8971
8896
2805
7066
6131
6896
2039
7699
507
4551
3796
4117
2910
5128
1315
6972
3609
2983
1868
4683
4628
4540
6215
3455
6075
8933
7254
6286
4777
9758
7885
2719
1385
3901
7529
9761
3800
5682
3354
6163
8200
7531
9220
6375
6006
9730
2827
8397
5075
2282
2352
2399
1945
8219
6297
9959
9675
9899
3872
4807
5577
3587
5698
4586
5092
1226
330
9740
6078
855
6344
1390
2099
3136
2106
8839
4370
3183
9912
8604
7640
7248
5561
3960
897
4449
9404
2138
4591
3643
1556
3884
3191
1785
3188
4837
7003
5540
6080
7766
2782
9927
7129
1595
8619
1346
7387
1334
4771
7484
1943
5536
1342
3217
5230
8667
5951
4672
7045
1675
6463
7382
8022
7564
7986
9652
7965
7240
9194
3240
9772
1654
8291
576
6650
9118
4081
6234
134
5376
6011
6371
9515
3372
9455
3321
6956
6365
6390
4738
2300
3835
6256
1177
6891
8652
2307
261
9186
8196
4873
7217
6638
8731
1389
8938
3430
8430
7312
1082
3633
816
3636
5694
578
1234
8639
5135
9307
5750
2236
6678
7147
609
9839
2771
577
814
9779
16
8889
6841
2597
5028
1287
2980
9113
712
5526
4880
9285
4180
7832
874
7443
1543
7288
4024
7690
559
9339
4829
6611
8621
374
2861
4961
9924
9568
3117
8980
1355
7507
60
2951
6022
5827
1855
2329
6493
8529
6282
6864
7893
9931
29
9055
4322
5837
7588
3107
7216
6029
2191
2532
3518
1118
8284
5132
942
9457
8645
4985
1476
7463
5034
7707
2132
8249
4712
9320
1425
6361
6743
2044
500
2319
1231
4247
1989
9204
7123
5278
899
8668
468
978
635
8946
9962
6172
3826
4660
511
8464
7658
7606
8090
658
8533
3954
7617
835
3550
8274
8044
1772
7608
1478
9717
3387
8123
664
4652
4392
7760
462
8572
8834
3885
7432
5220
7265
3056
2334
7318
7502
289
8817
3516
5312
4057
6548
7214
6341
1563
3252
5955
3749
8118
35
9324
3766
6775
6584
8751
4518
2251
5880
7181
9345
7225
9877
3938
755
2615
8337
9096
8632
1192
3105
9502
8767
6024
44
101
742
5958
151
734
8143
3384
5720
7626
2036
1910
8461
4514
1183
7496
9276
5899
8053
4376
1956
1172
3622
2439
4525
2190
9236
8752
8708
7743
8977
7892
4308
2848
260
970
3915
6983
3439
3829
5093
9870
360
6874
6339
9824
1392
7477
9098
8541
570
5509
5867
9275
8336
2840
483
7541
7314
8197
488
9828
3298
7576
900
1701
7269
6974
1336
3444
9613
5732
7166
3987
3512
1469
1552
4673
3684
6130
8214
8010
7562
318
1559
7768
5588
3906
4150
2904
4189
6083
2944
6447
2665
6273
5881
1181
1214
4368
4715
7876
9255
1857
2984
8369
5992
3825
6364
8898
7466
5367
7693
2540
3454
1760
9838
4307
440
3496
7399
7710
2468
7946
558
3531
7365
2791
7226
1782
86
5777
2864
7084
5407
1526
4421
9205
79
9983
2946
9900
1705
5728
9970
5380
8080
4678
4816
2237
9698
9274
1788
3784
8856
5954
6929
1032
7188
1191
9459
4504
9597
1394
3807
4914
9057
4967
968
5977
259
9477
5080
7326
8685
6559
1310
5939
3377
8301
5889
685
9792
9974
3768
5389
693
2747
1410
8458
4333
5623
2465
5945
9865
4887
7959
6345
2389
7932
5543
6216
2884
7308
583
7271
7511
8725
4747
3375
2557
1814
7454
4966
5428
4393
5653
5261
457
6759
4265
2633
1207
2605
8215
7118
4297
5922
7751
6239
6628
8593
1210
8919
2742
4511
6261
6429
5579
4409
6865
9381
5622
2985
7092
3501
6860
8202
6895
4682
1322
6192
1211
9680
7547
3322
9916
5755
785
7008
2779
1938
3510
1467
5506
5314
6025
3146
9161
9764
2585
8830
3148
5667
5800
6750
5031
9863
1608
2017
5260
2632
3124
2563
7852
6291
2860
228
4379
2289
1582
8954
8809
8521
9308
2033
1147
7641
5677
9603
8875
8592
5596
7043
3721
2635
1759
8392
7283
4827
9225
2987
842
9122
2342
244
5371
4424
3723
9177
9840
2746
3396
2080
5786
916
7839
2640
9797
4342
1037
1681
5003
2714
4953
7009
7190
1166
1482
9451
6938
2478
3556
6125
9760
6511
1405
204
8366
3626
4474
5909
2497
5364
4410
4027
3554
4854
1777
5775
4842
4554
3577
3207
4436
3203
4792
9830
2629
6763
8176
6119
5282
7063
82
4435
418
6768
5559
7397
395
1746
7154
2591
7853
9501
7960
4433
2234
8998
852
3601
6378
6458
5193
1052
8784
5571
494
4350
8164
2550
3943
1720
1360
946
2685
8718
2573
8989
7389
3737
2193
2611
1496
5799
798
6067
4365
4830
1223
6042
7230
12
1160
8149
3102
218
3711
3190
7943
5747
3722
1413
3647
3149
3983
5272
2796
6384
2255
1622
9506
3597
5855
8753
7282
1369
6053
4701
8772
6402
9018
6880
4505
263
3712
6805
5286
4259
7020
6003
2823
5630
8569
2214
4590
7514
3381
1695
7358
4112
5055
8492
7951
7895
6828
2335
2638
2548
1610
849
1969
3691
8841
9390
6435
2512
4218
2438
3859
846
7719
4282
724
1159
1651
7400
6609
4355
1441
4226
5836
6108
9371
258
2119
4945
2153
8162
996
7753
4563
3378
2608
4377
1285
9922
2799
1905
9750
7926
7072
1004
2429
2311
3950
7526
5467
9707
1547
8560
9843
6936
999
1091
4980
4463
8281
3075
142
9781
4480
9986
2726
6826
7863
1407
3753
6571
5996
1247
4508
8564
7855
3907
2705
5026
9692
8329
1963
1828
2515
9144
4876
988
2854
2646
2156
6897
5913
9305
6290
286
4092
7849
9762
8073
3542
1012
9523
9168
823
9376
4291
8408
4749
9600
5972
2005
7505
106
52
84
6373
3813
7966
3635
9489
7773
3848
324
1505
4773
3593
7833
4916
6090
2757
148
4853
4727
7255
1819
7683
3218
9374
1858
9264
6980
7805
4017
2196
1957
545
9765
4359
4373
7171
7927
6803
7093
1289
9368
6917
2246
2114
7614
3408
6427
1727
1786
4833
5248
2010
343
9913
2567
5892
6567
9131
4546
3540
7516
3092
9010
57
2023
3769
5254
2686
2061
7879
7976
3440
992
9363
5961
7565
1335
2165
2053
8737
1357
794
3720
4841
2564
6523
8394
9260
1753
4739
5069
7582
1852
4138
8333
1936
5384
5226
5566
1119
9094
2762
1834
7465
886
2925
5443
5674
9626
2765
3751
7610
6360
310
761
8692
65
5317
9411
9325
8939
1847
2449
3429
6629
3438
3615
8833
2085
4330
5038
9474
708
9686
4310
8013
1458
3646
4562
7535
5550
9826
164
9757
982
2748
9230
9590
7878
8407
8453
4178
6496
9889
7957
6639
719
5522
3977
7470
6043
4908
8468
3400
276
6786
817
3245
2060
2351
9753
2510
2001
2161
3555
7078
3476
8097
8088
5170
7300
5950
1327
771
5891
6303
115
8891
5422
248
9528
1838
9915
9357
4621
7218
5434
7036
6446
3618
6703
9823
5435
256
3108
4599
9306
4743
2292
647
178
1718
3051
3257
3660
9383
9567
7939
5497
3468
4975
8966
2487
5551
3025
2625
2444
2843
2071
5040
467
5362
4085
6122
901
4369
1907
4886
7894
4520
8903
596
7143
2666
9719
7860
1684
1913
4430
5811
2187
6477
9187
2835
670
3134
7041
6392
8459
8265
7158
9414
9460
5519
9755
1507
5020
522
6518
3865
1217
1774
9423
5504
723
9006
2892
1045
9635
8410
9011
4781
5982
5528
9023
8297
8815
8343
6532
5885
4293
6890
1900
1416
9804
8049
9956
6369
875
1867
241
5205
5976
1817
3548
8326
8660
984
8519
9419
7200
2241
8189
4019
8986
7629
9417
6791
2830
4903
408
4594
6116
5555
4671
8112
4944
821
20
5918
630
6332
5410
7935
8749
7450
8289
5822
3086
8426
7144
3209
807
7908
2582
6764
8054
3380
3087
8994
5487
8478
1238
4236
224
5856
1773
2695
6830
5505
8253
4608
1982
895
1366
2466
7086
249
8786
9700
1372
1225
4824
827
6121
2084
701
9077
4127
2472
7297
6550
6862
589
6330
3930
162
4761
2975
4038
5754
8325
9851
7064
4349
5344
4147
8113
5847
2281
4018
3667
3034
3181
8909
5853
7258
6960
4193
4207
5851
5113
194
7426
6316
9570
8471
8683
7661
5130
7928
8510
6921
1423
2154
4725
2052
9218
5944
8697
3131
2198
5348
7787
5120
6284
2092
8824
5259
3457
690
8973
5200
7767
3399
7761
9396
7992
3226
1630
4069
9689
6695
3582
1909
2654
2986
7619
9429
1263
6112
2223
3916
9624
6324
8309
3499
9338
9402
3362
4932
9668
9699
4720
6450
5552
8131
6270
27
9251
4655
4728
9227
641
4082
9676
9702
8799
6194
2699
2743
9473
5539
382
4414
2647
4344
6785
5966
2301
6430
605
3393
355
8347
6969
2076
7924
7902
7634
445
2120
8378
1379
3032
4596
9558
5448
6899
3988
3162
637
36
2534
2318
4044
6544
5546
1463
1833
4059
3323
495
1800
6669
9991
9710
6886
7445
7816
9242
4990
5382
3777
4003
5009
8152
5021
8606
1271
9169
484
316
981
5482
3130
3287
2873
3388
8575
4955
4556
9206
9112
8233
4190
5826
1352
9849
4794
1934
3084
657
5629
6289
7373
8788
6252
3624
3924
1525
9534
8120
5378
2655
7501
1713
2617
3590
512
8591
6772
4271
170
6524
4000
2679
1801
1965
6281
957
1059
1633
3166
3878
3125
8081
4255
2934
2950
7623
6746
3546
5411
5896
2680
9623
7371
9171
3319
2677
4817
7638
7495
2770
3573
9133
5416
6386
8240
1008
6867
2474
6004
2432
8279
2280
4260
9693
2577
4142
8207
9271
7402
2484
3529
961
1272
6191
7530
141
4174
6094
1345
1459
5117
7585
9051
2505
9845
7223
4634
9149
1883
6315
9326
3120
6631
5370
1880
231
7967
5048
7033
6789
7053
5806
3077
3247
5274
6871
6730
7804
1877
1968
6048
8076
2103
2135
1093
7135
5246
5444
9868
8955
644
4456
5056
4041
4049
7828
1729
2212
8649
8100
8518
866
4395
2852
9546
3126
722
5753
5676
3836
8968
6301
9651
8979
9671
4202
3653
2184
3017
1742
7480
2620
2291
3278
1501
5796
5438
7949
3219
3896
7672
3480
8516
4922
3497
9513
839
4215
3348
1553
9642
7133
4630
7306
9253
7563
7032
7040
1307
264
4808
1323
4151
9561
3673
5449
2851
9216
8754
9435
5469
607
116
9694
3040
6741
5308
1930
5192
3251
7272
7257
7247
4181
3210
3196
5934
2489
7802
3283
4910
7018
2264
9746
7973
9593
1044
8781
6717
7250
4140
2356
7274
4666
6854
9030
213
8813
3447
888
3580
5984
6846
5957
2277
3758
6474
9580
5213
5628
6850
9627
8418
5869
4440
5464
5164
6156
6538
4447
6020
2009
1000
1726
9550
4273
3902
1941
7385
5239
7702
3350
4670
2530
7559
6813
7438
6804
5162
9514
6064
1504
2631
7635
8488
1657
8159
4100
4491
824
9136
6227
1616
9041
4412
1906
1203
9350
6731
9176
7142
4933
6133
3637
8201
1554
1737
5072
8361
4884
508
5893
3246
419
5478
3363
2128
3792
2955
5417
679
4075
6434
5000
4708
638
165
2261
8091
9311
2285
9475
1818
5672
1035
2204
2304
5291
5737
8018
2903
1471
8161
8040
6582
4893
7052
7901
8276
4164
7205
7726
5818
745
5324
6283
3104
5983
2929
9884
9951
5395
8508
8590
4575
5654
5341
4296
6097
6114
4183
3359
2727
7264
5762
112
3547
4763
2857
9349
1626
7203
6032
6976
8190
3657
2918
4745
1843
3358
1491
4614
6552
6547
1947
2862
3491
3122
2754
1443
9569
1359
6307
9721
9638
9378
9279
9019
6553
3926
7294
5525
4438
1540
4552
6901
4427
6502
1508
7593
8193
2107
7586
4124
5228
1189
1435
4472
4598
5396
9462
4844
1013
8087
6454
4485
9399
5115
2752
5757
4722
1714
4326
5926
5063
3312
429
6735
5095
8637
6036
5831
6715
6001
7583
8220
6849
9728
3417
3311
7430
7120
2909
4703
8043
5670
3419
3317
6337
9056
7024
782
8011
8658
2865
5699
9103
569
9366
416
6383
6557
4475
56
3489
6625
7199
898
5594
348
9265
2693
322
7292
3734
2391
9356
8996
9932
591
1023
9212
317
6329
6673
5161
3127
9063
2514
6931
2637
9143
5549
6356
9773
2932
8855
2778
1866
6295
3574
3206
7671
7145
582
5013
8502
713
295
1758
1583
6991
4613
7213
6404
7961
4238
6884
8643
205
8522
2943
8046
49
2024
3719
8836
6820
7558
2683
6218
327
8755
6209
6965
8208
5741
9770
2997
6343
858
4765
5948
618
2941
3469
6169
1228
3070
9608
9221
8853
7654
5167
5361
9147
9822
1481
706
6117
1162
7448
1923
8109
5157
7834
4408
2774
9014
8306
7566
4105
6328
8323
6398
8115
2572
3787
3975
8706
3294
4523
8823
8
30
7636
5716
1687
7219
2600
6437
8990
5385
2931
6787
3707
3305
8130
3912
7437
4321
1396
5988
6472
3014
4194
2242
1519
2035
9104
8168
3471
8191
7409
7196
9560
2077
2885
3731
3855
6406
860
4489
2630
1239
1145
5527
6711
93
2390
4931
7963
3270
6744
4078
8141
9065
9341
6190
490
3409
3152
6506
4469
6966
4001
8058
5124
1807
4388
7568
6572
233
3812
1098
1637
166
6997
6779
2968
9074
9432
5299
7552
3184
4249
8929
2313
3780
867
7880
5534
6802
8573
1895
740
5174
9318
8258
7971
5404
6151
3111
7434
4798
8067
6054
7916
8051
143
2798
3827
9332
6129
1060
2971
6018
2787
7127
5283
2538
7027
3586
4907
4602
7346
7427
9885
3681
7631
3822
676
4642
9640
3571
421
6728
6541
681
2144
5171
9517
662
1301
3078
3515
4437
1529
4664
8771
6540
2188
935
8070
6920
466
2461
74
6276
753
8916
7874
2130
9024
4303
3808
9387
8277
5770
2129
1981
5011
3045
876
2689
7162
1647
2766
4113
2501
5823
1613
504
9110
3875
9000
406
5580
8993
3962
4814
2834
793
801
2728
6441
2495
7347
4309
769
9718
758
6954
1939
4104
752
4930
950
6070
28
5485
7220
2732
1836
5498
9372
928
6287
7988
187
683
8957
8477
668
1421
475
695
729
1669
8699
6800
6670
3658
1571
6824
6740
7985
3091
6701
4588
6617
4131
5046
2382
5834
8216
6702
7284
5363
9639
4013
1635
7249
1831
5798
4754
711
4426
4802
242
3747
3628
6137
2276
3795
8677
8995
520
5604
6565
4317
4043
2531
7859
2706
6641
4889
923
3904
2011
1085
3782
2387
792
1624
6263
3230
3076
5643
7549
533
6788
8472
9416
8254
781
8263
6347
114
6403
188
909
5457
5231
2239
655
6809
1549
5415
9083
3797
633
9342
8876
4653
3484
369
2947
6452
1743
6958
6200
692
85
5296
922
7122
2268
8039
1611
763
5426
5502
9594
8211
7336
3898
2075
73
6338
2882
7169
346
1319
6331
7771
2543
6978
9155
1546
1031
4651
2681
3971
8184
4737
4133
741
5153
4647
7342
4345
5463
4058
1021
7655
4391
6412
1570
7556
6905
7835
7417
43
4090
8563
6827
9464
7668
6667
941
1822
8793
6153
2030
6224
1168
3621
6794
9422
7062
7390
9933
4403
2874
9759
8897
2157
8826
9774
8906
6708
8420
1233
9973
5191
1227
2571
2723
2546
9071
7883
8221
8494
7140
3373
8984
4617
8342
8792
4710
6425
4419
9267
5476
3405
2016
9678
9739
8762
6622
3450
6655
8283
6164
193
2982
8715
7221
4066
7259
2503
5895
3717
6672
1440
366
3037
6766
9139
247
5971
427
1136
6515
2773
2079
2002
8027
1985
7492
5358
4991
6196
6481
2347
549
3710
8487
3316
5326
3422
6727
8890
181
1400
5545
7380
3367
3569
1282
1755
991
9918
1776
3539
8802
9272
1186
5634
1115
9090
3785
4527
7867
1169
6885
5044
6574
6040
4337
8482
9966
1830
6495
7357
7733
9960
7675
7345
4156
6260
4040
2652
5897
8370
3603
7012
2579
100
2254
553
1871
321
2100
1254
3984
9636
621
528
9582
5601
3798
9192
2168
6174
1403
3686
7904
643
9037
7525
4942
918
2460
8927
2042
4835
2458
3021
7670
6718
2690
5029
1912
7708
4413
2755
8940
4417
2604
6906
5715
5249
1523
2312
2758
5797
7418
905
7348
6007
1241
2785
3750
5002
7177
6249
1721
1728
3155
7110
3493
9937
5617
8246
2137
4329
891
1465
7195
7022
990
9543
1122
4351
9162
149
1128
7298
2601
1123
450
102
9128
1829
9938
7862
3267
4227
4748
5932
5854
7197
9967
7846
7343
5310
4517
6963
9292
8527
7415
250
8302
9742
1612
1212
7237
2730
2718
6765
6957
5965
6182
1303
1924
4301
2520
9333
9141
3200
2813
4879
8140
1280
4981
7403
6483
183
7542
6002
3778
6747
6019
190
89
5079
7170
640
2837
7555
8285
538
3320
2124
5271
2509
804
5068
6226
5133
9373
4240
666
5631
251
3301
6753
4568
5576
6815
397
2308
3064
424
6010
8838
9858
1042
3623
6381
6573
6501
3099
2554
6178
8775
5600
6545
98
2148
4905
9796
4452
2176
2105
3726
461
2194
9375
4656
5866
6231
3759
7455
4502
6955
8416
6081
2142
2031
1673
8272
8723
4045
8379
4810
3645
6843
6671
587
311
7734
6438
3911
3264
5152
6414
9053
7569
7261
2032
7968
5969
9183
1057
1422
9301
9812
8571
9288
5318
8654
123
4152
4657
367
2962
889
6934
8688
5621
7979
7290
9232
1029
5052
5116
3114
2858
1083
3291
5994
1114
4752
9888
7026
1188
6104
4702
1480
8506
6525
5146
40
9012
4020
9607
6736
3238
4470
5693
6507
2371
6527
2703
8454
4957
4492
9645
1472
4214
1586
391
7646
2739
7363
7334
308
2406
8603
1700
2990
4839
5033
3414
2871
2939
8816
1810
2808
671
5266
2476
4979
4315
5606
590
8739
5980
2316
8931
9487
7989
3284
1994
1703
9108
4047
1015
9499
3504
1474
7925
9116
472
2881
3543
4845
7891
6992
4878
9158
5102
9289
3892
556
7674
7222
8292
7886
9123
5340
9871
4222
8273
4036
3595
7694
7737
9964
9089
5572
985
7691
7494
1719
2593
1427
1184
5981
7038
8035
8414
7831
7422
2715
7798
2456
4048
7005
3929
211
4778
7153
6737
8105
1702
401
6716
5626
4819
694
5746
6180
6908
6051
422
7462
9810
8052
8515
7085
4787
8544
6325
7305
7844
1709
7747
9145
2284
7341
1770
8642
8864
4987
5740
5240
3738
245
5758
2004
3053
5513
3178
7499
8449
3365
3467
3434
7042
351
6696
9137
714
4242
869
6606
5185
8583
2089
3969
8746
1077
6058
6534
3576
9583
3361
8545
6250
9957
5215
8825
931
4061
5704
5689
4173
8250
7108
6469
1869
1960
3928
7354
5535
6490
297
3263
7395
4882
1853
4885
3702
1249
7498
8194
398
8142
8423
7628
7252
9441
3991
7510
2584
1795
9545
8083
3234
9022
3842
3839
5335
5975
3996
78
9520
6575
5803
6185
8881
614
8773
9945
5419
6754
531
130
2417
8227
5365
1174
733
8348
2315
9450
684
5112
8406
4536
7709
3508
1348
1368
6953
1903
8310
9776
4221
3265
7413
1311
8884
8843
1656
8293
8085
428
7287
3299
845
3028
2596
9941
6845
5024
133
3427
8812
2469
3110
7746
7964
5507
7228
9711
6335
5490
5427
4951
9202
4089
7684
7725
3922
21
3942
9007
9391
2673
535
1614
1557
2046
8234
6418
6877
1976
1034
2838
4375
8726
5175
8069
3578
5840
7070
9588
8686
5940
3394
1022
4272
4567
269
6401
9677
9449
5520
5857
3607
1745
7236
5781
811
6201
7523
4989
4091
9856
4973
3876
725
780
8002
1393
2267
2915
5468
1970
6783
947
3592
2288
3036
3100
9806
8627
7600
7524
383
8766
8763
4848
4923
4915
4327
6255
4974
1187
3776
8554
7500
8364
6594
2516
6776
5388
6410
2595
7182
1452
1850
4311
3135
9478
1954
7239
8096
4766
707
9880
1607
4553
6076
282
9002
7633
4318
6229
661
9848
1404
1204
2445
5736
3851
7837
1264
1544
1377
3804
3047
4962
2475
2131
8871
1980
4111
7172
3442
184
230
2183
307
9705
7291
5165
9720
9084
7808
2323
8099
8108
6509
6268
747
7538
3714
7765
9949
6570
9062
6722
2297
6529
2048
3745
9908
2963
642
584
222
715
9331
8116
9563
1683
8886
4199
3964
7001
7630
9394
9784
1373
7311
6946
5967
5450
1739
6400
4772
5937
6930
1108
1027
5006
298
8489
779
7485
9249
9248
4139
7054
8675
6600
219
5256
8807
3205
5082
2800
6798
8724
5270
7571
145
503
8727
3879
4372
5790
8644
4477
7877
2607
9008
277
6203
4088
1011
4466
4662
5225
6726
648
2789
9493
4022
3732
735
5325
6876
5804
3724
5644
9124
5309
7700
4936
3656
3956
2702
8261
1885
1711
3211
8992
5787
8791
1194
6799
2317
8505
6066
3483
1065
5794
4850
8557
9716
1165
4182
2648
3060
4161
7621
3665
6293
1206
3925
7331
8185
6491
7359
3186
7673
3488
7089
174
9548
6388
9592
8710
5073
7948
6620
1444
9622
1117
3551
5269
7677
2942
4442
9895
2756
8914
385
163
3845
4233
2555
1415
7716
9525
6585
5156
5742
9637
1341
8888
4818
3352
1099
4559
4941
5302
4299
4861
8236
4946
1261
7504
4224
674
1837
4612
9965
6682
8666
3968
5974
8198
8822
4439
603
7160
7441
632
109
1398
705
1750
3385
2171
6088
138
7975
2801
1862
331
8103
3881
4663
7014
2393
6977
493
4362
7106
8229
547
6280
2907
8440
6217
3261
930
2535
3868
4809
3058
2759
8144
5333
1860
5320
7823
1492
8930
9486
6790
2056
7907
4534
6134
3694
2594
9653
8157
3640
5614
2741
7151
4170
9078
9939
6246
2896
6254
8163
9587
2202
2490
2051
3310
8831
1300
3718
9672
6485
9492
6278
6086
8271
8948
3557
6505
7333
7386
5508
2420
5782
1173
806
4246
4892
6376
8602
1964
3575
728
2920
8023
3128
1221
7912
2684
1594
862
1602
6646
9439
8212
1242
4200
8577
3756
4661
3951
2991
6863
6379
2668
2353
9661
7011
513
9749
7851
7046
4646
5907
5530
4063
8552
9802
4347
347
2354
4109
2123
2977
4294
4026
8042
3823
126
9490
3857
4324
4564
42
1539
5587
4258
70
4016
9714
1244
865
1040
6962
8738
9418
8801
2422
9398
1528
4126
5142
4010
6173
9995
5047
5557
6749
911
1604
4803
4451
1265
6188
973
4897
1493
3050
1618
189
1865
5581
6837
738
3727
7080
2545
6319
9809
3334
8386
9976
8894
3237
9195
4486
7890
890
3266
423
3330
4937
7994
3046
1918
2410
1876
5537
5322
5017
9174
9968
7245
4051
6599
8641
7718
243
5258
5203
1438
8127
1887
8846
8186
7244
4494
6038
1056
7276
7727
9791
3666
5523
9072
6177
8412
1778
9920
4977
9943
7350
2767
659
7521
751
6436
2015
5460
9241
2270
6657
2842
4422
1748
80
2108
967
3704
9641
5078
2209
805
4484
4094
288
6267
4959
157
1218
7840
4783
4867
5925
110
3581
4593
4220
8701
4068
45
69
5637
6535
4425
7745
2059
6300
7609
2350
6564
2954
67
1966
2049
2394
4709
2960
9979
464
9068
8963
4166
1686
5516
5307
5051
1598
7861
7644
5198
4522
1179
8340
3082
8700
3793
1513
8445
2956
3061
853
6336
6755
4268
4940
8698
9
2810
4300
5615
7051
1878
4121
8713
1281
8911
5186
1659
6662
8547
8102
786
750
945
5772
2928
5077
4012
1202
3138
6627
7515
1590
4148
3838
4114
2027
2527
5608
856
8060
3368
4770
325
8549
2360
3116
1257
5452
4269
1251
7884
9882
271
1898
3309
4211
6994
4531
1428
1849
1402
1809
4080
9606
8028
208
2155
6457
8332
99
6914
9883
8303
4558
6633
6023
5472
7267
8664
8610
4605
1121
4243
492
5793
3398
8861
220
7367
1464
6416
4541
9508
7981
2542
6274
2368
9485
8947
9536
9343
6245
6816
8019
8298
359
9682
1922
3062
8165
6259
32
5844
3676
3297
2269
9270
1220
8595
2058
7758
9646
6202
2523
7388
7755
5813
3235
2365
7475
1789
5632
8922
344
1370
9433
8320
2936
4453
6751
2218
3343
342
6271
1872
7703
940
7416
8171
9454
2477
4565
37
8539
4407
3588
266
3744
1240
7762
2240
1530
5104
5315
279
3494
1948
7775
6870
4336
1274
760
5430
4768
7731
4557
7483
3824
6275
4230
8479
1708
7424
6705
9032
4587
4996
9297
7285
6320
2401
8245
268
6952
7185
4281
4067
9029
5655
8148
9043
7759
9095
6470
9401
8803
3809
9036
8330
9766
6964
880
9665
9154
6612
9038
3089
4963
9549
3761
6598
872
6739
3490
6713
9887
2309
3920
7211
9061
1290
2691
3944
5560
8351
3994
8038
3687
3106
2020
8944
2041
6243
24
4995
5921
9470
9771
1762
8942
8095
7067
2014
381
2891
4014
1694
2094
9388
3961
452
6922
7825
3877
4785
3697
6596
6318
7279
3085
320
3661
5181
5739
6950
7115
255
9687
9643
6395
5394
5639
5564
1446
4179
3966
7724
7055
7031
7941
4264
8796
7784
8915
1804
8648
2167
4401
6984
4912
2560
1835
7537
5218
5058
9704
3256
97
5664
7990
8970
3985
5223
4192
438
3259
7330
9239
8493
9783
2174
8599
1260
105
2876
689
1445
4025
6814
3048
5273
1990
5680
1333
7818
5646
6073
6581
3329
9929
9539
4731
4823
5845
2448
4237
2522
4950
9984
5262
8411
5125
8133
1295
5884
389
7056
6468
634
3286
4718
2887
2090
831
1587
2819
7460
3992
6167
1437
1995
5673
6210
3370
3142
2197
1677
2574
612
910
414
4874
8405
6127
9572
7167
3677
4698
4316
3254
9524
1455
8005
7360
7978
9741
7088
6096
4458
2927
3079
4858
8425
3889
357
2753
2902
7622
9273
6868
5090
6621
3088
5625
4400
8868
9575
7717
4363
9696
1047
6311
2704
8860
1095
39
1487
1066
3948
26
2201
2200
8466
2098
4418
3308
3197
436
9902
4216
2327
1149
477
3479
1979
4680
8655
1232
1606
951
1387
954
2338
6608
2525
8134
8486
2875
1020
4624
1273
5877
5392
3802
2238
7865
1524
8878
6187
6710
8932
4589
3129
3893
854
4098
9438
8344
5455
8350
7612
5405
971
844
5108
850
7922
9510
9135
672
1599
2720
1991
4898
380
8305
8334
2181
4004
3995
8965
4077
3507
9321
7577
2586
9777
7464
572
4811
8167
489
3698
4234
8517
1596
7299
5160
3090
2877
5173
6420
9252
2330
4999
6466
9258
4095
8417
2992
9832
5036
8495
7613
836
4838
5665
9788
9875
13
3140
8899
2998
8588
68
7931
8107
1914
8242
883
3953
3338
6693
6266
3982
1813
8514
902
9971
9282
6087
6694
4497
5481
8241
9481
7091
6037
8902
2402
4030
6516
8928
9261
1665
8530
7428
9033
1725
9160
4473
6933
6372
4507
3735
8402
8650
6869
278
4726
562
8436
585
3910
4724
5264
5235
5014
1575
4450
402
977
2158
5960
2698
5098
2029
200
8662
4619
5136
1926
4561
2606
8818
5554
2707
8437
1619
9602
5094
934
2815
9958
2379
7681
3376
4993
2192
3860
5007
8722
6257
6720
575
8895
2721
7887
1971
5533
1503
6613
9673
5828
9360
1049
7044
7819
7192
5695
9553
2283
7869
4223
9181
1193
1859
6232
3470
1447
5802
3959
4102
3919
7991
7656
6389
5219
3035
9200
3024
1477
3121
1326
4813
9815
4877
9805
1756
108
1693
964
9551
4060
8760
4902
5045
829
5016
4526
4467
6762
6586
239
9034
3774
81
5910
948
5499
9891
6601
4509
6520
7938
7137
9552
7379
1668
376
4396
7004
4415
8225
5745
5761
5412
6925
304
8536
453
1103
5022
5101
5903
4834
3834
1879
371
2136
8239
3945
9625
8075
9424
368
1775
5462
9004
2634
8072
2549
4872
9101
2425
1358
5862
5991
2421
6115
1275
7233
4406
6314
1196
4287
5436
442
158
2186
953
7412
5061
5176
616
2426
4050
4707
1848
8607
2243
1564
680
8845
1580
4158
868
3563
8195
1864
1200
7074
9811
527
6432
8840
9064
3891
9542
3425
3002
4404
6
4032
7119
4730
4998
9256
4188
9430
225
660
1509
6308
987
7061
7316
154
4767
2430
3182
1516
8209
6223
1799
7097
3659
4366
6409
9058
1973
7757
8587
3391
1920
2025
3927
1199
8594
8555
290
6207
3627
3509
3151
9519
5475
8400
3332
847
6055
4510
682
2333
3300
337
6748
9914
3486
6198
2232
7898
8857
7914
2999
4705
1079
341
1146
9107
6513
1208
9712
1298
5343
1320
5454
5187
3418
650
8626
3589
2346
4241
9621
6228
7489
6374
8238
6626
2000
306
3949
1733
50
4583
8117
9724
4713
7913
921
7652
4909
8061
4574
8705
6811
9955
1565
8511
8820
4871
3616
6428
6663
9315
892
7647
6449
6677
7735
9021
5280
9358
8048
5763
3345
7999
7121
7025
1597
2045
2326
7657
9405
4968
4733
8720
915
6834
2396
8003
7847
9586
5168
195
9127
3253
3244
155
172
2568
2395
9872
4986
2287
6892
7101
4171
9185
2839
6193
3972
6592
3411
5337
8945
3033
7698
139
2780
2822
5779
737
9148
5805
4390
1734
7512
7224
3544
8155
113
2763
6382
7560
6455
704
5613
848
4960
7517
1925
5592
8777
5714
9566
3280
1178
6199
4969
1009
8473
3342
3935
3817
4008
1414
8136
8821
8424
8317
6453
5931
1603
2957
9817
2793
7903
906
757
2260
2533
9005
6825
774
4573
1002
8218
1252
3371
8252
1581
1579
6362
4735
1153
7229
2386
6241
7857
3883
4157
3328
3963
396
4496
3679
1288
843
156
1383
2116
1331
521
4275
4446
9119
7146
7550
2427
3940
5719
291
5872
652
2506
1811
9130
5229
4076
1919
4800
1921
920
8629
9369
2547
5453
3413
9541
3038
1461
2734
9919
7090
7310
8920
4005
6348
6945
7980
6806
1517
299
7704
1691
525
1076
8543
6113
1007
1419
7251
5905
9834
2117
6385
6397
9001
2143
820
8403
6857
6637
3306
5562
9731
833
9997
9427
9585
5718
5902
8744
1577
2919
813
2583
4072
7128
8936
9348
2976
9954
3340
6989
979
4626
564
435
3426
6279
6687
2886
8978
3369
917
7682
7201
6979
7296
6999
7868
11
7915
1661
5143
8574
473
9827
9522
5237
9648
6489
329
7077
2898
2552
9453
2529
4775
1362
7615
4679
3459
7076
502
210
924
8128
9298
8794
3900
9662
5692
1090
3199
6661
2440
3862
2408
7791
6264
3831
7293
932
8780
2923
7280
1545
6988
7319
5421
1406
9196
5997
615
2121
4225
2374
1309
6651
1764
4167
5859
9035
177
4168
9732
1911
498
6784
6835
9421
6923
624
4483
1662
5812
4687
3043
9106
2378
2937
2558
7996
4714
1890
9050
2661
5032
6242
3527
1649
4284
9385
1875
1386
744
1286
7954
6473
776
7687
1462
2725
976
8870
2901
1409
285
6030
6482
2745
7353
2566
2694
3655
9684
3335
2713
7100
9906
2933
7366
5356
7590
9723
9259
8119
2366
7060
4544
6882
9942
3671
7918
7651
8819
2657
3566
8611
7175
9873
9379
5774
9172
5666
1069
2590
7132
2213
8174
3583
1324
6157
2216
8961
3521
7763
8346
1975
2641
5973
7509
7532
1832
2803
5894
5446
4755
7383
4420
5681
8596
2125
7770
6724
3424
240
5354
7235
4675
25
3967
3374
7059
7659
2859
3594
1566
9415
5083
5091
2658
2134
3000
5401
5484
4611
2034
3579
1158
9437
6342
9335
5590
1521
4292
5599
4704
8576
9189
9869
7058
952
767
5035
3346
1246
627
7648
2651
5279
3344
7592
8180
5483
3832
5103
3841
4928
7956
8525
9300
588
7520
5149
3174
1094
1730
5204
2621
7669
182
1157
736
3611
6903
235
6648
3161
1429
8434
6340
1498
5760
8829
4577
5305
568
5166
9182
4512
1269
7596
8026
5941
9655
5863
9821
6154
2518
4521
6993
6712
4677
1014
2508
1825
4378
8068
2492
3693
2423
4011
2866
2738
6028
5140
3390
8415
9947
5295
1262
4918
2078
1660
7281
3921
7065
5184
232
9092
6781
7159
3173
7570
8079
5563
7910
530
9361
3818
6484
1332
5578
334
9701
1854
5970
3007
717
4285
9153
1401
9683
296
3475
4434
9445
3638
1197
1152
7611
1080
8674
2812
7822
1628
2172
802
2981
2384
2452
152
796
76
7141
5927
975
9296
955
9146
8679
3799
9611
5595
8077
4107
203
1380
5423
1744
586
1436
8235
4289
4219
2671
6363
8609
1109
6689
3997
4668
625
3249
47
9595
4306
2740
3757
9616
4441
6668
611
3402
9990
4071
8769
5379
4580
5890
7997
5123
678
4028
146
567
2553
2849
413
2110
7324
8450
2578
5701
2580
4615
5710
8631
1827
5878
5062
5514
4270
6659
66
7017
7111
7260
4144
994
1451
8869
4160
9088
6918
2760
9767
8682
980
7030
8393
5574
6462
1399
265
9045
9190
5387
8431
2618
8448
1291
3791
6015
9934
14
144
270
4542
3185
1003
3705
2133
7421
7534
253
6065
7811
6009
7168
5224
1561
1761
4006
8582
6729
6752
4339
3473
8385
448
3461
7866
4740
9874
7161
501
4360
9469
636
5936
2899
1972
645
6059
4832
3729
9644
1087
2935
3794
2616
90
7453
6593
2295
4346
5207
9738
9166
136
6634
3139
8182
1144
1639
2879
9246
7706
7864
4203
5573
4341
7721
7096
7580
3850
8008
2598
3023
1567
773
326
7754
4831
1395
6258
3003
7028
3137
4253
8964
364
1915
6050
3874
3228
960
3801
8901
4278
6919
7686
5744
2169
9354
3914
9167
4086
4266
1499
3093
8231
7551
2095
1316
7423
6873
7795
5141
6872
9456
8858
5850
2086
1161
6632
7164
718
3867
2945
1653
3754
1330
5650
7604
1592
5531
9031
5722
8540
3067
1131
8691
2687
9853
8736
1667
1946
3605
9111
5334
5216
3608
1584
7002
518
5529
7184
9926
2357
5648
2627
7327
2820
1408
6887
1961
4196
273
6155
7149
3716
1793
3957
1110
1067
9482
4913
599
4826
6542
8421
4116
5147
8268
41
8296
6214
5906
328
2669
2893
5547
7320
4929
5439
9993
1171
9961
8062
117
8217
9016
8380
6171
9400
6893
7323
4649
4515
1363
1952
9340
2310
6624
1449
7950
1629
7827
9511
5023
4500
6675
7936
1682
5759
9091
937
3044
1141
9076
9910
257
8721
5707
1180
9476
5447
6306
6034
5067
9266
4279
6556
5373
8178
6607
6111
6560
8600
3019
4620
9963
6321
2325
5096
7408
2696
6821
3397
1250
4201
3123
1666
1106
610
1411
7639
6204
3806
9121
9304
7191
3225
1724
6063
3805
3432
7637
2905
7589
7193
4537
2139
2735
667
275
5355
5251
2988
9769
6244
1699
2541
669
4603
3347
1036
2966
9367
2710
2244
7035
4208
2182
179
5647
2343
3341
7411
622
447
6235
8422
4774
3858
226
1902
186
9170
5327
4847
4843
5723
8567
1738
9467
3145
5638
7620
6099
2711
5159
4244
6052
5616
4799
4600
4037
6353
1375
2784
4154
2768
8832
3909
9222
4760
8114
9893
75
5054
4868
768
2320
254
491
9657
3336
3401
8396
5071
9614
4488
2332
3353
8156
8811
5346
120
4920
1551
6195
4958
3379
9654
963
5471
340
4444
4825
2381
3011
1431
7023
5999
2436
2296
9355
8205
5624
9793
8001
4053
7352
1053
8223
9228
8528
3846
3986
3133
7625
1107
3315
606
7663
5316
5517
8082
7820
4851
8778
4314
710
8033
9488
3016
2612
6795
9157
2556
6517
229
2519
6733
3552
2790
345
4305
1664
1143
137
1097
9468
6807
8613
8999
8016
8247
3159
3849
8232
9152
6619
352
8985
3279
8865
7384
1063
7113
4741
5833
9909
8805
1328
3175
8734
1715
927
4866
2217
7873
2993
699
857
5202
9214
6967
3324
9412
5521
4387
3541
9245
5234
8711
7597
478
4688
5391
2831
3525
4635
5319
9535
6326
8757
4056
350
2022
3789
7238
7742
5122
5311
8601
5864
1219
519
1731
9052
8135
5018
5313
997
5773
3366
377
649
7208
2066
5
9446
6176
2959
9745
3215
441
1454
335
6488
7019
9825
3177
8509
5408
5250
6911
7602
4900
7970
7905
4952
1999
2415
795
4604
5050
4674
1294
9140
9237
797
201
9347
6683
9878
9263
912
3947
7850
8199
4501
7807
859
3179
7404
3871
6294
9836
8953
2355
8383
7715
4132
4198
986
9946
1201
5820
6756
2664
7337
2428
1439
6240
8584
4312
6391
6778
5397
1983
7394
6069
444
3057
1806
9601
221
1609
7921
6358
4654
5627
4669
7701
5597
5675
8578
5222
9243
8684
8175
4637
5121
5155
6103
1967
4548
2082
4640
7351
2047
2794
2614
5882
8570
7756
665
8981
720
539
2922
983
6985
5089
6091
4103
6168
4304
778
8787
5860
1070
5134
4210
5713
8694
608
7601
9193
7723
3651
1010
3553
8375
9663
191
6647
9540
5556
8222
8204
5602
3585
6288
6932
9017
420
6322
9278
59
5898
2562
6533
8368
5729
2249
5221
3063
7940
7678
619
4904
2786
7841
9573
4332
8646
2441
6528
356
3833
5111
1418
5946
8169
5027
6394
1072
8923
732
993
5492
9800
4205
8873
592
292
349
4746
965
5612
2104
4759
8093
3202
2777
5767
5558
7321
3523
300
6595
9928
9633
1433
2483
4934
1568
7488
1343
9532
5241
4128
841
7474
7870
7034
5780
9754
8866
4711
3318
4323
4693
2126
4856
9727
2257
3271
580
2972
5432
2978
8353
1643
4262
1222
1306
8012
6415
6866
9466
8476
5179
8848
393
3020
7459
5598
6654
8266
8432
3018
443
2524
6443
140
8790
6296
4516
1229
2656
697
5352
4924
7546
9833
8750
5938
3680
8872
9940
4195
2416
17
5158
7401
4690
6498
4616
3132
1074
5669
9434
7788
2349
5268
3292
2949
3242
4744
6071
5001
9556
5199
4815
1356
8925
5306
3743
9191
7785
7777
5277
5210
1426
8359
5874
9507
5541
5403
9302
3648
2829
198
3567
2385
8669
4524
620
2494
1071
8837
4367
3008
3073
2619
2649
1483
5771
5942
7503
1388
6915
1658
9890
3746
6832
1420
5252
9785
1126
2888
3568
2113
2775
8354
9571
7125
6074
8671
9025
4187
3221
2678
5209
8230
1365
5935
5012
8376
9117
5049
5652
4340
871
8934
1299
3498
1314
6135
6299
7984
5544
7419
7522
9070
9562
192
4639
1084
2924
505
1929
1470
8187
1873
3327
2697
4888
3932
8166
1283
8849
2118
9207
9599
3441
9080
6346
497
1284
6247
6033
332
6577
2383
3828
2344
1248
3443
6618
7286
8656
4579
6578
933
9782
7289
2996
7730
8409
6616
7493
8566
8460
2581
5488
8617
7764
1870
4601
510
8828
6068
8969
8912
3946
7155
5456
7813
1796
8804
7176
7131
3811
3537
9709
5442
7420
5244
516
3641
6652
3465
2821
8435
1627
8844
3192
1068
9201
4788
7440
6162
486
7809
103
8882
9126
5206
4895
2482
6285
7572
9538
2361
4002
3570
777
6770
4917
7605
8997
8269
2717
8589
372
2364
6522
863
1321
3437
9480
6697
7079
2083
1296
3448
5985
9436
2294
1932
283
3339
6368
2750
2493
7372
6272
5297
7506
6026
3382
7204
7138
1650
6757
3941
2783
8319
8867
9067
5724
8045
1572
6062
5267
5196
9344
131
8262
8372
6475
4846
9656
9948
8021
7329
5329
6460
2101
9879
7444
6780
7933
4595
4454
7449
3012
9736
5496
3208
6563
2969
3154
5129
5838
430
8321
4356
8384
7810
5172
851
673
7349
4079
2088
3847
5685
8490
7919
8887
2272
2878
3357
6060
877
3663
9175
726
5461
4257
5920
7478
5619
5784
5801
8004
9365
1685
6366
2660
5810
1790
434
5085
5657
6486
7013
9658
686
4254
2411
1026
319
6907
8355
4609
5088
6732
9443
5993
9660
2431
3115
2911
2376
2250
2970
9003
7627
3604
4108
8904
6568
9352
87
7016
64
3010
38
9703
7095
4921
8300
9921
8616
9151
5743
8257
412
1062
8145
9317
4665
1349
7830
4970
5377
4073
8151
2908
5829
6102
2453
3767
3290
1617
3545
2063
2013
8452
180
4890
6000
4101
3989
8455
6500
3815
3360
6554
9132
5815
7814
2676
8356
557
7433
8006
5010
5702
7098
124
5917
8624
4926
8092
1484
6109
8960
5177
4209
8034
3189
5114
1382
2709
3436
8597
2603
9867
400
6848
1648
5086
2302
4983
404
9808
721
8983
2817
4172
1048
7573
3979
9413
6889
8153
5042
938
9073
2328
3619
8586
1826
5081
2220
5876
5751
2021
8398
554
1856
2140
8288
5658
5409
3250
4295
2914
6742
2863
1632
2424
8179
379
7643
8374
5785
7688
2006
903
8759
9917
3864
8483
481
1215
3001
6709
7165
6614
828
246
7481
9327
6653
2037
5301
2392
696
8783
8507
2575
3730
1998
9262
7262
6085
2219
3220
135
6878
2868
6184
9861
5683
3558
8101
3728
5137
3715
10
94
2164
8987
8835
1198
974
5839
882
7607
3937
1816
7618
5696
5791
7479
6879
4432
8918
5242
6597
9819
555
7406
8950
3869
6909
9392
2274
7574
9935
1515
6027
5511
1025
9930
88
1112
4984
4782
1949
7490
8633
1468
4870
4328
6302
2499
541
1908
4776
8520
1769
3052
236
6292
7136
593
4555
1138
446
6098
7632
8550
8094
1338
925
4927
6039
2166
8286
7917
8388
1917
8259
7325
4288
280
1450
3144
7210
1569
1937
5700
3112
8623
1881
8581
6408
1771
4153
6095
7947
6238
6851
1514
1518
9988
3840
1302
4784
8524
3412
7087
8047
6587
9969
8078
6152
4055
7391
8776
2372
9803
602
2724
411
1113
9254
2273
908
4828
1156
884
7906
4065
8357
7268
5445
9042
9040
8032
4320
5888
5553
2847
4335
3495
3505
6181
3458
8064
7676
2226
1312
1081
787
5257
9697
7134
8025
9555
1692
9981
5990
5725
5190
6417
9530
3446
6719
3803
8110
6413
5494
323
9028
5074
2870
5919
6211
2736
5214
2306
9726
6149
3844
4636
3522
6160
9584
125
6219
1104
8941
9496
3733
5399
8496
5390
1270
7897
2806
6589
2832
1175
431
893
8469
9087
6221
4029
5986
9911
3786
3158
3065
3071
9896
1984
523
7007
8680
4228
1030
6636
6183
9992
8534
2275
6057
3856
7083
8795
3083
7712
9978
5749
1955
9801
5288
6704
1167
2069
8729
8808
3452
1538
548
1255
812
5060
6681
4191
8456
8299
6975
4751
8057
4659
2451
5585
1216
5300
639
8188
1780
3899
7689
8030
5406
2662
9238
6110
9837
5518
386
4445
5900
8779
5611
7375
8499
4204
1645
6487
9533
8905
2195
4459
8608
1243
4821
2178
7958
7616
6124
6008
8056
7544
5687
1950
5285
3187
9291
9894
4097
9674
8742
1502
5195
8959
617
7212
1054
5783
5752
7094
6262
6305
2889
196
2149
8625
2807
3970
2447
9557
9210
3029
6839
451
8181
5778
2626
7942
1268
515
9346
2450
5281
8546
1751
6439
1050
1276
989
9159
9780
8651
2279
1741
7972
6005
8322
8014
3313
6602
284
3477
5212
1636
8537
9798
8548
4790
9862
8074
8345
3420
6170
9428
3198
2205
1209
4694
2403
7344
4623
529
4543
3453
7871
4976
3584
1182
9901
6875
6551
7275
5372
1051
5351
2363
9353
2068
1116
7304
3852
809
3933
9531
6944
623
2433
3532
6230
1017
7696
7071
4364
1442
5886
698
6089
3596
1615
4789
8501
7875
2096
6269
9316
3614
0
4863
8312
2599
9048
1732
1891
2367
5338
160
1163
7105
1884
8768
6700
5110
3530
6812
1088
762
1578
338
31
9284
1329
3451
8150
9150
9631
9277
7057
6912
9972
6623
7776
2559
4535
2480
4286
3022
3224
4606
5568
417
9504
4988
8255
9100
6604
5915
1676
3232
8017
5284
459
1488
8451
2405
677
913
6943
7856
2322
8558
387
9329
597
1078
3771
3772
4397
8551
8797
2772
4906
3176
8084
9576
4
2589
2729
7944
2602
5712
7068
2670
7006
6175
5914
9559
6941
9752
3981
6393
169
4992
2227
4163
6818
5359
77
4093
6197
8275
1466
3629
3820
4582
7376
8503
4779
8446
6479
7786
3683
2398
7317
5345
3634
1267
2208
7653
5923
1132
9359
8315
2262
5290
1593
6823
566
1697
4302
6213
7037
9799
439
5684
8638
95
1573
8935
7781
5263
6555
8598
9578
4911
5570
8314
6105
9944
8438
2650
2455
1723
1075
3612
2708
4719
5276
1086
4947
5662
480
6146
6858
6676
1977
4935
7881
5431
6852
8015
1522
8852
6265
3781
9461
3565
7487
9209
8702
6012
6833
5236
2609
303
3880
8937
4070
1534
4919
5437
3668
8055
6836
2286
8827
4123
9484
2230
5928
4428
8612
5084
764
3277
2700
470
6898
1787
2517
4729
8703
8338
7309
1953
313
234
1987
6159
1457
8628
6044
6304
5705
6666
3170
7313
6140
6442
3561
9483
3866
885
3229
5871
3500
1680
5429
378
5336
958
5465
5548
3773
9923
1591
463
1279
506
4547
4883
8132
7801
9509
4177
9666
7666
9471
7749
4764
2809
1351
3682
2921
4460
3955
1931
5294
7242
6982
1041
3503
202
7451
3460
4706
8500
7107
7998
9985
4891
6680
3617
759
8154
5451
1978
72
5247
7099
8526
5964
4256
8481
1124
600
1894
312
1674
5817
5721
9198
5227
5868
5402
9299
6451
1735
3304
1886
8687
5292
2642
7015
5593
551
4864
3421
9615
7266
8360
8125
4334
1486
2229
1259
185
5105
8373
8712
3049
7377
4448
3973
2443
9203
7662
5194
5691
2906
9109
6758
7987
1350
5870
819
2434
9842
9047
6844
9280
5575
479
1277
532
3273
4277
4431
6760
6590
9231
1851
6084
7772
5441
9479
23
3886
2321
3650
2388
1058
5959
9857
6948
9440
3268
4471
9213
2470
1935
1185
5524
8129
7215
4354
5076
8260
4954
3562
2504
1533
1623
9257
2203
9790
5360
2797
7553
2303
6317
1374
3282
3591
4064
6640
6998
9319
8531
3303
3296
8661
7202
6610
5956
6939
2491
4956
9632
2576
2225
9897
6459
6471
6031
8800
9223
1646
3897
2055
9234
4261
207
4899
861
4231
363
8248
9079
7711
9980
1417
834
9581
2846
1689
1475
1752
7513
6986
8991
8735
5661
1485
1127
9020
9409
4797
10000
197
8352
1318
4550
1896
7738
6822
1148
4137
3908
7010
5663
7322
3464
8474
6100
3
1889
2761
5819
216
2054
6448
8226
6539
4118
4175
563
1506
8365
8630
4545
9027
7186
6531
8428
8280
6480
7398
2869
2290
1585
5386
4610
4865
5500
8444
7482
8696
6767
3613
4576
4353
808
2833
5730
959
5610
8670
2122
5512
6179
6883
8138
6819
4684
458
7793
5949
8031
2019
8447
5070
7126
6161
6940
4374
8009
2826
2369
2435
3113
3389
209
9886
8475
61
7227
5738
6132
6630
6947
546
8542
8098
9527
7277
6017
6664
3763
1749
7112
7047
7794
5398
6128
3998
8304
8681
8491
,
=
a
b
c
d
e
f
i
l
n
o
s
t
u
v
##1
##8
##3
##0
##9
##7
##2
##4
##6
##5
##n
##f
##o
##b
##t
##a
##e
##l
##u
##c
##d
in
st
va
##fo
##te
##ate
##lu
info
state
valu
value
infod
infoa
infob
infoc
##93
##81
##87
##51
##39
##65
##89
##63
##90
##88
##68
##66
##99
##97
##96
##83
##85
##91
##61
##64
##82
##84
##94
##86
##80
##98
##60
##69
##67
##62
##92
##95
