[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
,
0
1
2
3
4
5
6
7
8
9
=
a
c
d
e
f
h
i
l
n
o
r
s
t
u
v
##0
##8
##9
##5
##7
##1
##4
##3
##6
##2
##a
##l
##u
##e
##n
##f
##o
##i
##t
##r
##h
in
st
va
##at
##lu
##fo
info
stat
valu
state
value
infoi
infoo
infoh
infon
infor
##00
##16
##17
##15
##13
##12
##18
##96
##14
##92
##93
##95
##94
##04
##02
##97
##05
##03
##06
##98
##07
##08
42
38
##78
##35
48
45
44
46
##76
##75
##74
##32
68
72
##34
78
58
56
66
75
64
65
##72
76
62
74
##36
##38
##11
52
54
##99
55
##77
##33
##01
32
35
##09
26
36
25
28
22
34
15
24
16
12
18
82
14
##19
##73
##10
##79
##37
##39
63
73
77
67
57
##90
##91
##71
##70
##30
##31
53
43
47
##64
##65
##85
##82
##42
##55
##84
##62
69
##88
##56
59
##52
##48
##68
##54
##66
##44
##86
71
##58
##60
61
##61
##63
##87
##22
##45
79
##67
##81
##89
##47
##59
##83
##24
##69
##27
##57
##53
##50
##40
##51
##43
##26
##23
##80
##29
##25
##49
##28
##46
##41
##20
37
##21
39
49
51
41
83
23
81
27
33
70
60
13
17
92
50
40
29
31
80
84
21
94
88
19
517
95
478
518
98
432
85
395
516
96
504
505
493
503
497
502
378
506
86
492
402
676
417
612
678
707
736
397
596
632
400
407
408
615
416
700
11
472
512
703
617
508
593
398
513
393
403
474
375
418
412
578
394
475
396
500
514
705
692
435
675
415
413
494
498
476
515
715
574
616
496
575
696
605
404
595
613
704
376
438
693
406
717
507
672
635
792
434
772
598
732
592
614
604
796
775
414
713
607
716
597
718
618
694
674
594
636
603
392
608
638
712
495
708
436
695
776
702
735
600
698
405
778
734
374
738
602
793
697
794
572
795
606
576
714
706
774
30
634
97
87
93
535
532
536
534
318
797
538
232
204
202
300
272
102
296
117
114
212
338
200
234
215
205
174
295
203
294
306
206
334
217
303
304
196
302
112
105
135
275
214
207
307
132
313
798
835
172
116
315
176
293
274
108
178
372
195
298
317
292
278
316
818
194
197
276
312
192
213
208
335
136
308
235
106
800
808
377
10
175
806
238
118
216
103
804
314
107
807
336
433
834
816
113
817
813
100
193
104
115
20
812
138
236
99
832
198
134
805
332
297
814
218
815
802
91
305
803
477
89
##791
473
##010
##019
##190
##119
677
##110
##090
177
373
##111
##091
##790
##191
##991
777
133
##990
733
##391
277
90
633
333
##999
233
577
##370
##390
273
##371
173
573
533
673
773
836
833
501
158
251
324
122
220
490
510
337
484
325
255
254
139
123
455
310
263
366
211
511
440
269
343
230
327
227
159
279
237
519
390
419
349
270
385
491
423
485
169
368
267
229
339
509
487
150
166
185
319
388
480
360
285
286
425
358
353
341
171
209
371
370
322
248
448
253
168
311
458
462
520
429
463
151
141
330
127
239
309
154
142
401
383
486
261
252
110
411
320
155
161
187
210
350
289
340
119
453
323
152
124
420
422
389
482
351
281
245
163
143
359
249
170
391
140
439
441
444
247
130
469
369
221
162
120
149
219
386
456
352
259
165
201
410
430
427
483
184
387
256
428
481
367
223
488
457
447
280
299
128
180
460
465
266
144
379
459
443
228
167
271
437
431
426
355
364
284
301
260
283
344
153
181
421
226
189
186
148
191
424
452
464
321
264
225
246
471
243
109
354
111
381
329
363
179
131
342
357
362
242
160
290
470
461
257
183
446
125
399
121
145
199
450
328
222
157
126
345
291
384
451
244
137
331
380
449
442
347
164
188
382
454
287
231
467
466
326
258
147
262
348
445
250
499
479
265
356
365
190
268
346
409
224
156
182
489
129
240
361
288
468
101
241
146
282
894
855
838
885
915
913
975
955
895
964
897
974
985
942
996
908
952
993
972
936
892
914
922
934
903
842
864
904
902
982
917
992
862
900
893
932
865
852
874
995
965
875
872
878
994
935
896
978
876
882
998
984
976
906
938
962
912
898
916
884
918
907
844
997
905
854
888
954
944
988
848
856
956
986
6825
6733
7803
977
866
845
6788
7234
6614
5945
868
7829
5848
6175
6723
7229
7883
7301
7197
6369
7522
6325
6729
6532
7609
6393
6303
6109
5746
6963
7188
7894
6424
7452
7031
948
6318
6783
7077
5966
5804
5699
5610
6693
6273
6210
7913
7364
7000
6923
7728
5982
6072
6888
5864
5869
5697
5663
7534
7663
5573
7704
5734
7217
7821
5600
6699
6630
6464
6461
7079
6165
7729
6983
6739
7811
7871
5831
5865
5828
5626
7591
7526
6437
6296
7413
6156
6172
5784
6756
6164
5925
6946
7936
5761
5737
6670
6665
7797
5939
5749
6771
886
968
7200
7251
7220
7878
7867
5839
5660
6632
6660
6494
6564
7627
5590
5735
7116
6765
7366
5961
6323
7054
6922
6757
5759
7759
6020
933
7268
7892
5836
5611
7593
5574
5995
6117
6113
7016
6124
6157
5783
6960
7928
6362
873
924
6857
5886
5840
5676
6677
6623
7589
6550
7671
7661
7640
7407
6778
7118
6100
7916
6785
5962
7172
6041
877
966
958
6802
6870
7287
7253
7859
5838
5868
5638
5601
5681
6631
7527
7580
6572
6571
6570
7674
7682
7648
6244
6289
7418
7485
5578
5558
7798
6719
5775
7092
6013
6764
7361
6329
7001
7171
6940
7149
7019
858
6854
6847
7210
7802
7848
7822
7824
7850
5829
5616
5604
7556
7541
6406
6471
6444
6427
6596
6548
6211
6264
6258
5572
7776
6904
7192
6121
5969
6321
7035
6058
6930
6140
7960
7133
7160
6180
7125
6871
7235
7837
5898
5642
6628
7548
6265
6248
6281
7432
5592
5595
5576
5579
6335
7303
5736
6998
6908
7903
7095
6768
6152
6050
6134
7920
7329
7325
6147
6049
5973
6030
6082
6951
6391
7290
7242
7895
7847
5646
6645
7566
6411
6423
6592
6237
6230
7499
7462
5570
5566
7372
6916
5965
5937
6168
6169
6167
6357
5929
7969
7750
5976
6741
7121
6007
6977
6818
6891
6867
6827
6841
7298
7207
7255
7226
7868
7861
7827
5896
6638
7599
7529
6415
6476
7634
7665
7688
7645
7651
6267
7405
5555
6392
6394
7794
7708
6734
5709
6993
7108
6769
6326
5936
5959
7167
6749
6386
7344
6974
6341
6010
7791
6837
7816
5849
5664
5685
6692
7577
7542
6456
6534
6539
7458
7483
7427
5586
6302
6334
5795
6992
7114
6125
6127
7032
6178
6179
5787
7152
6055
7752
6032
6081
6083
7747
6331
7010
6819
6882
6843
7274
7224
7243
7855
5833
5879
5845
5820
5688
5628
6635
6648
6681
7579
7584
7553
6460
6487
6469
6582
6545
6583
7633
7666
6292
7459
5584
5581
6316
6399
7304
7375
6707
5705
5772
5992
5901
6195
6766
7009
7037
7034
5935
7051
6132
6932
5987
7326
7087
6005
7784
7384
7942
7069
7742
7779
5791
6895
6878
6836
6899
6873
6844
6845
7275
7800
7804
7889
5659
6588
6589
6551
7697
7626
7620
6235
7492
7476
7477
7461
7714
7107
6102
6106
6120
7070
7072
7360
6927
6059
6130
6938
7722
6045
6075
7169
6035
7020
7342
7331
7730
6832
6801
6856
6826
7273
7230
7285
7247
7818
5888
5677
5645
6639
6655
7500
7575
7564
6416
6579
7608
7676
7691
7659
6274
6282
7414
7474
7439
7424
7425
5567
6317
7305
7334
7713
7735
6995
6911
6112
7915
6782
7007
5931
7055
7155
7048
6935
6385
7124
7081
7350
7941
7950
5990
6791
6814
6885
6851
7272
7209
7265
7282
7284
7898
7860
7845
5837
5843
5823
5692
5632
5666
5657
6696
6697
6607
6687
7504
6486
6453
6443
6504
6576
7603
7635
7637
7658
6205
6231
6229
7426
7429
5569
7701
7709
6716
6712
5714
7094
6018
6789
7078
6327
7059
6758
6754
5751
5953
7046
6354
7924
6142
7136
5970
5974
7122
7353
6003
5769
7067
6894
7280
7801
7869
7846
5819
5880
5617
5627
5640
5623
6617
6672
6611
6633
6601
7550
6403
6465
6459
6509
6520
7605
7649
6222
7495
7435
7419
7437
5596
7706
6709
5796
5916
6116
6199
7905
7018
6762
6151
5785
6920
6921
6054
6138
6936
7178
4347
7323
6048
6088
7080
7787
7783
6770
6730
6110
7111
6865
7293
7202
7239
7834
7870
5834
5882
5636
5682
6675
6624
7518
7539
7568
7543
6412
6482
6420
6552
6259
7497
7482
7441
5588
5556
5589
6311
7716
6710
5793
6909
6919
7103
7099
6012
6153
7005
5930
5933
7056
6926
5745
5758
5754
6966
5957
6934
6721
6359
6355
7723
7130
7187
7760
7763
7766
6068
7062
6348
7970
7391
6800
6898
6833
6862
7216
7232
7201
7289
7893
7863
5856
5822
5857
5665
5687
5647
6656
7507
7576
6498
6434
6438
6473
6595
6523
7606
7630
7664
7686
7660
6232
6238
6277
7455
7467
7447
7449
5564
5565
6306
6309
7393
7309
6796
6797
5700
5701
5912
5993
5908
7113
7109
6095
6126
7071
5960
6155
7006
5788
5786
7153
6161
6964
7041
7044
5988
7757
7131
7165
6745
6743
5948
7345
6024
7939
7937
6976
6091
6805
6830
7297
7206
7299
7271
7259
7250
7225
7246
7819
7842
7852
5892
5854
5859
5883
5686
6612
6694
6689
6627
6646
7513
7552
6499
6484
6519
6522
7667
7650
6200
6278
6268
6283
7494
7481
7453
7318
7774
7734
6700
6711
5704
6902
7193
7907
6093
6011
7075
5968
6171
6928
7151
7156
6057
5950
6131
7040
6931
7925
7961
7185
6367
7769
7029
7021
7389
5720
7955
7142
7773
6816
6896
6808
6876
6879
6831
6881
7208
7279
7291
7266
7817
5871
5824
5667
6606
7505
7506
7536
7573
7586
7587
6400
6431
6458
6508
6585
6566
6581
6540
7639
7683
7410
7464
7443
5598
5580
6395
7379
6795
5900
5918
5998
7101
7910
4785
6761
7004
7050
7058
6755
7157
5742
5757
5954
7173
6352
7727
6148
7161
6189
5943
6039
6984
7788
7380
7330
5731
6111
6991
945
6817
6835
6848
6824
6840
7213
7292
7204
7238
7270
7864
7854
5876
5873
5830
5614
5680
6604
6642
7516
7508
7510
7525
6405
6472
6442
6481
6515
6593
6577
6533
6546
7690
7652
6298
6285
6287
6223
7400
7403
7408
7460
7446
5587
5553
6315
7733
6793
5710
6907
5997
5910
7900
7912
6017
6122
7369
7365
7039
6177
6751
7159
5750
6052
6139
6725
5926
6143
6044
7966
7754
5975
6181
6747
5946
6384
7126
7084
7083
6959
6956
7381
7959
6063
5770
5999
6370
6842
6860
6853
7215
7203
7237
7267
7874
7872
7862
7858
5897
5874
5855
5850
5654
5622
6654
6657
6626
6625
7514
7582
7562
7520
6413
6435
6477
6462
6449
6428
6518
6575
6510
6544
6563
6587
6547
7615
7696
7623
6291
6251
6246
7415
5593
5554
5561
6305
7312
7397
7796
7772
5794
5905
7195
6192
7012
7097
6016
6098
6099
6129
6780
7363
6962
5955
7045
6141
7967
7964
7963
7139
7137
7132
5979
6941
6943
6365
7768
7025
7022
7357
7356
6009
6981
6982
7343
6064
5763
7745
6330
5779
7190
7191
7256
7254
7257
7813
7838
7877
7839
7866
5812
5893
5894
5877
5801
5863
5889
5693
5694
5672
5690
5651
6678
6676
6643
7509
7544
6496
6468
6466
6489
6421
6573
6555
6553
7616
7654
7646
7621
6201
6270
6256
6261
6241
7411
7409
7448
7423
5599
6372
6379
7377
7792
7778
6798
6735
6736
5776
5732
4335
6917
6906
6901
5917
7906
6123
7073
6154
7008
7033
6759
5748
5753
5951
6135
7043
6939
6722
7721
5989
5920
5927
6149
6070
5972
7184
6187
6184
6945
6080
6958
7762
7352
7383
6023
7948
5724
5723
7953
6065
7144
7146
7971
6813
6839
6864
7833
7888
7856
7843
5810
5827
5615
5671
6608
6637
6662
6667
6659
7535
6493
6567
7699
6203
6206
6272
6245
6250
6280
7417
7412
7496
7433
7473
7469
5583
6396
7314
7394
7306
7336
7718
6713
6776
5716
6914
5996
5907
7917
6094
3789
6786
7367
6322
6150
6176
5780
7158
5747
6969
5956
6728
6353
5980
6043
6748
6383
6957
7023
7359
7947
5764
7060
6779
7110
4441
6812
6838
6811
6861
6850
7244
7812
7836
7857
7849
5813
5866
5696
5605
5635
5674
6629
7572
7538
7531
7561
7547
7557
7549
6475
6426
6594
6565
6584
6554
6561
7600
7677
7610
6216
6294
6204
6233
6266
6225
7438
7479
7491
7484
7376
7715
6715
6703
6706
6774
5902
7115
7911
7096
6014
6763
7368
7362
5789
4751
6752
4760
7047
6350
6358
7929
7922
7328
6078
6076
7180
6185
6944
6746
5947
6033
6382
7128
7938
6975
7943
5727
6731
6806
6863
7276
7211
7897
7865
7853
7840
7851
7820
5814
5835
5844
5821
5606
5698
5607
6602
6605
6636
7517
7512
7537
7569
7540
6454
6450
6425
6598
6525
7687
6218
6275
6299
6209
6288
6252
6253
6243
7402
7428
5563
6308
6375
6338
7316
7738
6704
5708
6115
6096
6128
5963
6158
7926
5981
5923
7162
5971
7186
6183
6942
6036
6954
7026
6008
7346
6028
7945
7944
7951
6067
7143
5739
5991
6875
6890
6859
6869
7288
7227
7228
7896
7886
5851
5826
5846
5613
5634
5691
6679
6685
6688
6666
6661
6622
6641
7524
6490
6514
6568
6524
6529
6549
7612
7678
7672
6217
7404
7486
6300
6319
7396
7374
7319
7795
7736
6794
6702
6799
5711
5994
6118
7015
7093
5092
5178
5052
4027
6781
5964
7036
7150
7042
7177
6356
7927
5983
7327
5922
6046
7182
3920
6388
7088
7089
6000
6004
7348
7385
7140
7771
6339
6191
3855
4625
6892
7283
7875
7891
5805
5885
5678
5637
5625
6613
6674
6640
6649
7532
7519
7558
7528
6497
6432
6479
6463
6502
6505
6530
6542
6557
7617
7618
7611
7642
7653
7680
6214
6219
6290
6271
6247
7465
6312
6377
7317
7793
5717
5718
5792
5707
5778
5719
6905
6114
7901
7909
6760
6767
5741
5743
6136
5928
7138
6188
6740
6742
5940
6038
7767
7388
6062
7148
7770
6119
6872
6852
6822
6880
6828
5815
5878
5899
5858
5602
5619
5653
5620
6698
7515
7570
7546
6492
6491
6574
6538
6511
6543
7614
7662
6293
6295
6207
7478
7434
6310
7332
7705
6714
5715
6108
5179
7003
7002
7052
5752
7176
6720
5986
7322
6144
6085
7086
7785
7382
6979
6973
7957
5762
7743
6344
5730
6737
4217
4405
6855
6829
7233
7248
7263
7281
7223
7249
7241
7807
5816
5872
5881
5853
5679
5670
5662
5652
5661
6634
6609
6682
7588
6478
6433
6419
6537
6591
6531
7698
6297
7463
5577
5585
7302
7398
7702
7703
7710
6792
6772
6738
6994
6903
6910
6194
7908
6929
6160
6968
5958
7726
7324
7965
6077
6071
6980
6985
6025
6027
7933
5766
7064
6340
5353
6777
6773
7339
7739
7731
6790
7119
7371
4263
3835
3852
6893
7296
7278
7245
7221
7881
7825
5802
5807
5825
5639
5658
6615
6603
7596
7594
7560
6407
6430
6452
6445
6483
6451
6516
6507
6556
6559
7602
7619
7668
6236
6254
7436
7422
5421
5559
6374
7307
6718
5702
5738
5311
7100
6196
4104
7014
4329
6320
6159
6170
5932
7053
6965
7170
7174
6724
7968
7164
6182
6947
6089
6380
6389
6953
6952
7765
7355
6001
5725
5765
7066
7741
6371
6877
6809
6883
7231
7832
7899
7884
5811
5809
5631
5656
5648
5668
5669
6619
6673
6664
6668
6644
6663
7595
7598
7533
7530
6439
6470
6448
6429
6441
7670
6234
6249
7498
5247
7313
7700
7799
6717
5915
7105
6193
6104
5164
4077
7038
6174
5781
5782
7154
6967
6133
7179
7175
7720
5984
6042
7755
7189
7183
6364
6037
7761
7024
7358
7354
6987
7780
7789
6026
5729
4333
6990
4242
4606
6889
7260
7879
7882
5800
5875
5862
5860
5643
6691
6652
6651
6620
7503
7571
7521
6418
6569
6580
7684
7656
7625
6202
6257
7488
6314
6397
6336
7399
7717
6705
4300
6912
3996
7098
5046
5020
4170
6324
3946
5153
5740
7049
7923
5985
6047
6079
6074
5949
6381
6950
7786
7340
6021
6972
7749
7337
5333
6390
4201
4262
3874
4537
6803
6884
6823
7212
7876
5832
5689
5650
5649
7574
7501
6485
6455
6457
6513
6597
6501
6562
7693
7607
7638
7601
7657
6242
6284
6262
6263
6226
7457
5456
5582
7300
7308
7338
6708
5733
5903
7904
7902
3909
7011
4327
3954
5031
5934
6166
5952
4386
6145
7168
6368
6084
7129
7085
6955
7949
5728
6061
6342
5771
5370
6190
4875
4882
4438
4628
6815
6807
6866
7218
7887
7826
5818
5884
5852
5612
6695
6671
7597
7585
7567
7581
6495
6422
6536
6560
6239
6255
6260
6269
7456
7421
5464
5468
5420
6304
6398
6307
6373
7719
5713
5797
5913
5911
7914
3953
5064
4927
4924
7030
5938
7057
6925
6750
5755
5756
4042
7921
7962
6073
6361
7082
7931
7934
7956
6069
7147
6337
5777
7090
7790
4665
6887
7214
7277
7222
7814
7844
7823
7841
5806
5890
5608
5633
5624
5629
5641
6616
6680
7502
7551
6401
6488
6526
6528
7673
7679
7401
5427
5597
6313
7392
4706
5906
7102
4101
7013
6097
3959
5044
5056
5037
6787
3970
6056
6137
6727
7321
7758
7134
5977
6989
5721
5726
7958
7748
5354
7737
5790
4230
4288
3834
4800
4896
6886
7286
7261
7240
7890
5803
5842
5603
5684
5644
6618
6610
6647
7555
7554
6474
6467
6506
7694
7631
6208
7416
7440
5424
5591
5562
7395
7378
7712
6701
5315
6918
7196
7104
6107
3997
6015
4781
4782
5028
7074
6328
4039
3751
5924
6040
7753
6002
7347
7341
7932
5722
7370
4205
3804
4842
4856
4572
7295
7262
7815
7831
7885
5861
5847
6690
6684
6621
7592
7511
7563
7523
6404
6480
6590
6558
7613
7632
7655
7647
7643
6215
6228
7475
5223
5557
6378
7707
6915
3736
3995
4970
5021
6784
4165
6924
6961
4069
6726
7751
7135
7181
6948
6949
5944
6360
6366
7120
7127
6988
7781
7782
6970
7952
6347
4261
4811
4837
4587
4474
4676
7205
7258
5895
5870
5841
5609
5673
5683
7578
6402
7675
7624
7641
6240
7406
7468
7487
7489
5260
5483
5568
7335
7711
5712
5798
5909
3738
3901
5113
5192
4938
4026
3988
3989
4182
6937
5921
6186
5941
6387
7028
7027
7351
6971
7954
7061
5352
3779
6999
7390
4227
4226
4544
4589
4478
6804
6874
6858
6820
5817
5655
6436
6578
7636
7685
7689
7669
6276
6220
7493
7431
7420
5220
5460
6732
5799
4716
4734
6913
6996
5919
7919
3797
3900
5186
5047
5066
4071
4082
5125
6173
3931
4181
5001
4350
6053
3762
7725
7349
7063
3777
7091
4214
4276
3806
3836
3848
4801
4415
4483
4668
4653
6821
7294
7264
7805
7810
5887
5695
5675
5630
6683
6500
6512
6535
6527
6541
7471
5212
5278
5259
5571
5313
5312
4710
6900
7106
7199
5112
6092
4780
5163
5967
3987
4126
4759
4136
5744
7756
6363
6087
5358
5368
5773
4211
4291
4289
4257
3813
3877
4535
4533
4416
4685
4684
4687
6897
6810
6868
7219
7873
7828
5867
5618
6669
6650
6440
7681
6286
7472
7442
7444
5202
5222
5228
5493
5403
5419
5703
5706
5904
6101
7918
3734
3993
3910
4913
4992
4908
4786
7076
5129
4033
4135
4984
6351
7166
7764
6986
7930
7940
6060
7068
5349
3831
4814
4885
4514
4501
4521
4479
4459
4616
4612
4633
4654
5891
7565
7559
6414
6503
6586
6227
7470
7445
5274
5299
5210
5400
5411
7732
5774
4774
6997
3905
3998
4097
5171
5039
3784
4020
4172
3973
4089
5122
3757
4125
3967
6753
4987
4040
5076
6031
3744
7740
6349
5330
5019
4219
4279
4284
4259
3807
3882
3889
3840
4893
4878
4513
4532
4534
4558
4561
4523
4424
4695
6849
6658
6409
6446
7695
6279
7430
7480
5204
5276
5244
5253
5484
5467
5594
5575
5560
6376
6332
5372
4314
4376
4338
4772
4799
4912
4103
4934
4973
3787
3781
3982
5135
4034
3948
3965
5145
5156
6163
4387
6034
7386
7935
5768
7141
6345
5380
4770
3991
5010
6090
4273
4290
4250
3893
3897
3808
3884
3847
3829
4806
4874
4887
4590
4591
4581
4496
4434
4477
4489
4614
4639
7269
7808
6686
6408
6447
6599
6521
7692
7622
7629
6213
6221
5234
5211
5209
5230
5499
5463
6301
7311
7373
5374
5373
4398
4379
4797
7194
6197
3735
4911
5100
4109
4975
5067
4029
4176
5005
4153
4388
7724
7320
5942
7946
6066
6346
5339
4371
4220
3832
3842
3888
3863
3883
3857
4805
4879
4881
4828
4504
4578
4562
4529
4525
4402
4442
4425
4600
4657
7252
6600
6653
7644
6212
6224
7454
5296
5277
5442
5447
5425
8268
7117
7112
6198
4193
5014
5097
5173
4328
4323
3956
4930
4921
4120
3943
4357
3760
6146
7163
7123
4367
4051
6978
8343
4216
4285
4255
3870
3830
3828
4576
4531
4551
4484
4451
4619
4651
6834
7236
7830
7590
7628
5236
5238
5201
5406
5485
5454
5304
4904
4907
5193
7017
5098
4018
5189
5187
4322
4922
4175
4001
4079
4073
5128
3980
3963
4158
4941
4769
6162
4045
6022
7145
5326
4339
4010
4391
4206
4240
3872
4820
4500
4512
4554
4498
4401
4454
4469
4603
4674
4634
4688
4650
6846
7835
7880
6410
7604
7450
7451
5218
5287
5269
8283
7315
7198
3792
3915
3992
5109
4095
4094
3955
5161
5043
5054
4935
4932
5029
4024
3978
4076
4087
4161
4726
4740
4745
4129
4123
4755
4752
5008
4354
4155
4763
6051
4381
4344
4148
4145
4146
3925
6086
4055
7387
6029
6343
5351
8187
8066
8078
6333
4110
5090
4293
3892
3894
3898
3833
3809
3885
4883
4827
4547
4492
4437
4485
4456
4447
4602
4683
4643
7806
7490
5208
5270
5495
5474
5487
5459
7310
6775
4738
4709
6105
3913
3914
4905
4194
4107
5012
4092
5170
4789
4028
4178
4000
4088
5084
5082
3930
3938
4035
4184
3940
4130
4945
4967
4061
4064
5978
7065
7746
5322
8326
5190
4212
4202
4297
4275
4299
4228
3891
3849
4815
4898
4876
4824
4556
4548
4546
4470
4448
4466
4618
4605
4632
4673
4679
4664
4661
4647
6417
7466
5293
5233
5265
5266
5434
5436
5428
5319
4302
4735
6103
3906
4993
4902
5114
4100
4787
5188
3957
5088
5133
4744
4756
4359
4356
4156
4761
4049
4950
4958
5760
5323
8080
3739
4390
973
4295
4234
4270
3859
3827
3846
4813
4897
4889
4585
4542
4566
4528
4431
4460
4656
4669
4640
4646
7583
5298
5273
5405
5479
5448
5376
4315
4375
4332
4372
4301
4708
4776
4900
4915
5116
5118
4118
4114
8300
4937
4931
5034
5023
3783
3972
4724
5136
4124
4757
5007
4355
4353
4989
5150
4063
4345
4142
3928
4956
4363
5350
5321
5366
5344
7982
4730
7777
5391
6019
4271
4264
3818
3814
3864
3856
4807
4848
4826
4557
4549
4404
4476
4411
4699
4677
4648
7809
5808
5213
5261
5229
5472
5469
8202
8272
8237
4792
5914
3796
3798
5107
4115
4096
4011
5176
4320
4974
3782
4920
4021
4083
4160
5137
4188
4754
4138
4047
6933
4957
4360
4361
4053
3745
5346
4337
8120
4296
4294
4238
4286
4287
4245
3853
4844
4506
4538
4511
4584
4583
4541
4400
4475
4410
4426
4480
5203
5206
5279
5291
5245
5249
5452
5461
5480
8235
8249
5303
5334
5338
5379
4306
3907
4995
4903
5117
5198
8305
4013
5182
4979
4971
4007
5081
3933
3932
3759
4185
4132
3768
4340
4149
6006
7744
5363
4731
7333
3790
4119
4111
4292
4203
4268
4260
4222
3810
3862
3886
4808
4840
4880
4829
4560
4526
4494
4406
4430
4488
4461
4611
4670
4667
4641
5275
5232
5271
5255
5252
5257
5250
5221
5494
5476
8281
5396
5395
5377
5301
4317
4378
4374
4714
4711
4733
4994
4112
5099
4321
4977
4928
4929
4005
4084
4169
4164
4727
4721
4722
5124
4747
5002
5148
4358
4133
4940
4988
4985
4768
5154
5152
4965
4962
4383
4068
5357
5382
8004
3770
4091
4191
4999
4370
4215
4236
4223
3871
3860
3843
3841
4836
4830
4502
4519
4573
4510
4555
4543
4408
4499
4635
4609
5621
7545
6517
5215
5207
5290
5282
5281
5246
5435
5431
5466
5451
5449
8278
8261
4397
4794
3775
3774
5115
5199
4199
5172
4788
5184
5169
5055
3977
4008
4002
4080
4086
5080
4036
4749
4746
3755
3947
3941
3962
4044
4348
4144
4057
7976
8122
8328
8038
4777
5119
4256
3801
3824
4892
4894
4834
4899
4870
4852
4868
4845
4850
4823
4821
4594
4571
4582
4568
4482
4486
4467
4429
4692
4672
4666
5295
5285
5262
5268
5490
5482
8242
7775
5392
4713
4701
3793
3799
3908
5195
5181
5027
4078
4168
4720
4723
5087
3981
5139
4743
3752
4351
4982
4964
5320
5324
5364
8356
8088
8340
8144
4991
5091
4298
4225
3875
3838
4832
4833
4891
4831
4825
4517
4596
4505
4412
4455
4427
4457
4443
4678
4627
4623
4680
4621
5292
5263
5413
5407
5439
8255
8256
5394
5375
4393
4717
4795
4705
4778
3917
3912
5103
4198
8115
8109
4015
4014
3950
3951
5051
4936
5062
4728
4729
5085
5086
3935
3937
3934
4187
4750
3966
5143
4159
4767
4968
4969
4963
3763
5078
5079
3922
5356
5361
5348
5386
3771
8170
5337
4277
4237
4239
4269
4251
4243
4280
4221
3839
3844
3861
3826
4802
4862
4851
4846
4575
4579
4564
4565
4540
4414
4493
4490
4617
4696
4694
4671
4652
5272
5241
5418
5402
5410
5422
8247
8246
5307
5336
5309
5310
4318
4377
4310
3919
4916
4919
8114
8104
8101
5018
5011
8016
5175
5180
5160
5168
5033
5032
4976
5068
4926
3979
3975
4167
4725
4189
4134
4765
3765
3766
6744
3923
3748
3749
5767
5362
5343
5385
8180
8007
8001
8045
3791
3800
3821
4817
4812
4810
4860
4418
4435
4452
4468
4458
4440
4636
4662
4658
4659
5216
5219
5227
5417
5432
5471
5489
5440
5429
5441
8200
8292
4715
4798
4707
3916
3903
4914
5104
5102
8313
5017
4099
8015
4325
3958
5050
5057
3786
5065
4074
3984
3983
5130
4741
3754
3756
3942
4944
4943
4942
4981
4986
5151
4961
4046
3764
4959
4364
4362
3740
5328
5389
7986
8355
8043
8168
8161
8142
3990
3999
4790
4278
4232
4229
3812
3805
3803
3866
3850
3823
3880
3825
3820
4516
4595
4598
4550
4464
4446
4693
4637
5214
5284
5248
5251
5455
5426
8264
8286
5335
5399
4399
4732
3794
3778
4917
4909
5196
4192
8306
8301
8319
4093
5177
5174
4783
4324
4326
5045
5042
4933
5038
5035
4174
4006
5120
4030
3960
4139
4137
4980
4052
3743
5345
5347
7972
5383
8346
8165
4771
8337
4090
8019
4218
4265
4254
4267
3817
3868
3845
4835
4873
4822
4515
4593
4507
4522
4569
4413
4495
4403
4465
4604
4698
4690
4631
4649
5297
5254
5267
5280
5478
5401
5444
5446
8226
5318
4304
4712
4796
5101
4117
4196
4195
4012
8093
8098
5185
5166
5048
4023
4177
3971
4070
4075
5089
3985
4031
3750
4180
4127
3964
5146
4157
4154
4152
4131
4949
4382
4060
4140
5329
5360
5369
5384
8352
8002
4330
8173
8320
4737
5111
5390
4235
4274
4248
4247
4224
3802
3876
3873
3890
4877
4890
4864
4866
4509
4432
4463
4481
4428
4675
4630
5258
5240
5412
5433
4703
7996
3795
3776
3904
5105
8302
8194
8199
5015
5094
5058
4022
3974
4009
3986
5134
4748
4753
5009
5003
5141
5144
4043
3767
4066
3926
4369
4366
4058
8359
8357
8354
8183
8072
8172
8053
8027
8022
8031
4779
4739
4791
7990
4231
4244
4249
3816
4818
4804
4869
4574
4567
4473
4462
4423
4608
4638
4622
4626
5200
5237
5225
5438
5486
5458
5445
5450
8218
5300
4396
3918
4901
4197
5016
5095
4098
5183
5165
5049
5041
5059
5063
4025
4179
4004
4081
5127
5132
5000
5006
5140
5142
4946
4067
5070
4342
3927
4955
4952
5327
5365
7988
8085
8060
8071
8169
8171
5110
5371
4204
4266
3811
3887
4816
4838
4888
4570
4586
4487
4422
4682
4620
5264
5286
5283
5414
5408
5477
8290
8244
8229
5317
5302
5397
4308
4718
4906
5106
4113
8095
5167
4939
5123
5126
4038
3949
3944
4150
4385
4368
5341
7975
5388
8342
8175
8137
8133
8132
8058
8150
4200
4272
4233
4282
4839
4871
4861
4597
4599
4552
4409
4660
5205
5256
5498
5462
8204
8206
4700
7992
5194
8196
8106
8018
5040
5030
4923
4003
4085
4162
3939
4186
3968
5159
4960
4041
4341
4953
7979
8134
8121
8055
5331
4190
8191
4253
3878
3822
4809
4858
4859
4857
4524
4491
4444
4450
4607
5496
5404
5437
5453
5423
8216
8284
8287
8251
8221
5308
4395
4775
3772
4997
4116
8312
8108
5013
4016
5024
3788
4173
5083
4742
5147
4151
4764
4048
3769
5073
4141
8185
8063
8075
8179
8125
8152
8034
8333
4990
3899
3865
4819
4865
4419
4445
4691
4681
4689
5231
5226
5430
5465
8215
8252
8222
5398
5378
4392
4334
4336
4309
4736
3902
8100
5053
5138
5131
4037
4947
4762
4380
4062
5072
4954
4059
5325
7978
7980
7985
8067
8048
8057
8029
8339
4019
8110
4207
4208
4209
4283
4241
3837
3867
3869
4872
4853
4539
4563
4559
4580
4497
4433
4613
4697
4686
4624
4629
5217
5224
5492
5497
5488
5481
8274
8224
5316
5393
4313
4394
4305
4910
5197
8315
8336
8102
8097
8011
5162
3785
5060
5061
4166
3936
4122
3969
5004
5158
5074
3924
4054
5355
5387
8351
8184
3773
8065
8046
8131
8151
8036
8363
5191
8190
3896
4849
4592
4545
4527
4439
4471
5289
5243
5415
8219
8260
5314
4303
4307
4704
7998
3994
4102
8335
8195
4017
4784
3753
3945
5155
5071
4349
3929
3747
5367
7989
7987
7983
8006
8069
8061
8128
8054
4773
3737
3819
3879
3851
4855
4843
4553
4417
4407
4615
4663
4645
5288
5416
5457
8295
8234
8209
8239
8265
8282
8266
8253
5306
4311
4719
4918
4105
8099
4978
5026
4163
4121
5149
4352
4766
4384
4346
4147
4143
4050
3746
5359
8082
8040
8162
8130
8158
8157
8362
4252
3854
3881
4854
4886
4508
4453
5491
5470
8213
8212
8297
8276
8201
8240
8243
4996
4998
8307
8117
8193
8197
8105
5093
3952
4972
4171
3976
3961
4966
4056
5340
8081
8167
8164
8325
8051
8148
8153
8360
4210
4258
4281
4884
4421
5475
5409
8238
8233
8285
8241
3911
8096
4925
4032
4183
4365
7974
8181
8005
8068
8079
4331
8139
8126
8149
8020
8330
3858
4518
4503
4577
4588
4472
4642
5235
8298
8299
8210
8291
8271
8223
8225
5332
4373
4108
8314
8304
8334
8112
8017
3741
8350
8189
8084
8062
8049
8348
8138
8032
8331
4895
4867
4420
5294
5242
5473
5512
5541
8208
8269
5305
4312
4319
4106
8012
5036
5022
5069
4072
4389
4343
7984
8358
8188
8009
8086
8047
8041
8073
8178
8145
8028
8361
7991
4803
4520
4436
4449
5239
8250
7993
8317
8338
8103
8092
3758
4065
5342
8000
8042
8076
8341
8323
7999
4213
3895
4863
5547
2626
8207
8262
8289
8227
4702
3780
4948
5157
4951
8127
8321
8324
8146
8024
4847
4530
5443
8296
8279
8248
8280
8118
8198
5096
8014
4983
5075
5077
5381
7981
8182
8089
8087
8074
8344
8322
8056
4644
8293
8294
8263
4316
8311
8309
5025
8008
8083
8052
8140
8025
8026
8030
8010
8090
4246
4601
4610
756
8254
8192
8094
1369
1759
8044
8070
8166
8329
8159
8035
2737
980
4536
4655
5548
2508
1550
8270
4793
7994
8316
4128
2064
8186
8349
8050
8141
991
5540
2690
3409
8203
8273
8220
1405
8332
8310
3189
8077
8135
8143
8154
3119
590
8091
4841
766
5521
3270
2673
1254
8275
8259
1436
1465
5108
8303
1714
1179
8353
8003
8163
8177
8176
8155
8021
8023
3589
829
8205
8230
8258
730
8318
8013
3761
8064
8124
8147
8039
8033
3815
5536
2502
2806
1576
2479
1815
1854
8211
8113
8107
1715
1708
2900
3112
7973
2121
2154
3075
2740
8174
8136
8129
8111
979
967
755
540
5509
5539
5530
2671
2624
2526
1288
1376
3742
2059
2062
8347
619
789
5551
5520
2871
2275
3455
3425
2456
1642
1860
8214
8277
8231
8257
8228
7995
8116
1394
1319
3196
3921
7977
2040
2043
3003
1175
2157
2947
3067
1322
3722
1956
3369
1046
2190
610
831
656
742
5514
5504
3271
3541
2604
3601
2815
2805
2835
2856
2867
2847
3487
1508
8245
1472
2793
2905
5121
2728
1720
1942
1095
8160
2016
2182
890
8119
919
582
765
5515
5507
3295
3222
3599
2613
2679
3615
3672
3646
2506
2848
3401
3452
8217
8288
4758
3181
3008
2965
3384
3064
3340
1120
2780
3160
3165
3355
1366
1098
8345
849
569
760
549
5513
5534
5528
3281
3227
3572
3563
3674
2507
2533
2547
2523
2580
2274
1506
1509
1555
1660
1200
1285
1439
2716
3313
1798
1901
1112
2324
2347
1051
3153
1970
1920
1015
1076
8156
8037
689
685
686
588
5543
3542
2688
3690
3665
2577
2548
2800
2822
2237
1504
1507
1584
1621
1878
8267
8308
2735
1707
2106
1996
2320
3000
2725
1145
2124
2340
2050
2056
2956
3043
1123
2076
3079
1768
3170
2087
1097
2382
1032
2097
8327
3058
1390
971
983
950
926
921
587
625
622
5538
5522
3216
3293
3282
3287
3224
3223
3594
3552
2611
2680
2543
2845
2841
2239
3430
3448
2409
1234
1823
1828
1401
2375
2700
2703
2709
1379
2904
3109
3014
1740
2036
2942
3060
3063
3066
1969
1962
1359
1351
2141
2143
2984
3171
2788
3168
3122
1921
3080
3089
8123
2790
779
853
927
725
787
566
647
651
5518
5511
5501
5537
3213
3296
3577
3531
3528
2618
2682
2687
2650
3696
3664
3686
3643
2576
2898
2821
2200
2216
2241
3427
3440
1583
2467
1635
1676
1641
1297
1243
1816
1813
1806
1882
823
8236
1475
1443
1449
1446
1420
7997
2316
2318
2395
1705
2908
3101
1118
3180
2049
1024
3380
3383
3382
2005
2004
2052
2953
3039
3037
3033
3023
3077
1166
2932
1783
3723
3141
3144
1158
2366
1777
3730
3090
3091
531
819
937
724
782
758
524
5549
3289
3240
3243
3576
3590
3564
3548
3558
3569
2674
2623
3638
3691
3681
3625
2560
2524
2881
2297
2287
2222
2225
1578
1590
1570
1565
1542
1547
1524
1540
2408
2439
2465
1614
1681
1629
1620
1237
1836
1879
1824
1497
2336
2712
2915
2913
3108
2113
1917
1902
3184
2329
1025
2960
2969
1178
2127
2006
1741
2959
2945
2065
2170
3034
2757
3133
1169
1782
3728
3125
2084
1758
1035
1934
1044
8059
2791
2090
710
861
857
930
963
780
543
559
5532
3244
3250
3511
3571
2677
2659
2627
3614
2552
2876
2879
2887
2231
2286
3432
3431
3456
3481
1581
2410
1611
1677
1235
1238
1268
1259
1894
1899
1848
827
8232
1478
1499
1424
3702
3733
2309
1374
1377
1776
2907
3104
2116
1117
3095
2328
3006
2723
1149
1746
1966
3021
2754
2078
3157
1765
1084
1955
2988
1099
1005
1002
1931
1042
2094
3326
1339
1019
2091
3370
946
684
5517
5535
3204
3272
3262
3263
3517
3595
3506
3579
3556
3580
2617
2612
2636
2630
2662
3617
3606
3670
3642
3647
2598
2804
2811
2863
2889
2823
2295
2251
3402
3484
1514
1536
1522
1543
2419
2473
2431
2454
1678
1687
1657
1653
1202
1239
1231
1257
1897
1835
1885
1858
1435
3713
3710
2315
2307
2335
2706
1313
2995
3114
3098
3187
2045
2027
3007
1028
2129
3386
2943
2178
2175
3030
3049
1961
1054
2752
2149
2079
3073
1325
1725
3158
3151
2936
2748
1087
2982
3163
1948
2767
2138
3352
2359
1038
3140
1139
1136
1773
3019
3111
811
860
911
681
589
581
652
768
744
527
526
541
5505
5527
3274
3299
3269
3221
3596
3538
3570
3523
2664
2661
2667
2646
3616
3678
3619
3652
2512
2501
2531
2555
2559
2802
2874
2852
2857
2843
2245
2250
2240
3400
3462
3460
1564
2490
1609
1662
1656
1213
1292
1210
1266
1240
1875
1838
1810
1863
1849
1437
1491
1456
1458
1429
2300
2394
2303
1396
1712
2997
2104
1905
1908
1910
1114
3092
3185
2028
2968
2344
2179
3041
3046
1356
2751
2140
3137
1954
1946
1973
3124
2134
2136
3357
3088
3083
1092
1752
2162
3365
1007
2972
1730
1999
739
987
947
580
585
663
5506
5542
3215
3298
3234
3209
3239
3285
3513
3503
3535
3566
3587
3553
2694
2637
2652
2640
3603
3631
3685
3657
3650
2594
2575
2570
2832
2860
2207
2276
2272
2256
2223
3419
3488
3450
1598
1529
2405
2498
2484
2468
2445
2427
1672
1665
1663
1204
1232
1236
1264
1831
1852
1844
1867
1857
1853
1840
1432
1462
1467
1440
1425
631
3718
2313
2314
2305
2372
2715
2707
3318
3396
3332
1305
1716
1702
1774
1732
2917
2994
3103
2192
2108
1993
1995
1113
1106
3186
2020
2023
3009
2729
1026
1022
2961
1147
2123
3388
2345
2152
2039
2944
3029
1121
2077
1329
3130
1764
3720
2980
3164
1976
2766
3358
2350
2358
2383
1071
2018
2095
1346
2970
2971
2187
3055
1771
1739
2119
2110
2990
2391
3390
537
799
863
981
788
786
561
753
643
627
523
553
5516
5544
5525
3288
3260
3247
3259
3229
3512
3593
3509
3573
3537
3582
2685
2686
2657
2628
2621
3660
3661
3669
3623
2500
2517
2515
2509
2568
2566
2810
2842
2824
2851
2293
2235
2232
2201
2270
2264
3416
3413
3493
3482
3424
1501
1573
1585
1582
1561
1563
2476
2472
2477
2429
1600
1692
1679
1664
1645
1647
1626
1628
1296
1271
1263
1247
1877
1864
1415
1495
1444
1427
1441
3716
3715
2378
2310
3379
1318
1378
1334
1301
1719
2998
2901
3192
3198
1104
3188
2327
2041
2024
1172
2009
2002
1058
2759
2072
1321
1161
1762
2745
2744
1952
3178
2781
3161
1971
2135
3359
2351
1180
2977
1330
1190
699
801
810
879
851
909
687
562
669
650
545
5503
3297
3284
3226
3241
3502
3588
3545
2695
2603
2606
2681
2649
3682
3662
2513
2535
2599
2573
2537
2554
2816
2808
2233
2255
2269
2280
2221
3418
3496
3495
3494
3461
3480
3449
1532
1588
2478
2491
2464
2469
1618
1631
1299
1279
1245
1227
1220
1805
1872
1801
1871
1841
824
1417
1490
1481
1428
771
3706
2704
2701
3316
3375
1399
1792
1703
1736
3193
2117
2193
1916
1992
1192
3016
2022
2966
1173
1141
1143
2008
2159
2156
2057
2053
2941
3341
3045
1963
3022
2073
1326
3136
1729
1763
1780
1951
3121
2088
1364
2389
1187
2166
1079
3362
1388
1386
1983
1982
2180
2777
3331
1119
1090
809
871
881
843
943
720
560
5545
3212
3218
3242
3266
3220
3504
3536
3539
3561
3527
2699
3639
3671
3663
3653
3649
3620
2572
2510
2539
2895
2864
2215
2206
2299
2285
2267
3436
3473
3463
3467
3447
3421
1575
1572
1579
1539
1558
2412
2496
2411
2499
2426
1608
1632
1684
1686
1661
1627
1651
1208
1290
1242
1260
1251
1896
1832
1861
1889
1464
1461
1451
2379
2713
2718
2708
2732
1393
1311
1373
1775
1709
2996
2902
2910
3107
1912
1904
1101
3011
3183
2048
2029
3004
2720
1020
1021
1174
1142
2051
2952
2037
2060
3347
3024
1059
1357
3134
3154
2939
1085
1787
2926
1944
2130
2139
2133
1363
1096
1014
1750
2165
1938
1937
2099
3051
1791
539
691
999
990
960
721
658
763
528
529
542
5502
5510
5531
5552
3207
3275
3232
3277
3291
3268
3534
3591
3584
3586
3547
3551
3549
2600
2696
2697
2678
2675
2619
2691
2643
3609
3683
2593
2595
2597
2532
2536
2556
2541
2521
2888
2853
2849
2213
2202
2238
2219
2281
2224
3445
3453
3428
1512
1502
1511
1531
1556
1552
1553
1551
1520
2418
2475
2434
2457
1691
1273
1291
1255
1256
1252
1287
1246
1893
1839
1868
1887
1851
1400
1498
1430
2392
2393
2397
2377
2373
2738
3305
3376
1314
1335
1375
1372
1309
1700
1738
3116
3117
3113
2105
1919
3015
3018
3094
3182
1170
1148
1144
2000
2153
1743
3068
2063
3342
2171
1053
1052
1355
1167
3152
2935
2741
1080
1088
1081
1785
1781
1784
3726
2989
2921
2924
2782
1924
2085
2086
3353
1064
1753
2384
1181
1183
1037
1138
1930
1045
1043
1159
1154
1987
1349
1341
1337
1331
2771
2331
2731
1790
2371
599
601
637
639
719
846
910
688
668
759
752
646
655
544
557
5550
3206
3219
3251
3578
3574
3554
3546
3521
2607
2658
2645
3607
3679
3637
3656
3648
3658
3628
2538
2586
2583
2877
2890
2882
2866
2883
2820
2217
2218
2204
2279
2265
2242
2253
3417
3498
3475
3433
3410
3420
1592
1503
1586
1587
1545
1589
2403
2444
2483
2480
2446
1617
1613
1694
1606
1673
1682
1652
1654
1623
1216
1293
1295
1222
1241
1800
1847
1416
1402
1406
1433
1470
1463
1487
1450
2338
2734
2799
2710
3304
3374
3377
1395
1397
1332
1797
1701
2914
2992
2903
2906
2102
1907
1115
1196
1194
1105
1107
2325
2323
2021
3001
2727
2724
2964
2125
2122
2058
1748
2068
3345
2172
3044
3020
3026
1128
1056
1350
1358
1320
1168
3156
1083
2987
2787
1977
2762
3128
3127
3123
2080
2355
2357
2352
1068
1013
1754
2388
2160
1134
1932
2012
2092
1340
1343
3328
2973
3050
3731
2770
2330
2339
591
709
970
940
923
929
949
729
727
563
660
657
764
620
621
623
747
547
3294
3238
3267
3225
3500
3505
3532
3519
3585
3555
3544
3583
2614
2692
2605
2638
2669
3612
3692
3693
3695
3608
3635
3676
3632
3684
3688
3640
3621
2585
2542
2584
2562
2549
2875
2899
2801
2873
2865
2854
2829
2298
2208
2278
2244
2263
2259
3435
3472
3411
3437
3442
3458
3469
3443
1515
1513
1594
1535
1510
1537
1544
1526
1528
2404
2438
2437
2430
2451
1616
1696
1603
1607
1675
1622
1669
1680
1205
1203
1298
1284
1269
1803
1834
1811
1890
1827
1850
1413
1492
1493
1419
1431
1459
1483
671
2306
2711
2719
3315
3397
1734
3115
3118
2118
1915
3017
3093
2722
1146
2126
3389
2054
1744
2954
2030
2031
3047
3028
1129
1353
2147
2144
3138
1726
2930
2983
1943
1974
1926
1360
1066
1078
3368
1933
1047
2096
2011
1381
1383
2369
2365
1779
2333
2111
2991
3010
3371
847
683
682
726
722
661
653
745
550
555
5519
5529
3278
3235
3201
3273
3518
3530
3581
3526
2615
2610
2631
2665
2653
3602
3697
3644
2574
2571
2582
2544
2563
2567
2528
2812
2807
2819
2830
2855
2862
2844
2869
2826
2203
2236
2273
2210
2290
2252
3415
3414
3497
3478
3434
3423
3429
3446
1597
1527
2497
2482
2443
2449
1602
1697
1644
1667
1659
1625
1646
1276
1277
1230
1289
1223
1229
1221
1833
1837
1842
1881
828
1418
1414
1403
1411
1484
1422
2398
2319
2797
3312
1706
2918
3195
3102
2194
2101
1906
1195
2046
2026
1749
1742
2955
2034
3062
3343
2174
3038
1126
1354
2756
2146
2070
2071
3072
3159
3155
2938
2746
2985
2783
1940
2760
2768
1927
3085
1189
2168
2167
3148
3145
3364
3363
1935
1041
2013
2368
1980
3323
3330
1731
1110
1391
3190
611
790
899
859
939
961
957
928
941
783
568
741
556
5508
5526
3208
3255
3245
3507
3508
3575
3533
3562
2693
2651
3611
3677
3633
3668
3629
3641
2579
2553
2837
2891
2870
2831
2858
2296
2262
2227
2228
3406
3408
3477
3468
3454
3486
3489
3459
1516
1517
1595
1530
1569
1557
1521
2414
2470
2422
2450
2440
2423
2425
2428
2421
1634
1670
1218
1294
1262
1286
1250
1225
1812
1818
1873
1862
1843
1829
1454
1426
3700
3708
3719
2302
2717
2774
3317
3335
3336
1300
1312
1711
1799
1998
1103
3013
2321
2326
2042
2721
2967
1171
1140
3387
2348
2341
2949
3344
1967
3027
2142
3078
1328
3132
1721
1724
1722
3725
3177
3167
1928
1929
3351
3087
3081
3084
3086
1060
1094
2387
1185
2161
2164
1033
1036
3147
1070
1006
1151
1384
2364
1347
3327
2978
2183
3337
1010
2019
701
737
931
586
567
641
654
629
743
525
5523
5546
3292
3205
3265
3254
3283
3515
3592
3560
2602
2668
2660
3694
3654
3659
2511
2565
2522
2550
2520
2817
2892
2803
2839
2868
2861
2234
2271
2268
2258
2283
2246
3403
3438
3479
3464
3465
3485
1500
1596
1577
1567
1549
2417
2407
2488
2487
2420
1693
1604
1674
1638
1690
1650
1207
1211
1244
1249
1808
1891
1884
820
1407
1477
1473
1442
1468
1460
670
2317
2705
2778
2775
3308
3378
3372
3301
1316
1336
1718
1793
1735
2993
3100
2100
1109
3002
2128
2957
2038
2035
3069
3348
2176
3032
3042
1125
1050
2753
1324
1728
1727
1723
1164
3150
1766
2749
2747
1789
2986
3179
2786
1949
1941
2765
2081
1065
1757
2169
1072
3361
1137
1132
1157
1389
1387
1988
1981
3321
3322
2189
3339
1191
1370
3191
609
869
841
989
662
754
649
644
769
767
626
551
5500
5533
3230
3231
3252
3249
3559
2634
2670
2647
2620
3613
3699
3667
3651
2592
2564
2588
2589
2540
2813
2818
2897
2211
2289
3491
1538
1554
2400
2492
2402
2432
2466
2486
2460
2489
1615
1636
1637
1671
1685
1668
1689
1643
1274
1272
1261
1228
1898
1807
1855
1822
826
1476
1474
1409
1471
1453
3732
3701
2396
2301
2736
3300
3309
1713
1794
2911
2103
1913
1914
1100
1197
1198
3097
3099
2025
3385
3381
2007
2343
2346
2155
2940
3349
2173
3035
1968
1124
1352
2750
2145
2074
3070
1160
1767
3727
3724
2929
2925
2923
3162
1947
1365
1755
2163
3149
1130
1133
1152
2098
1986
3324
2976
2191
2390
839
891
889
920
723
781
584
564
642
558
552
5524
3290
3264
3567
3524
3557
3540
3520
2609
2622
3610
3655
3666
2518
2569
2551
2834
2833
2886
2214
2230
2229
2220
3405
3474
3499
3490
1523
1546
2493
1639
1655
1688
1649
1206
1270
1226
1874
1830
1866
1883
821
1494
1455
1452
1448
1445
731
2308
2796
3392
3393
3303
3399
3310
1315
1398
1308
1733
3197
3199
2109
1116
1108
3012
2047
2726
1023
1177
2150
2950
2032
2946
3036
1057
2758
2148
1760
2934
1082
3721
1959
2928
2769
2763
3129
3126
1925
2353
1093
1011
1751
2385
1182
3146
3367
1048
2184
1770
2773
3333
2730
1990
1371
2370
579
690
791
850
969
925
565
3237
3258
3261
3257
3280
3598
3501
3522
3529
2608
2656
2644
2625
2641
3618
3675
3636
3630
3680
2590
2529
2893
2894
2884
2840
2880
2828
2846
2209
2257
2226
3483
3451
3426
1593
1574
1548
1559
2416
2494
2442
2462
2452
2447
1698
1278
1201
1219
1267
1253
1821
825
822
1479
1486
1423
570
571
3711
2312
2334
2399
2792
1317
1304
1796
2912
2909
3105
2196
1997
1911
2044
1027
2963
2349
2958
2951
3061
2177
3025
2075
1162
1769
1953
3172
2920
2927
2789
1945
1923
1368
2356
2381
1030
1034
1009
1153
2361
1985
1984
1344
1342
3329
3057
2779
2337
530
711
830
680
665
667
666
750
757
751
648
762
628
748
749
746
546
554
3214
3256
3253
3228
3246
3565
2639
2655
2654
2663
2683
3645
2503
2578
2557
2850
2205
2284
2288
2266
1518
1566
2436
2471
2481
2424
1633
1683
1217
1248
1892
1802
1819
1886
1880
3712
3703
3707
2714
2794
2772
3398
1772
2919
2115
2197
1900
1918
1102
2962
2003
1745
2033
2067
3040
1964
2755
3074
3135
2937
2931
2933
1975
1361
1062
1018
1186
1135
1131
1001
1936
2014
2362
1989
1345
2979
3059
3054
3110
880
901
728
640
659
522
548
3202
3276
3236
3233
3525
2672
2666
2689
3600
3605
3698
3673
3626
2545
2291
2249
3422
1591
2415
2433
2459
1695
1605
1619
1610
1666
1275
1817
1804
1820
1412
1404
1466
770
3717
3704
2332
3395
3302
1303
1704
2195
2322
1176
1965
1327
1323
3131
2743
2981
3175
1972
2761
2764
1922
3356
1367
1756
1003
1156
1380
2367
2188
1737
2999
887
840
785
645
3200
3203
3211
3210
3279
2632
2633
3604
3622
3627
2504
2534
2519
2546
2809
2827
2294
2277
2248
2260
2247
3412
3476
3470
3466
3444
1505
1519
1580
1525
2495
2401
2485
2458
1215
1281
1865
1856
1408
1438
1489
3714
2376
1392
1306
1338
1710
2112
2107
2199
1903
1909
1029
2120
2001
1747
3346
1165
2742
1089
1788
1950
1958
3174
2785
3169
2131
1069
1061
1063
1188
1348
3325
2974
1333
2010
959
953
784
583
761
624
521
3286
3597
2642
2558
2896
2872
2825
3492
3457
1534
2474
2461
1630
1624
1233
1258
1224
1809
1869
1434
1410
1447
630
3705
3709
2702
3311
1302
1778
2158
2069
3076
3176
2132
3350
3354
1362
1067
1017
2386
1000
1008
1004
2739
679
837
883
664
3550
2616
2676
3634
3624
2530
2525
2838
2859
2292
1533
2413
2448
2463
1601
1658
1640
1895
1826
1488
1469
2798
2733
3394
3338
1795
1199
3005
3048
1960
1122
1086
2922
3120
2082
1039
1031
3142
3366
1155
2017
2360
3543
2698
2591
2561
2814
2212
2261
2243
1560
2406
2435
2455
2441
1612
1699
1212
1214
1283
1280
1870
1859
1825
1846
2795
2776
3334
2342
2055
2061
1127
1055
1957
1978
1979
2089
1016
1184
3320
2181
3056
867
3510
2635
2648
2629
3689
2596
2514
2505
2885
2282
2254
1599
1265
1814
1876
1457
1421
2311
3373
1310
1717
3106
2114
2948
3071
3139
3166
2354
1040
2093
2363
1111
1991
740
3248
3687
2587
2878
3407
3439
3471
3441
1648
1496
1482
1480
2304
3314
3306
3065
1786
3729
2083
1077
1074
1073
1385
2185
3391
3217
3568
2601
2527
2836
1568
1209
1888
1845
2374
3307
2916
1193
2784
1075
1939
2015
1091
2581
1571
1562
1485
2198
3031
3173
2137
3082
1150
1382
2975
1541
1012
3143
1049
2186
3516
3514
2684
2516
3096
2066
951
2453
1282
3319
3194
2151
1163
3360
9869
3404
870
2380
3052
9608
1761
3053
8367
9196
1307
8898
1994
8557
9751
8979
9400
8406
9419
9685
9996
8943
9644
9561
8730
8376
9260
8494
8497
9476
8800
9703
9336
9349
9021
8624
9991
9267
8492
8463
9493
9499
9548
9816
8593
8504
8537
9631
8695
9798
9360
8428
9023
9822
9177
8935
8748
8728
9846
8541
9861
9777
8453
8860
9294
8431
9448
8832
9516
9839
9871
9605
9664
8630
9704
9774
9772
9711
9314
9197
9015
9012
9157
8959
9741
9859
9035
8644
9821
9172
9946
9843
9625
8445
8447
8887
9545
8568
8459
9211
8401
8467
9412
9414
9471
8815
8802
8577
9695
9717
8708
8775
8774
9315
9372
9916
9918
9118
8944
9134
9645
9934
9724
9723
9365
8425
9045
9927
9926
9655
8754
9782
9849
9161
9971
8543
9544
8779
8394
9215
9258
8417
8465
8460
9404
9409
8808
8872
9508
9575
9591
9805
8514
9615
9609
9670
8677
8637
8702
8705
8776
9100
8994
8998
9096
8859
8973
9855
9421
9147
9229
9226
9004
9326
8525
8744
9785
8765
8825
9986
8480
9563
8667
9667
8580
8791
9212
9298
9276
9219
9254
9281
9269
8400
8407
8499
8477
8409
8419
8482
9496
9406
9491
9465
9455
8816
8893
8876
8834
8890
8871
8864
9500
9595
9578
9534
9536
9579
9571
9894
8535
8536
8510
9604
8617
8612
8618
8604
8674
8699
9712
9702
9705
9708
8796
8714
8738
8733
8710
9374
8365
8364
8941
8388
8852
9159
9152
9133
9755
8976
9850
9856
9428
9425
9968
9520
9525
9526
8929
9220
9346
9039
8627
8626
9006
8520
9651
8781
8969
8840
8847
9541
9889
8481
9771
9773
9483
9663
9090
8396
8373
9275
9210
9262
8418
8456
9492
9478
9466
9463
9503
9588
9896
9803
9875
9832
9865
9884
8505
8565
9697
9635
9673
8614
9716
9715
9796
9392
9302
9379
9900
9911
8903
9016
8945
8387
8386
8858
8854
8853
9555
9551
8957
8953
9649
8971
9088
9930
9361
8924
9141
9146
9222
9345
9341
8646
9173
9000
9657
9652
9359
9841
8849
8843
9075
8444
8446
8567
9779
8680
9339
8581
8390
9091
8377
9296
9299
9277
9230
9231
9265
9266
9286
9247
9259
8495
8436
8485
9417
9473
9485
9452
9468
8895
8807
8835
9511
9599
9537
9817
9814
9899
9877
9868
8516
8512
8578
8591
9698
9691
9630
8605
8608
8619
8668
9795
8795
8736
9313
9312
9394
9309
9995
9906
9909
9199
8902
8905
8901
8910
9098
8555
8554
9154
9750
9553
9556
8978
9748
9427
9960
9969
9964
9089
9085
9082
9524
9522
9932
9727
8925
9347
9049
9022
9170
9922
8933
9324
8652
9654
8758
8783
9988
9769
9380
9628
9160
9978
9977
8546
8886
9449
9447
8487
8483
8450
9246
9589
8991
8990
9791
9019
8392
8375
9292
9207
9235
9282
9255
9256
9261
8414
8435
8476
8475
8432
9438
9411
9484
9458
8814
8875
8877
8830
9594
9598
9535
9538
9509
9530
9800
9813
9812
9893
9811
9819
9866
8502
8538
8511
8590
9607
9672
9610
9665
8692
8678
8684
8715
8712
8706
8734
9398
9308
9108
8907
9093
8369
8366
9150
9138
9131
8955
9648
8970
9740
9749
9745
9429
9961
9528
9931
9936
9721
9369
8927
9140
8429
8422
8649
9179
9925
9009
8934
8650
9954
9953
9956
8750
8788
8967
9789
8760
8769
9981
9064
9624
9129
8986
8841
9186
9073
8888
9543
8486
9567
8663
8457
8451
9480
9249
9587
9391
9204
9297
9278
9209
9271
9288
9287
8493
8478
8434
8490
8469
9495
9498
9475
9432
9472
9467
8892
8894
8838
8833
8831
9593
9539
9542
9818
9804
9878
9872
9801
9809
8509
8539
8570
8582
8542
8588
8586
9616
9603
9634
9679
8616
8607
8635
8671
9718
9707
9734
9738
8700
8797
8732
8799
9316
9305
9306
9377
9917
9914
9993
9905
9105
9103
8917
8993
9013
8949
8550
8552
8382
8851
9158
9151
9130
9132
9757
9554
9744
9852
9420
9965
9962
9084
9529
9720
9729
9364
9362
8926
9227
9034
8643
9029
9025
9829
9175
9923
9328
8653
8529
8741
9659
8726
8780
9940
9941
9944
9943
9354
9352
8767
8764
9985
9844
9760
9060
9069
9061
9626
9120
9128
9125
9127
8981
9181
9071
9976
9445
9880
9887
8489
8566
9863
9770
8681
9686
8777
9661
8589
8583
9459
9790
9990
9390
8397
8374
9216
9295
9233
9290
9270
9253
8415
8402
8405
8474
8410
8462
8454
9402
9442
8812
8896
8804
8805
8879
8865
8862
9513
9532
9510
9564
9815
9807
9876
9870
9842
8500
8592
8574
8532
8573
8579
9614
9678
9676
9675
9677
9619
8694
8603
8638
8673
8690
8688
9794
9701
9710
8793
8735
8711
9378
9335
9913
9902
8912
8909
8919
9099
8948
8551
8556
8380
8385
9135
9136
9759
9754
9558
9557
8958
8954
9647
9747
9743
9426
9963
9080
9087
9081
9935
9725
8920
9142
9344
9342
9030
9036
8427
8424
8423
8642
9041
9042
9820
9827
9007
9001
8938
9323
8656
8528
8521
8526
8743
9957
9951
8756
8723
9948
9945
9357
8827
8824
8823
9768
9762
9389
9387
9629
8980
9163
9185
9072
8440
9974
9057
9052
8880
9440
9886
8560
9867
9681
9331
9333
8737
9451
8370
9010
9111
9213
9293
9232
9234
9272
9201
9284
9252
9245
8412
8403
8408
8479
8488
8468
8466
9416
9407
9433
9479
9470
9482
9456
9460
9461
8897
8819
8870
8882
8868
9515
9502
9505
9519
9582
9562
9895
9897
9806
9890
8518
8503
8576
8575
8534
8599
8501
8519
9617
9611
9690
8600
8613
8606
8631
8664
9793
9778
9735
9776
8716
8778
9300
9307
9373
9907
9901
9113
9112
9192
9193
8995
8997
8908
9014
9095
8946
8942
8389
8384
8857
9137
8952
9646
8974
9851
9854
9853
9527
9933
8923
9148
9149
9221
9224
8648
9048
9044
9823
9924
8621
8937
8931
9320
9321
9322
8657
8651
8759
8752
8727
8722
8789
9942
9353
8965
8961
9780
8763
8762
9983
9065
9067
9385
9381
9621
8985
8983
9166
9188
9182
9079
9053
8881
9560
9481
9486
9680
8731
8770
9583
9999
9371
8393
8372
8399
9217
9206
9236
9291
9264
9285
9268
9289
9283
9250
9251
8498
8437
8439
8491
8471
8452
8448
8461
9413
9418
9403
9439
8817
8818
8809
8810
8884
9596
9504
9597
9506
9572
9577
9533
9573
9565
9585
9802
9874
9830
9864
9882
8515
8595
9694
9682
9662
9668
8615
8697
8676
8675
8685
9714
9775
9733
8718
8703
8707
9376
9311
9912
9994
9998
9104
9102
9101
9109
8913
8918
8992
8906
8911
8368
8558
8559
8553
8856
9155
9640
9643
9742
9423
9521
9938
9722
9368
9367
9363
8922
9037
9031
9033
8420
8421
8640
8645
9040
9043
9028
9825
9178
9171
9920
8620
8628
8625
8623
9002
8939
8932
9329
8658
8659
8740
8745
9650
8785
9350
8964
8963
8962
9788
9781
8826
9121
8989
8987
9165
8848
8845
9070
9076
9058
9540
9883
8563
9860
8660
8683
8686
8869
8861
8739
9240
9739
9737
8391
8999
9190
9119
8378
9200
9238
9279
9237
9242
8413
8404
8470
8442
8458
9494
9474
9434
8836
8811
8873
8839
8842
9512
9586
9836
9862
8513
8597
8572
8571
8530
8564
8585
8584
9639
8693
8698
8634
8610
8679
8670
8682
9792
9706
9709
8792
8704
9317
9338
9399
9915
9997
9903
9910
9116
8904
8855
9156
9139
9758
9756
9550
8950
9642
9857
9424
9086
9523
8928
9143
9348
8426
8641
9047
9020
8527
8524
8747
8746
9950
9952
9653
8757
8720
8729
8725
9949
8966
8820
9848
9847
9765
9767
9761
9764
9766
9384
9622
9184
8449
9970
9050
8549
8544
8883
9546
9444
9443
8561
8689
9689
9243
9580
9218
8496
8430
8484
9497
9401
9462
8813
8803
8837
9501
9570
9808
9833
9879
8507
8531
9613
9602
9601
9671
9688
8601
8691
8665
9732
9799
9719
8794
9318
9310
9908
9198
8900
8916
8914
9017
8381
8383
8951
8977
9967
9728
8921
9144
9225
9223
9340
9343
9032
9024
9008
9005
8655
9955
8721
8786
8782
9358
9355
8960
9786
8766
8821
9980
9982
9845
9066
9062
9386
9623
9126
9122
8988
8984
9162
9077
9059
8545
8547
9446
9881
8569
8867
9687
9330
8771
8773
9457
9453
8790
8371
8395
9203
9208
9248
9244
9257
9280
8438
8433
8473
8464
9415
9435
9436
9437
9490
9430
9454
9469
8878
8874
8899
8885
9517
9592
9574
9590
9584
9898
9834
9891
9885
8598
8548
9612
9692
9632
9636
9633
9684
8602
8672
8611
9713
9797
9303
9332
9301
9904
9117
9114
9195
9194
9107
8915
9092
9094
8940
8947
9153
9752
8956
9641
8975
9858
9966
9083
9937
9726
9228
8647
9027
9828
9826
9174
9928
9929
9921
8629
8936
9325
9327
8749
9958
8751
8753
8784
9787
9784
8828
8829
9984
9840
9388
9382
9124
8982
9168
9164
8846
8441
9055
9056
9888
8661
9683
9337
9241
9660
8379
9239
9263
8411
8455
9405
9431
8891
8866
9514
9507
9835
8517
9600
9618
9638
8609
8662
9700
8717
8713
8798
9396
9393
9397
9319
9115
9106
8996
9097
8850
9559
9746
9422
9939
9145
9038
9026
9824
8622
8930
8522
8755
8724
9356
9783
8761
9989
9627
9189
9183
9566
8669
9487
9730
9191
9214
9202
9205
9274
8416
9477
9464
8806
9518
9576
9831
8594
8562
9674
9699
9637
8633
8639
9736
8709
9304
9753
8972
9366
9046
9003
8654
9658
8968
8768
9987
9068
9063
9180
9187
9972
9054
9547
8666
8687
8587
8398
9273
8472
9408
9838
9810
8506
8696
8772
8701
8719
9375
9334
9992
9919
9552
9176
8523
9959
9947
9620
9123
9074
8443
9979
9975
9973
9051
8889
9441
9569
9669
9731
9370
8801
8533
9696
9693
9606
9018
9011
8787
9351
8822
9169
8844
9078
9581
9110
9410
9488
8508
8632
8636
8742
9763
9383
9549
9568
9450
9531
9873
9837
8596
9656
9167
8863
9892
9395
9666
8540
9489
