4120
9327
7283
2291
1783
9645
732
7096
1521
2922
3048
2894
6940
4992
9905
9862
1667
3435
8083
258
3422
4153
1694
1787
4972
4243
3062
3543
771
2977
299
9246
5393
8712
8686
5528
9899
3712
5245
9929
9718
7024
1653
865
2999
6276
5592
4046
3100
4591
2403
8425
4569
8637
4175
1363
9450
1795
89
7246
7862
3717
4252
954
4211
1125
6499
3215
5680
3299
4104
8835
5218
8505
2602
3267
906
8230
4748
3668
1298
446
7157
2954
1986
6958
4108
8807
2094
6902
172
6379
1560
6956
2232
1883
2582
2074
1745
5382
7163
9514
9470
8810
2490
6030
1346
1606
5869
8809
7490
8919
8542
5064
4435
8829
5845
7456
3918
3365
1439
1587
8510
7589
3910
4471
3280
7023
6583
3045
208
2310
4829
4653
245
601
6678
3982
4608
3151
3905
4322
8994
3362
9689
5160
4715
2796
4669
3404
9976
656
64
7911
6912
3558
2055
5128
6018
6003
7410
4810
5464
1808
2687
6719
1477
8447
3492
2456
7104
9672
4083
3097
2561
9326
2482
8857
2986
3275
4209
3930
2498
8741
8203
6523
2642
9119
8554
6995
2107
4053
411
943
7613
6992
8527
5079
9781
3567
2430
714
1611
5034
2365
821
9161
204
5215
7977
9307
1952
6981
3694
7339
7560
9739
2951
7198
4962
2907
9819
7986
930
1835
9229
8682
3573
6196
7169
7822
9424
9120
1859
8212
9956
7316
2083
3633
9771
7388
6577
847
7130
1744
2364
5157
9204
7991
2883
451
4208
1354
5825
3070
700
1288
8084
9510
8817
8178
7235
2785
7771
1171
2440
4447
7392
6711
4499
4777
6635
8779
2806
4043
8972
1976
543
3296
798
4331
1080
9218
5538
2693
9652
1340
2408
9256
6448
5628
2899
6377
689
4169
4136
9684
4552
1675
8163
7749
8985
8039
5514
8948
8598
716
9626
697
6763
742
2795
4483
8591
1473
e
7099
5620
3826
2535
9370
3066
7695
6286
6885
4904
7557
6845
7958
9745
2380
2500
6703
9035
3104
1039
508
7383
2179
5277
2424
2933
69
365
3723
3429
3328
6582
754
5264
3758
##n
6716
5105
8923
1912
2129
5237
663
4373
5244
8864
1206
3619
3639
626
4546
3875
9142
484
42
7336
9945
9698
6487
2515
8873
459
8926
8261
8333
9250
1821
531
9136
1699
2901
2176
7155
2088
5155
7054
2282
5044
1303
873
7066
4531
1814
178
4658
1370
6762
1544
1798
3914
634
1101
5161
9532
6662
7892
1531
5850
3863
4033
2763
2214
8651
8323
2085
1074
1840
9024
4309
360
4888
5482
9794
4987
4297
6650
4966
2973
2101
8536
1995
6289
=
7125
653
8912
4091
4500
3008
1100
1639
3411
5539
9292
6797
5388
1593
5223
5474
5907
1190
3281
1731
2200
1981
372
4779
9892
8934
5354
1944
4988
7874
192
8219
9918
5994
5930
7184
5062
9397
3437
5853
1563
4677
1124
8493
9067
3852
4414
9733
3506
897
2506
4799
5952
8032
9497
5350
1586
7927
1418
7366
237
7122
5828
3615
3498
1895
7285
5444
2638
9560
7098
7830
9002
1860
f
4292
3463
7107
8567
431
3378
3385
6722
9683
3068
9484
7920
1936
1955
9591
7543
3263
8397
7464
2166
5632
3582
7478
8274
6687
4386
6904
8790
3491
9699
6692
3812
6330
3983
2068
1285
1628
7057
893
9619
674
5015
8842
6580
8089
8426
3355
4699
862
2272
4394
765
2372
7849
1854
3173
7019
5529
94
1740
403
8200
9069
8556
7758
924
8572
9037
7089
9392
5216
7941
8578
9845
867
4134
6808
4706
661
2181
8492
3793
4901
9580
1065
4929
1803
5906
2768
7524
4228
5377
8626
861
1110
9550
3452
5456
9835
3729
4868
9453
9457
479
9466
554
5330
4693
9076
6469
3960
8134
9752
3432
3550
6488
1772
5461
9847
17
9071
8959
4454
3664
3569
710
153
1
4766
7110
3620
3486
4804
2616
4519
5329
9562
8954
6132
3637
4089
1058
9288
9971
9377
1514
836
6183
5730
4375
4431
8270
7673
6137
4453
8291
2562
6538
869
8710
350
3765
9378
5686
6306
5732
7199
4442
7453
323
6295
8280
4583
795
6435
9843
8479
4961
8275
9263
6857
1151
6795
353
6369
530
2098
586
3029
5535
7924
6759
1797
9898
5318
1123
5904
7863
7518
8091
699
4301
7777
8746
491
6404
8607
6721
8115
2262
2895
2294
2323
4349
6318
##fo
2821
1017
6243
8517
5705
3725
2117
3686
4320
967
5770
792
437
2751
2191
4650
7025
3936
9262
9613
3077
8916
9223
76
2340
4214
1188
5886
4194
7081
414
6437
486
6566
2134
3327
4020
7188
9838
6114
1557
4998
5505
174
3653
2407
8837
4995
6898
1481
8641
3527
9012
2587
4780
2039
5762
4262
7053
4825
6364
6849
9612
1662
9314
6640
2702
4545
1311
5130
5424
8410
7058
5685
1006
1534
9276
154
3902
9182
7502
7401
261
231
2023
5294
3075
3311
1163
6302
4557
8240
9496
3830
5661
6631
9079
1916
8683
3290
7109
9643
5028
2217
3428
9087
4350
9584
3240
7461
5682
1876
4664
7750
6250
2252
6186
8752
7093
6208
6652
6017
5475
6358
5383
3396
5926
4323
5711
1626
3446
8191
2104
5194
5026
4059
3883
5490
9436
1252
4696
2749
337
2671
3773
7736
6985
3196
8694
7523
2080
1165
7043
8497
1139
207
5925
1064
3858
4212
3069
5365
5998
6097
990
1900
9662
9822
4202
9979
3635
2657
4225
8400
2528
5017
2913
273
705
7279
6046
8663
7222
9525
7841
5817
5431
9803
5206
3287
7817
9891
6834
8286
9291
4865
4324
5621
2052
5609
168
6214
6959
815
1603
2233
3172
1739
7656
3058
4874
5874
5233
3091
5750
7430
8654
1958
3965
3744
8638
2731
2990
979
4970
8073
7883
8913
8133
5521
2654
301
788
766
4319
8024
7496
1598
3980
4823
5630
2792
4174
4791
5081
6271
1921
1920
3407
7786
5021
2560
8404
7399
4150
3056
5810
7017
6888
4833
6426
5187
4468
8509
756
6984
1807
4137
9884
9951
1051
9799
4541
5098
8393
9697
5719
2773
1009
7604
544
6614
2847
6415
1811
a
8298
4698
9711
1884
320
5958
4130
8781
9086
5885
9840
5355
2271
704
6195
2531
3049
3970
9472
597
6362
8401
6661
8423
274
568
5106
1940
5307
5177
8516
1421
5997
3401
9907
4283
5635
5286
4133
7679
9078
7166
4703
2135
318
2947
2075
1468
9548
7185
1983
2584
8761
8719
2290
3298
7302
6493
1812
7803
9553
1888
9089
6035
4609
2281
5126
1647
8247
5150
2213
1378
7140
5759
1238
6642
7397
640
3381
1426
50
8494
9258
8711
6007
961
3710
7541
4117
4674
5587
4062
1156
5526
1616
8993
2709
3986
2909
6359
7328
3544
3568
4603
9774
8469
3869
1173
1592
8095
3564
6998
7152
4610
6225
489
3372
2946
3456
3817
1461
1547
1705
79
2021
1552
8211
5133
2363
5174
3346
2691
8990
6177
4720
1093
1450
7018
6417
8803
7171
2400
5641
506
2827
7007
7818
1490
1990
8040
5291
4338
309
464
358
931
4450
9713
8015
8356
2971
7587
3709
5623
6317
73
4100
7217
4135
3480
9795
5186
7561
1500
962
9989
9800
5509
5583
4928
6319
5546
3067
1146
8506
9773
3904
3880
6715
8042
923
1317
2051
9334
9149
2493
4271
6869
576
5048
5619
848
1324
5614
5328
8774
5188
7181
5650
9083
6234
4539
1732
4147
1361
8347
7789
4112
8432
8483
2988
8325
2628
5643
7887
2031
4846
1410
84
215
9531
1214
1367
8374
9681
6215
9541
4076
4909
5785
217
3692
2689
9297
2825
9980
6221
3140
1061
7617
5091
9667
7358
518
9295
6760
357
9185
3522
2766
6945
1031
2757
9673
4786
1853
2548
804
6371
2276
3025
9343
1268
1580
2675
3262
6077
3801
8801
717
9957
7791
4396
9403
520
7800
1393
9063
4580
3727
3924
2089
9199
8458
2564
993
9716
5385
9212
8665
9483
4013
5522
3685
2333
4397
6432
8941
7790
5037
5716
2606
8634
3082
6778
175
5888
2037
4948
6287
3833
1951
389
2640
4079
7909
8199
2646
4911
7365
5734
1415
2705
6157
9228
2225
4081
3099
7052
9876
1335
7644
6941
9772
1453
5871
8533
9842
7232
1703
5902
9967
6113
3149
6347
8174
9914
1881
8268
9116
304
6142
6251
6376
6923
##d
5095
2190
4158
9930
209
2103
3038
3763
2920
9344
908
7056
4976
3641
4106
5660
5496
1052
5928
910
78
7685
7427
7118
5074
8989
4197
1861
9965
9232
5814
7696
5593
2540
7384
3691
220
6269
120
6305
5087
953
7070
4842
101
9727
6158
4742
6585
4613
5940
6267
8867
8171
7896
264
2067
5434
3585
4145
4822
8620
7634
4618
6803
8904
6449
2829
2410
2544
2474
7473
5013
4855
8613
6355
8541
5471
2551
4451
7521
1276
435
7829
4989
8455
5313
4839
5050
8957
1377
3477
2874
9916
3493
5310
4086
3201
203
9245
211
6594
7095
7266
2054
9474
1555
8530
8508
3525
8693
2093
1037
458
5555
2555
8456
7091
3063
8000
7227
31
5391
4369
2719
4162
5224
9158
3721
5163
1235
7011
3050
7103
3740
6284
2084
9614
2491
7619
643
1925
5627
3319
1295
4897
433
2870
8143
319
6210
6655
4763
1090
4917
2881
2904
2218
6673
9011
1516
2575
5663
44
7825
6335
7493
9654
3971
2100
1056
4665
9224
5347
4616
2807
7746
5314
63
5802
1666
4161
343
160
2627
6911
4704
559
7649
4849
7345
1049
2318
4943
351
5790
7590
8343
917
9783
6297
2148
2226
65
8258
2501
870
5742
7682
260
2888
7788
8574
1657
7197
4633
2483
5076
9521
1379
659
8662
5042
6816
4452
1790
2495
8955
4026
7852
4743
1973
2801
9267
8999
3118
8026
5372
6712
9509
7607
7308
4862
5962
2288
8839
2699
791
8592
4063
1728
1931
5466
2559
7968
6607
3942
3259
3039
3805
9211
8387
6942
4352
4577
1671
8389
8246
307
6980
7460
7226
1476
902
1882
1918
9399
2828
6504
7898
2852
5045
4040
2924
2439
4506
5910
7313
4221
1300
9749
1566
1085
1856
5563
5167
8947
7008
9009
152
8451
5567
9546
6754
9164
6691
7400
2710
3950
4428
7581
3105
1462
5822
3354
2964
5768
5849
6856
529
7801
2916
9139
8149
8668
8114
7351
6563
2651
6591
8100
7474
6185
2258
8223
163
6685
7469
827
5051
6681
2329
587
4751
4587
7347
1792
9393
5290
1512
4834
4713
7558
6527
6895
9237
3408
4064
9481
6213
3546
1316
416
7503
7146
7938
3189
7535
4365
6066
317
7361
2488
3391
179
5717
1484
2669
6688
128
4695
9725
4598
7982
6453
2070
5933
361
5273
7511
4831
5269
1089
3842
5653
8866
4830
4935
8147
6037
5561
9033
2851
8209
6593
6781
6516
1617
3322
8965
2962
5639
46
8243
3353
9038
3044
5184
7272
3632
6841
5671
8128
8924
3030
4298
4006
5196
6604
l
4709
7694
7363
138
4107
2401
9243
7241
9648
7794
8908
5648
9913
2547
5210
5053
170
3689
4144
811
3135
5664
5208
7960
5927
5121
3415
2487
7191
6579
infoa
5420
6982
3187
9388
5396
3754
6986
5917
582
15
7495
235
7250
1228
2205
7954
5131
7260
2886
1162
1730
3748
1258
4078
417
3273
6877
9722
9743
1601
1625
2683
2353
8899
5166
8525
1771
3908
5642
1673
1874
960
6710
1631
2392
4701
3019
4969
8137
4853
7296
4430
2223
3577
884
1442
7572
3103
1328
5518
3226
7647
1684
2742
1143
3786
7311
4729
4436
749
8090
3464
3772
352
5009
2819
6392
6106
2367
5803
1942
1315
3208
9599
5047
3618
8107
5498
1075
39
2791
3260
3579
390
5662
8292
2621
1549
8300
7177
7842
8821
8272
1208
8514
5306
9449
480
9444
5337
2513
7284
2930
9766
6954
6884
4820
8599
8960
4476
9575
6351
6466
6897
4028
9764
6863
2236
74
6409
846
469
4627
9670
5789
7505
3949
2076
9382
4416
8225
9181
1810
2889
377
222
6454
9272
615
4958
7684
2754
8797
2860
4346
##b
429
2314
1642
4642
1873
129
2663
1935
7334
4527
7780
2676
5097
6835
6343
1818
8685
7039
1715
8968
8696
9960
3436
3722
670
7353
7133
3994
311
9278
4922
8373
1425
364
7912
7062
9542
295
3453
4509
4250
324
1946
7828
6718
5893
5617
2929
7127
654
938
7832
5536
116
7323
5693
9315
5726
513
4711
4410
4565
1917
7739
176
5755
6463
1246
3444
4382
4941
1762
9170
7409
4335
7286
9215
96
1483
8474
9632
2157
5993
4449
7633
2263
3946
6023
7072
5548
1063
7128
6304
973
4858
3356
7196
9539
5559
334
9290
9029
8581
9058
8571
3476
8007
9856
6164
391
9644
5297
7688
972
3248
26
1015
6399
9251
678
3244
4649
7921
5343
1219
1157
2036
9832
3750
3
819
7643
342
7723
7417
146
1254
3557
5986
322
8681
8383
8695
1828
6498
4542
8204
7698
3195
5489
4877
8427
434
397
538
4714
7850
1693
3791
1068
3313
6329
1863
4785
1911
8471
378
1185
958
5088
9607
5955
8151
7881
4765
3152
5340
593
4955
7329
3194
3775
7573
3224
1676
1977
928
6677
7141
5638
1734
2265
8537
7875
5513
1458
5589
9895
1432
6518
5284
2374
2283
8649
8553
5242
5701
2450
6473
1014
5415
871
4561
2666
6738
1758
8236
4678
2006
8823
3499
731
4337
5390
2032
1776
6034
1454
8068
6578
2336
4593
6880
6418
6086
4183
4550
2716
7983
1522
9320
3627
4393
4641
8245
7170
4226
6686
6350
5141
9598
2812
4216
9247
6483
3484
7094
9166
2755
3395
43
8154
614
9447
173
5146
2326
4974
5491
5432
1111
4088
6584
3326
8419
2056
4556
946
1226
5257
5001
5254
5418
9379
427
5014
1909
3925
6531
4294
6634
2885
6701
6791
7482
229
6997
197
4166
2927
9810
6915
7061
3094
4362
151
2079
6745
9870
5483
5129
9437
7106
2146
6337
2629
6391
1019
6336
6139
3768
9265
5120
1644
4879
5101
913
5728
7487
5731
3616
3468
4938
767
7050
2692
5104
6075
8113
6333
4072
3210
4242
5681
7970
1498
6533
115
5898
2641
280
4465
460
1554
1652
9044
2538
1822
2484
7220
9238
3060
1559
6978
8351
860
1164
8372
1742
1878
7434
5787
9016
9685
5984
1499
1127
6293
5831
8201
3469
6859
8507
5422
4132
9706
6044
5144
4312
9747
3449
9380
2297
2823
3602
2612
3864
2867
5924
493
3733
2833
6727
5190
3870
6999
4378
7971
3736
4129
9101
1382
632
6331
6172
1998
6245
8749
3214
6522
4666
3764
9144
4619
1055
7918
3589
3989
7932
2679
8664
8378
9317
4299
8914
7394
1008
2461
9841
9431
5890
1570
598
5809
1180
8146
1905
9984
5634
407
7420
9707
6892
5957
5169
7451
9126
8775
5124
6659
9001
4661
7179
6966
7288
2931
6750
4358
8366
9816
8614
983
3095
1005
2608
5713
2996
210
9985
333
7488
9757
1447
9854
6370
4275
1733
892
2378
8412
3761
2876
3136
9487
1444
2154
7555
693
7564
6525
1396
8326
2756
2127
4282
3886
177
4692
2499
2116
2891
2122
2983
8528
2321
8951
639
8168
7267
8612
7936
5945
797
8104
8273
926
1636
3488
14
7346
1497
9885
730
8487
505
8339
7943
6787
5761
7343
735
3885
3815
35
8677
5811
2457
9630
6562
4014
3169
1540
8786
8745
2835
4718
3999
2220
857
6280
1474
2189
4771
4480
6758
8579
2703
1113
9047
2428
3532
4981
0
784
7947
5411
9248
1629
288
9556
3524
8069
248
5405
5084
1433
1529
6728
1646
4437
628
5065
4330
5703
368
454
6742
8299
302
2746
6782
8538
2172
6020
3295
3952
5287
3973
8915
8907
6746
5889
8449
3992
7744
2592
9125
672
7194
3490
6507
5600
8445
162
4778
9974
6950
3406
8158
822
2115
9008
6822
392
7015
1046
2790
3216
8997
7137
1331
6010
7382
5556
7670
5736
3231
8921
5977
6206
8824
6434
6004
5109
8470
7281
7442
93
8897
1802
8467
8278
7186
6541
1991
4044
5603
8511
3233
6960
5371
7956
8117
7693
8254
4606
761
5019
7112
3088
7566
5937
7846
7711
7504
102
3366
7626
134
9003
5368
8702
741
6475
7150
8670
4340
724
9464
349
4420
8047
5585
2504
9175
6423
8051
1001
4659
4421
997
8301
8249
32
infoc
9032
4889
7886
6203
1412
5995
794
1841
8195
3972
3423
9860
7100
354
4688
2784
1755
4461
82
521
9504
6805
9287
9462
5183
3861
5996
4844
5363
2369
1750
2684
6128
7248
4991
1661
9195
1785
4027
2242
8188
8747
5182
6629
9100
877
3087
7525
7175
5746
4800
1765
6929
4946
3307
3592
4149
8480
9635
3253
7899
7765
8041
8622
8329
2168
986
2278
8523
8642
6622
2940
9831
1714
8229
24
5864
835
9526
859
540
53
853
6205
8011
5360
546
991
8756
4388
6798
6055
6512
933
5678
8836
3979
8624
2596
4364
6702
3485
1451
2269
7596
3420
1849
6257
3232
112
4817
3976
7255
5000
6340
2685
8442
2361
4093
7751
8044
3265
8958
9701
580
3170
8557
4195
9106
8152
1595
2771
4152
8570
4977
7638
5570
6015
6109
3128
1779
8368
1609
8322
3693
3888
3673
4562
5566
8976
2359
4300
6595
2169
9342
6084
4492
1431
9737
1253
6873
8340
90
1612
5214
6526
2863
2597
5334
8053
5723
4723
6732
7073
5644
8265
7520
8014
127
7273
8984
4737
6110
1397
1269
9488
1487
4854
687
3612
5323
9490
1712
6474
6700
4680
1692
1194
7961
3502
2890
494
2087
8935
9500
9642
3556
1501
3792
8155
617
9962
4050
5980
620
3730
4795
3185
4906
9944
8187
478
6576
9186
3474
9564
6671
3841
2613
91
4455
3497
4357
4127
5333
4406
7446
3393
81
3756
419
7691
7631
7630
1938
7044
2527
2494
7547
6248
7608
5959
6278
6490
8618
8597
9908
8094
6679
6108
1825
7567
7697
609
2765
2366
3320
7659
9426
5248
2893
8328
6270
7859
4784
7158
6161
8892
5934
4021
5512
6544
932
599
682
6232
3098
5232
2690
5207
7506
488
1535
345
4478
9056
9406
4537
9820
8430
570
641
182
905
4363
1760
3879
2453
2568
8580
8969
2845
666
5879
7242
2102
9679
8524
1962
7300
918
6851
8235
4538
5990
5170
8560
5868
3482
6088
1749
8331
5691
6669
4474
2577
1215
1896
6971
9381
5164
4563
8698
4172
2330
9649
8481
4037
5440
4526
6621
9776
9421
7165
5231
4572
4316
736
7202
2723
2406
348
9277
1752
9252
6470
9131
3948
1048
340
6374
8546
5779
4867
5335
837
7585
8123
3154
6049
8977
9121
1168
2025
4746
8284
6013
590
1184
5948
5780
141
9322
7798
652
9309
482
5640
9627
3967
9261
6658
823
6043
9823
5239
3760
1307
686
8986
9942
8953
8443
3297
7119
1002
1078
5477
6247
180
5430
9085
291
2449
6624
3264
9118
5357
8004
2322
6967
9133
5612
278
2040
4167
4479
7865
4279
9193
9688
9968
8673
7975
1223
1309
7526
2221
3738
8096
8903
7164
565
1572
2667
9064
9904
3860
7646
8463
6975
8785
4508
8562
4286
4126
7144
9332
5117
6016
4660
7843
7905
1356
6913
3020
2259
8253
2938
9936
5011
2423
2695
3528
959
3796
8500
3919
534
4582
7059
4758
2309
2349
7605
2153
1012
3131
275
3788
3076
1948
5969
3909
7009
7295
4548
8804
4333
6633
4523
499
6036
4446
7368
1221
9409
6780
5774
6307
6061
2864
7004
4622
8726
4139
1079
2630
2368
1465
2202
5696
886
5201
9700
6962
6334
5386
573
624
2769
955
463
4383
839
8724
7993
4636
755
5154
2420
4321
5836
4154
9340
5658
2455
7542
5225
6963
5708
9848
[PAD]
8770
5500
8814
851
7174
3359
9664
7135
5625
3751
4973
3466
8228
8332
7699
2997
4952
567
2475
2292
7577
5127
2586
6240
9040
7761
9469
3800
6618
8980
2878
9385
1562
8431
8569
7992
6253
2694
8674
5071
9677
849
2681
67
5622
8052
9529
6120
5999
1548
183
5402
4425
6178
7475
7833
2849
2713
638
594
9751
9371
8344
7519
2631
5608
2235
1140
2820
3975
4741
6050
4933
7621
4295
1282
6519
8616
1607
9671
3660
8630
8811
3334
2311
2609
9283
1021
7689
3552
6690
7447
5667
6218
8655
8142
6163
3177
2429
2347
7418
136
72
6792
1310
4458
7395
7839
2312
3820
402
199
5046
1956
681
524
5234
401
1852
3695
2747
472
5327
7945
7264
6402
1829
9169
7654
6744
6080
9917
9551
6275
9494
5162
4124
161
3941
2470
950
9396
5607
23
1707
5407
2415
1057
9561
8936
7371
7481
4594
3896
4370
680
7354
8214
4366
9345
2994
8561
2090
2817
9937
9806
9518
6555
7278
6301
6366
7359
6162
3916
3571
8754
1937
6438
3028
7071
7639
7823
5797
8504
8704
9368
8125
4287
9160
5457
62
3961
9375
5508
2445
3513
1306
4684
2636
447
9045
4980
8697
6169
1230
9074
4960
6935
1713
9280
9234
9859
6886
8838
2779
8029
9216
2590
1687
7063
1635
3255
1994
8734
9567
7076
9950
709
2708
6881
3394
1388
1726
571
367
8596
5123
4180
9888
5336
1691
2266
2541
6823
6102
980
4253
2857
8005
7349
3256
8657
7443
8708
7890
6450
4042
6867
7085
3205
4615
6505
2923
7591
3553
5897
2373
8609
2727
503
7154
2436
5256
5459
9405
8669
5581
803
5878
1438
3731
7243
5675
2734
7951
7756
2896
7601
4775
6699
219
5778
2357
3301
6657
9922
2229
4055
2892
5379
6756
4953
3338
5891
1668
6879
8124
9767
144
327
2477
30
3471
9656
8190
1122
845
5289
818
3644
1004
9516
4486
4859
6357
8627
4596
9046
7554
7976
2589
1145
6599
6313
6219
1314
1172
5056
1763
8342
9975
5724
2096
9802
1638
3643
2138
2120
8057
6229
13
3106
6111
4783
9476
2260
5484
4993
1179
475
4632
6952
3743
4644
5949
5975
2396
1463
5439
8498
9441
5414
805
6325
7332
2604
9434
1720
5861
47
875
240
8022
7492
2015
4731
5854
2118
7562
2048
423
9928
4472
9545
7014
7431
6380
1885
746
2222
6714
2953
6641
6477
5805
4798
6085
9402
5531
376
455
385
1126
9877
4198
4707
5786
5557
4392
8350
5267
5219
5185
8067
4738
7810
9325
802
6861
3708
7648
4625
6908
7866
9053
1394
1030
6868
2718
3438
4808
4884
2253
9786
535
8707
3929
2865
9853
8105
2674
2362
5988
4173
3086
2344
8758
6497
6660
7635
6550
1910
9154
5092
5499
9468
8526
4520
5894
4573
9633
1196
4579
9114
4249
6893
8121
3504
1220
3857
##f
824
8434
305
7253
5373
i
812
1338
6557
4413
2952
5549
1581
1651
19
7387
9294
3874
7187
2295
2197
3254
814
2170
7010
1568
2422
2030
6
5189
7884
131
384
9090
1748
2108
4012
2047
4176
8798
9093
3845
6131
4105
7770
##te
371
2656
895
3530
4303
2027
9563
4196
3459
3662
1278
2163
1768
201
4236
7224
3835
9726
4270
8307
4925
283
6056
729
2215
5152
5134
7423
8116
8709
2645
1042
7709
4554
3854
5688
6342
6194
347
3937
3175
9145
577
8982
1738
1862
476
2247
7139
9387
3093
1387
2859
3572
9651
1932
1588
3081
3649
4759
9637
8931
5020
300
696
3958
9997
5574
2237
6947
6124
9900
740
739
1469
256
7812
8324
5040
425
7108
665
9515
5325
5572
7035
4719
1248
3111
4342
6252
1784
4760
68
723
4131
34
8731
4629
1575
4045
2239
1349
7275
9926
5114
5870
927
2386
3213
8932
1291
2043
1227
9730
3701
8547
7779
1283
4564
6026
542
651
9796
5032
##a
1602
8927
4898
1539
1419
3278
5618
7900
5669
9366
4060
9495
2570
3947
695
6422
6587
5851
2178
4880
8788
6668
2600
1613
769
1605
9735
1892
5176
8656
7995
7238
8699
1685
4657
5304
1887
7957
8318
1495
8573
3790
9473
1879
6793
4679
6801
1701
760
8255
1594
8981
613
4351
9720
8643
3913
8644
2199
4570
421
9285
7531
7811
957
5772
9824
4975
3500
7183
3927
4827
5449
5082
3873
3621
9857
8144
1813
4807
2459
3308
8700
2472
8944
5547
6626
5673
2414
9836
7784
787
1764
5503
6148
1103
4797
7419
9201
981
7341
7406
4031
2492
7298
5479
5951
8087
3993
4964
8851
7075
6814
6115
7259
9925
1138
7799
6753
284
5881
7962
7123
3363
3610
8755
712
4306
7805
7778
9770
4533
841
8045
1154
7254
5195
2517
2274
3611
7455
3702
1352
8184
8495
6689
5573
6840
4534
2967
5909
977
c
5670
3576
3053
3894
5702
4691
516
2960
4607
7203
1066
3165
5252
1953
4284
[MASK]
6737
7338
124
228
7559
5914
2617
1216
3804
6637
5468
1794
799
191
3508
6230
9844
7145
4404
5061
3180
6605
781
2389
8611
6400
4097
6565
8354
4891
8364
1148
3330
5576
817
4163
5423
8140
2707
3988
5358
9184
3505
9829
7244
8769
4025
4023
5578
5175
1390
6360
3199
2726
2767
1727
874
1978
9729
585
8727
1520
6796
1908
3380
5841
5113
2145
2073
3716
5829
3303
1047
4525
3078
6773
852
4805
4424
4264
1898
9693
471
9850
7501
9073
9104
9517
9600
1129
4080
3431
1945
5478
328
3200
6228
9178
3996
97
4488
6117
2978
6133
2961
45
1400
2743
6610
7599
4329
764
3933
4429
4645
3457
9065
6769
1680
5421
3934
6706
5876
7999
5502
294
1344
6829
9746
2164
4663
7491
9455
8593
2029
4326
8336
5303
8473
4600
1249
647
7097
9026
5652
7450
3229
5135
2270
2943
539
8251
5249
8305
9875
7239
7370
2811
2869
3809
6430
6190
2095
1218
4624
2444
5530
677
1366
6211
4004
7390
3943
1271
7603
7904
9330
6220
3186
4522
903
4188
8407
181
7268
2862
9520
2267
4432
4217
7483
7538
3794
4265
1980
4411
1504
987
2024
1348
6896
2647
8440
2955
1511
2485
1924
7636
##o
5819
4182
1934
8150
4075
9329
4118
7755
3997
6542
5243
8477
2906
6705
4689
896
5094
952
6094
7131
6815
4875
3803
5575
8293
2009
6315
3781
8064
2593
6321
3269
8346
5476
6627
2382
2437
8130
9578
5261
5964
8778
8893
9446
7571
8854
9579
9868
1967
5403
9147
8207
4643
1428
690
9765
287
9991
7249
1933
7472
9336
6254
5901
8718
4122
7727
5991
3390
9429
4878
3369
3891
6643
5110
2910
9311
7206
6419
7661
8148
8551
3518
8334
4426
7378
4712
7486
8629
1153
5654
3024
8360
8159
786
4493
3678
5551
6574
619
8928
7575
6752
7996
4528
9081
6830
8768
7167
6757
3698
734
7348
7901
8565
3161
6946
195
5217
7733
3137
7236
8623
4814
6199
8037
9059
3806
7297
9018
4205
5132
6883
5852
9603
1264
1855
5715
2509
7178
6176
316
9418
9194
7622
4501
3963
355
526
4959
4896
292
1287
657
7916
7840
7891
1229
6766
2005
8998
6281
4347
3884
4702
2020
1169
9099
9443
1947
296
7820
6961
5552
9761
4555
7870
8248
5058
1322
2625
5018
2160
185
4602
757
80
5569
3364
9477
426
2715
3747
6920
1591
8819
3478
3614
9798
1747
7624
7051
4700
7686
3133
7703
3329
5800
6800
3542
1211
975
5085
6779
7857
1769
1339
3192
4001
6440
8025
149
4801
2017
3862
6244
1845
9552
4015
3447
9411
6053
8782
2573
2370
4018
890
5837
6848
3274
5278
4870
306
552
5227
189
443
982
3608
6388
3665
1970
1959
3624
2156
6332
1510
4456
6167
4951
6931
4200
1486
6729
1000
6436
2516
9815
3720
4255
1842
6784
3706
7877
7722
7468
4290
4007
8865
6630
753
8845
3607
1441
1672
1478
5437
9198
7536
6189
1332
5338
2355
1086
4931
6266
1929
77
9653
592
3413
9331
5543
2300
5276
5965
7990
3257
8082
1941
3325
6040
4847
1648
5296
5971
3859
6709
6062
1756
1724
7426
448
3336
3823
5645
5203
481
8692
3922
6571
7301
533
234
7903
8279
344
5956
3561
4753
1791
5961
6636
1558
8441
9778
1199
6771
7952
8922
2293
6393
7537
949
2722
9128
4036
2526
2331
4648
6724
2624
5320
7902
449
6638
3923
221
1584
1649
10000
3198
4968
3778
5938
4310
5784
9631
5722
2296
3427
6924
2241
5108
7379
7200
8250
1099
5541
1284
8290
9180
3745
5860
9695
2086
2622
5497
3705
3148
9678
684
485
8633
3061
2614
3605
4662
9675
5016
2184
8499
2758
6168
227
3899
3227
5862
5739
8945
925
7168
2302
7766
545
3915
268
386
6316
1177
1766
6748
575
6937
3147
7546
9692
976
75
2508
3242
3802
3900
7582
7162
8589
8006
2391
359
9461
7934
920
549
8001
4179
6590
3630
4074
1320
8992
5840
722
9605
257
7223
5758
1663
3371
6774
2395
6239
1144
9710
7882
9615
1470
6790
4543
800
6575
2995
5532
1437
5812
3807
3279
8327
7069
5858
3959
7548
7389
3300
4003
9501
2556
7136
2201
6862
5931
2250
8608
2187
1280
3472
7640
1741
3912
8482
5510
4821
3865
6818
5782
7809
1406
118
4505
1865
6680
4668
5815
9021
40
5408
7
1880
1923
5298
7391
3834
6938
1360
2565
6554
2284
5846
7551
6944
8070
4902
3174
2064
2780
3515
4730
310
8832
2941
9873
7944
1467
8028
1189
8288
5773
22
885
4866
3481
5100
3288
7967
5107
3647
5173
4353
3827
4239
1161
8830
5605
3677
4638
948
9208
497
9646
6224
6723
9741
5341
7294
9568
7330
2114
2161
267
581
5590
9219
6443
9583
3026
3302
3889
6479
7480
5036
2761
1296
1551
9880
4101
9902
2704
5259
2534
1345
7342
7408
8267
8194
2143
2914
2383
6570
3732
4082
5506
3383
6666
9566
7677
2018
9640
4671
8559
6825
9023
8008
6964
3676
7894
1427
2653
3178
4915
5537
2975
9463
3534
8748
7997
56
8861
6807
688
1036
9940
9117
807
6547
1466
3824
1583
2069
4516
830
3141
3458
4826
4905
8472
1243
3206
2879
2354
8841
3218
5707
3600
9210
7588
3157
6891
776
9359
7195
9304
8515
3276
7084
8502
3995
1610
6478
6460
941
9068
6510
5180
3893
2358
6768
7086
4652
1868
5903
2044
8586
1256
3652
3036
2793
1571
2313
5220
2672
7981
9948
4851
7740
9491
6561
9467
2099
2831
366
9225
3013
9665
4448
618
405
1507
6462
8539
4482
6875
4070
5720
2150
5827
6991
6910
8652
4280
2550
4768
2579
1709
2409
4971
633
5936
2245
225
5601
649
3687
156
2902
4919
1167
4806
3566
7479
6308
133
6272
6282
9034
7413
4782
461
1655
602
3034
3064
2454
7433
8540
2273
6181
1102
6695
880
9543
3370
1270
1072
6149
105
2972
3110
2725
569
8388
5455
3655
2841
588
1350
6386
3022
7438
6241
6375
6223
2012
5606
3043
6095
395
4160
7658
7312
290
7065
8263
645
3555
9988
9638
4840
3920
7373
6664
1729
3402
9574
2539
4384
7627
3079
9748
3849
4240
2777
3317
387
9589
4257
9266
2338
8311
718
4400
3839
4532
3926
9993
9647
9389
1590
8777
9961
7115
7834
719
7889
4558
7055
8646
3225
5288
477
8218
8416
117
6976
2195
7080
2305
8874
7844
2717
8306
1926
5158
1040
1608
4503
8555
3358
7821
4566
4487
2569
9357
8757
3901
2203
4979
3124
1971
1457
312
8202
2696
8120
##l
4379
9964
898
3479
929
1659
7172
2623
9538
523
5007
9235
7831
785
2798
519
4146
4764
9439
8701
3734
2591
1195
596
3373
1029
114
8868
1960
8615
702
8460
1275
2042
7411
7569
3844
6326
4762
8628
1399
9412
329
3953
4914
1053
6441
564
2595
604
418
683
2808
8660
6802
5197
8220
2728
3090
5823
883
8979
4872
7969
7827
1054
3247
994
8421
7929
3646
5356
1633
603
6969
7219
2486
9220
7965
1192
232
1704
9048
5315
9830
8072
8902
8164
6914
658
1409
4623
1212
8900
3779
8772
6233
2737
7393
9138
9811
4626
5348
8794
7020
4774
381
6943
9196
1992
8050
1312
3603
9502
8789
5626
8139
5863
1737
6567
3931
2174
9717
432
5419
6864
5624
8853
6112
3460
4343
6100
4401
8765
1174
4140
3638
541
8079
2783
6300
2782
3735
7623
504
3580
1736
1753
4735
6826
9641
1240
9522
8269
9127
1380
8996
2301
3663
2335
7792
4278
7315
2411
7895
7322
5309
8518
8310
2173
106
4683
7280
9442
8414
2846
2739
8590
6820
5866
9013
3956
3158
2298
7209
##e
5748
4328
1069
5613
1567
2632
3017
4614
9303
109
9592
6328
1857
2979
8285
2339
5089
1299
293
6520
9339
2106
9105
6503
3418
6813
200
6901
6509
9941
6160
4530
4380
833
6294
1615
2308
3047
8735
8728
6200
4390
8978
5068
6606
6174
8762
1913
4344
1528
7048
2425
9593
6979
4584
8730
6733
3339
737
7314
3115
2897
1817
863
1182
1035
4029
522
7247
7919
4551
9650
887
8013
3669
3057
8349
5495
6644
6459
4656
1538
value
7768
2804
4218
9233
5059
4402
1847
8721
6543
4871
4568
5694
5093
5668
5950
9946
7772
8645
8406
4151
10
>
2121
4052
9992
6145
3825
2155
6933
3548
691
4908
3410
1420
297
8716
4776
6323
9084
9137
9498
valu
9350
828
510
2421
7743
3648
4164
2319
7645
2158
1088
6996
7033
8119
8161
9298
145
7667
985
5392
2688
3578
5588
5488
5008
1245
7078
4997
7676
2185
5981
2648
8448
9435
7060
6457
1809
8784
2438
7038
38
9187
4157
8713
483
3588
9200
9140
8303
5692
6751
4967
7510
398
6476
9159
2603
2543
4193
6513
8717
2932
5344
2177
110
5029
4710
2196
va
8991
7101
6107
2797
1543
8661
9663
2802
6612
7513
8729
2082
7120
8192
879
3964
826
6530
4048
3808
9863
7369
1901
6129
4574
3606
4293
9168
396
4637
8621
9328
2588
9797
1864
6623
6141
2033
2963
6472
3270
5833
9458
2848
9963
370
6021
9558
4498
3596
3814
5469
226
3494
4308
2091
8901
4994
5963
4477
9590
7205
1134
4008
9887
5436
2028
6828
3032
2212
16
341
9544
4578
6130
5697
511
2664
1843
1665
4051
1440
1974
6600
775
7498
3696
279
1782
9422
728
4690
5425
3587
5199
5005
7937
5481
2712
779
7533
6656
9274
3450
2662
6006
4832
7211
9088
6850
5122
1502
7980
9775
8355
3347
9817
7333
7545
6397
3503
100
7027
3454
2119
3010
4907
7030
58
8667
6054
169
5055
7819
9353
4646
8818
7940
262
6303
4490
5595
##t
6694
7687
2123
9416
8678
3535
3906
2880
608
9152
9183
4755
8239
996
8550
6549
9430
9361
3102
7173
1193
8453
6480
548
3955
8380
5525
4496
20
4923
159
2598
3441
2393
3399
1485
3838
223
3867
4222
7657
8058
8034
2435
1927
2552
5848
3127
9659
##lu
27
4682
6615
5321
1137
2814
3350
379
9337
7666
8241
8490
3514
1435
8019
5553
9883
7939
6087
8433
5859
7396
8466
5544
7083
1816
2818
1532
5460
9214
1832
3684
9163
9939
4444
8489
3074
8316
3714
1708
4592
6179
270
85
2251
6039
8939
5943
5293
3774
7824
8444
5738
7949
6367
1949
3223
4415
6665
*
6068
8909
6209
5073
768
4535
1963
7156
1961
9723
8802
8805
6598
789
1247
3221
9301
1619
3072
2510
1292
5710
1341
5839
5801
6365
4816
2950
6446
5565
655
2678
2637
214
7031
11
9792
362
9594
5275
5228
1147
4895
5970
9428
7793
9754
6135
5265
2774
5892
7350
9360
6396
166
2643
205
9779
325
3591
8098
7781
5947
9112
1131
9179
6987
7228
5111
6216
5002
1743
5699
7208
7814
9696
3166
3601
5066
4186
##ate
4111
3903
4773
7276
4788
[CLS]
2125
6191
394
2599
1364
6008
6143
5156
9931
5554
5332
2111
9927
4863
495
796
8647
8625
6032
4056
6852
2714
5596
7680
4403
9954
9176
5171
6042
3719
8173
8568
6182
5030
5754
8715
113
9999
6405
5442
1915
3002
6005
2345
1130
8417
6524
5684
6444
8398
3623
1096
5753
8776
5629
5821
1858
2022
2348
9000
4747
6876
5896
9122
7706
29
5516
5806
4956
9742
2466
2700
1618
7760
9505
7565
9111
5369
7149
2346
9113
9587
5247
7441
3586
5655
4920
3176
720
7549
2720
3286
2384
1365
444
4885
4389
7527
9508
473
8519
5285
5743
9827
9066
5230
1475
8552
2670
3228
6934
9306
2697
2601
7160
6707
5729
7424
4374
8213
9096
6078
9793
206
2626
3598
4273
7303
7988
1109
3219
9676
9410
1112
8881
1160
1492
5151
891
8061
6765
3243
4058
5568
8828
315
8145
1669
4203
6609
629
8295
2198
3312
644
3246
3777
2469
9318
2984
6824
4094
6431
4077
1355
1954
1372
6353
8320
1381
667
1327
8345
1987
3968
6237
1011
4412
1128
900
4787
4630
9628
4387
6993
1838
5749
8847
9150
1999
3626
8983
5895
1509
1846
7719
5727
8880
6082
8365
5178
7377
,
6098
1550
3991
3843
7873
4792
3670
3672
2434
5389
2011
2001
1839
8055
3023
9384
4900
1313
9253
5690
3405
5793
9755
5942
3425
1698
1746
1020
6119
2277
4418
1386
2850
5096
7704
747
921
6090
2775
8545
9911
5251
4024
5022
6395
7669
8964
9275
6775
3529
2000
1869
7234
8988
4121
8970
3129
793
9893
1359
2132
6212
6726
6202
8297
7872
4811
8357
1527
3755
3120
1718
7612
8276
5271
1267
8132
5511
8544
998
3412
1106
6361
4675
4882
3921
4258
3780
5067
1506
6572
7257
5149
2255
2162
763
2837
2016
230
2320
7906
3538
2387
9124
8216
951
561
123
8424
2542
8871
1493
1515
3351
5480
9482
5834
1362
7182
7632
3031
7651
3617
5973
727
3583
671
408
9759
6653
5345
1337
3379
595
3707
6260
5714
8170
1686
2327
6009
3001
8077
4589
9007
7935
465
6855
6144
4635
7946
3294
777
1155
5577
7728
6322
8672
6955
4269
7731
4940
7917
2152
2315
5540
420
6159
8522
7129
8086
2204
3357
3990
6720
2822
8182
3162
9270
4098
2481
6103
2921
5463
2721
9903
4841
2065
2280
2730
7327
4936
2686
3724
9897
2744
3819
9582
2328
4049
4423
8358
7707
2416
6842
4057
1767
8175
6831
9889
1308
969
778
6372
3711
4141
4502
5198
9986
1914
1660
8610
2974
6648
5533
6047
9585
7111
7628
2858
9459
3003
2668
3085
8391
2334
2092
9687
528
9588
4460
6166
774
3315
3521
9162
1517
6461
5764
4893
3451
8967
8877
6502
4899
8911
4687
272
7672
2908
445
6783
422
in
4095
842
2397
3957
4604
4860
4918
4206
2866
188
3998
2968
8600
254
9420
3376
4038
2911
7514
5139
4251
6192
9858
8631
1132
8813
5159
8920
9346
7747
1943
4504
610
98
4739
974
3590
1045
8895
9049
9236
6235
3442
4716
8946
9132
572
3409
5665
2937
36
7837
2351
1530
527
4274
1710
8352
5413
3517
7041
8109
8933
2966
5270
7662
1508
8112
7021
7049
698
9933
676
1711
3757
2183
8185
4466
3114
4010
2711
5229
8767
3361
6521
2572
9788
4259
3241
7263
8759
4110
8632
1369
2532
6338
4518
4944
1323
2324
2147
4612
2518
3271
8020
4575
9244
1837
7216
3987
7291
547
4585
726
6925
3258
4544
1436
7494
4090
1197
5364
5873
5140
8111
5923
9780
4965
4419
4016
9227
1513
9062
7305
1702
4276
2019
8304
4376
1231
562
2061
2998
909
1371
2563
6038
5966
5816
3386
7641
9165
5250
6764
5580
265
1848
2341
3212
9834
9061
3679
87
1105
3377
5204
1342
7563
2008
6012
8822
6649
1836
558
7405
3443
7340
1579
3220
9866
4517
3897
894
7690
2381
8386
2677
8952
7775
3126
9367
251
675
3932
2861
3654
4085
3917
7910
8118
5119
5472
7439
4
7161
4192
3565
4495
7367
3547
2764
6146
3184
1851
8780
5972
1445
2432
6320
3344
2285
4930
8437
2980
1395
4223
1799
6628
1889
8763
1321
3217
8603
6646
7310
7989
4725
1578
5033
8338
336
d
7292
5118
5747
7653
462
4670
4481
1016
9323
1402
6846
8937
238
430
8030
7609
5004
6067
2507
9758
3570
9728
8076
7717
8196
8402
1077
9666
12
5751
8787
3434
916
855
3448
7959
5380
7908
1773
9966
1407
5666
infob
2530
7013
1456
6713
9694
2264
5912
6427
4581
7325
8156
5473
3851
9333
9167
7229
584
413
8237
9394
6002
4356
9239
2985
8723
6928
187
7714
5078
3035
5842
5312
5331
9260
7134
1205
4837
6558
8650
8961
8429
4789
5387
5361
1448
3559
8884
2014
9456
5467
9658
5052
5771
515
119
9177
4354
9374
2661
8435
4341
9005
770
7012
2989
8312
9020
8205
4114
8793
1503
7752
3207
1116
6788
8815
4467
8370
6048
773
8446
277
3799
3211
2244
9724
6932
4916
6810
4491
6619
4254
2377
3403
8687
5326
4067
9512
4348
1107
1239
5279
4634
1761
2853
7274
8428
8558
7742
5319
5591
456
3277
5342
7022
8422
9669
1968
8317
9151
9427
8858
5735
6000
6936
7026
1060
1209
8850
4187
1059
1697
9572
3117
9004
9135
6809
6761
694
3332
733
6484
8206
2081
1232
9391
7528
2903
4529
7683
2944
3268
8532
4672
4876
6589
1658
2809
7459
6508
3352
1084
1690
8491
8659
8375
1274
7652
2007
5796
3285
9597
829
3520
2473
5202
806
5794
7485
7855
6617
6948
3661
7470
5611
9970
54
2448
9324
8189
7583
922
4102
8816
9732
2511
8475
9027
1175
2752
6704
412
3640
5049
4769
5054
9153
3489
6844
4235
1325
7592
4325
6344
2567
978
4761
2142
8929
6394
3238
1793
1452
8271
59
9098
2060
2505
1585
6198
8676
4092
9623
9987
5967
6866
4809
6291
2013
3400
7796
6227
9943
2549
7016
1780
6667
8870
7923
8501
1115
7998
9191
37
7357
9625
o
298
4489
1013
5918
5987
7462
7879
4836
8048
18
9271
2097
8363
6246
2180
2918
6413
2186
5741
2379
8335
9760
738
4438
9826
2464
9668
5221
9890
1494
8690
1297
7422
9284
1222
5832
9273
7230
6894
7629
4726
6592
249
6539
5452
1682
4434
5523
7282
8771
1770
715
4772
148
4261
2733
7614
7556
3526
3533
3360
1423
4311
7584
1255
8056
8085
8826
8233
4722
8949
5504
3121
2072
9308
7681
8648
4986
8054
2873
6970
7307
7180
4409
6974
2194
7237
3054
971
2524
2109
4990
1524
8658
2578
8606
5604
233
4881
7655
3123
3473
9146
5191
7356
281
4510
4463
914
5060
3767
3027
382
4327
9878
1044
8186
2139
1024
n
9102
9719
4245
1121
9335
3683
4422
3822
3470
4640
3283
1273
8102
743
5246
5979
t
9709
2077
2433
9010
3250
8060
6767
2981
158
3146
4296
5807
7721
6871
1640
9734
8162
7715
7114
88
3426
866
8319
6860
474
6794
7102
3164
9618
6916
9174
3840
8081
8420
8452
3509
3314
2035
1778
563
8795
9736
4272
9363
467
6596
356
7201
130
8403
4459
8129
551
2753
3821
5520
1641
878
5362
1488
4017
1302
1007
5808
8167
6451
7068
5378
9259
5985
1553
1242
660
8974
3042
3866
9919
3703
1120
4639
6812
5125
5272
7705
3125
2581
5366
8879
375
321
5674
6890
3335
3282
7753
1244
5610
7763
8531
8833
1098
2149
1806
9586
5384
9872
4165
7807
5631
5181
5075
3536
8963
7928
4266
5138
4507
1542
2839
2615
2141
5493
3089
2826
1930
2856
8806
7374
4828
9492
8234
2206
4372
3907
9425
7907
5400
8283
8408
1751
9310
2256
7006
5410
5346
9952
6165
3667
3096
1688
7212
1518
4304
6410
3898
1176
7124
2224
6973
2571
2665
4818
2735
5745
5781
1664
184
646
4229
748
2402
8065
7381
1623
9763
2872
8888
7074
6486
92
6134
3236
286
9041
8381
6693
7611
3101
8377
1907
8166
4289
9661
9296
4740
7271
6776
7221
2192
8059
457
8395
239
9906
7851
2337
3323
7360
3461
3789
9636
2128
9881
5147
7277
71
2249
8753
1353
679
9513
1725
2877
2299
3245
6327
9400
5968
9981
8415
2915
8956
5205
1281
3659
1781
3700
[UNK]
1025
2231
1351
8222
2759
9423
9417
9172
7540
2243
2566
6672
9240
4559
8950
4224
6743
269
1010
4754
7606
9756
3015
1082
1777
415
7064
9528
7534
4910
383
450
6312
1408
6663
8736
7716
498
1545
5470
2325
3928
2787
3762
8653
3782
9804
8330
4934
5435
9523
6058
5090
7143
7404
2673
6421
6939
3828
7738
2659
2781
2228
7261
1621
1472
3424
611
6874
1038
6556
864
5349
8543
6517
1577
6207
2945
7795
5268
1279
1091
1210
57
9433
8136
5226
1993
2254
4937
9404
752
8604
9030
424
6279
8890
1491
1523
5116
7355
512
1525
3465
605
5077
7079
2010
4728
3193
186
3433
190
1265
9762
7047
9601
8820
8367
6994
3797
9998
9206
3203
6489
7293
7759
3122
2993
8459
6064
7724
1774
4857
3575
8496
1723
[SEP]
6887
6089
7005
8703
5847
5352
2748
8891
5263
6153
3430
4793
7880
5445
947
6382
751
3978
8260
2970
6238
9207
6262
9549
9157
4464
2063
9057
4204
6559
2519
4113
2836
7362
6096
5398
9321
3516
8529
3188
7568
2390
3816
6882
1519
6261
5560
7522
7499
4705
6063
1489
7735
4686
5676
6029
4019
780
6832
1624
4039
5887
5615
103
4949
6739
8617
108
1250
4576
882
2140
7082
4848
2680
4939
5165
5872
6385
5756
7914
6611
2682
9624
9536
2503
4371
5454
8766
3599
9313
6296
1150
7454
8074
3375
9507
9715
8242
6581
1674
8411
3876
8714
4128
6197
9173
5954
3636
9995
6731
8413
2900
6494
5765
8169
5712
193
1070
3887
7444
4339
2706
1969
711
1997
6173
9305
4913
9097
701
509
2868
8862
4233
241
4815
4470
2124
7003
3837
7552
9610
3938
6416
51
9901
1213
8282
2770
6734
5441
1067
6569
6919
6568
4381
790
4803
858
4361
1805
5213
3083
4073
6854
5558
9738
5222
1904
5063
8131
3629
3549
2360
8224
7403
4717
236
1650
5039
703
9828
5599
3746
3483
7337
7067
5450
8488
7463
8193
7913
2385
1597
5689
6099
7964
9499
2458
7190
8369
3445
3419
2919
3191
2738
8896
6136
9051
1097
6625
3507
5935
816
8485
8215
9341
9620
9534
1272
212
7664
2207
3895
7864
7620
3771
9921
3318
2778
8341
7650
7159
9254
810
9777
9855
1831
2317
9293
5311
7915
6079
2431
8844
332
8705
5305
1141
1404
1081
8882
5397
3155
6231
1241
6201
1202
9039
2928
9894
4514
606
1903
9110
935
9712
2151
1819
2799
2375
2834
3593
970
7885
2832
8177
1721
3890
4035
1033
3651
5584
5883
964
4892
490
1357
5453
7042
6290
5616
1979
6949
8062
9909
9639
8739
5137
5025
6471
6872
6988
1820
7000
1318
8872
3742
1582
2165
2750
2843
213
8534
155
7113
7299
4184
1289
2480
2794
6309
4439
555
9896
6500
3150
7225
4883
1405
7618
578
5562
2838
9608
6298
9740
7767
1237
1257
u
6381
5300
52
7132
560
4433
3675
1823
5857
1416
7452
3331
2050
8092
8021
122
2427
8535
2130
4185
3055
1526
1417
6917
3304
5647
6684
104
8198
8221
5656
7847
4281
6927
5409
5200
5939
8036
338
492
9750
9454
2745
9837
1118
7121
276
2460
9886
708
7539
1304
6511
4334
6989
9934
6429
758
627
9686
6899
9355
5010
3237
7678
2649
6573
2898
3181
9865
8226
9805
8385
5884
5659
5412
9395
8910
3392
8938
5057
246
2004
2816
7507
4835
4230
7319
3969
7625
468
1203
496
3209
400
7984
7289
8160
9731
2447
1187
9511
963
2478
9060
8863
1259
5788
9241
8905
1722
8886
5519
3000
6314
8379
8126
4894
2650
1894
4443
9977
907
7256
5417
6990
5395
3011
1479
9015
7040
4244
1480
8889
2342
7402
6324
2611
9790
4041
1224
6288
7869
3604
6028
4291
7774
7497
6540
8462
6345
5679
9414
6683
3770
2520
5317
2633
9680
167
7425
8856
2496
1620
346
9231
7218
5099
1536
7963
6264
1391
6597
4921
121
6747
7352
6116
5989
3321
9242
4011
4462
7437
9705
5725
6093
6051
1277
8860
9281
3882
4263
9565
2210
1786
8217
8127
4654
4812
1902
4845
9690
4750
2467
3977
7210
6259
7725
6930
6676
4441
9801
844
8478
5775
5517
9006
5633
4957
21
2371
7570
7871
6425
1459
6268
1471
5657
2188
6977
2167
2939
8063
9036
4115
2182
6065
6458
6620
3818
1003
8925
7320
1989
5946
5776
7712
9602
466
4210
9080
9570
7808
9882
5255
5700
61
7580
3306
9148
8987
6786
406
5826
4903
6255
132
255
8831
6118
8232
9576
5236
4054
4071
6031
5494
3666
840
6772
3440
7835
4770
4189
6537
6675
9092
6123
3892
5767
7974
3467
612
6674
5698
4407
9958
5024
4171
2610
4148
8208
7663
1637
5399
5292
2443
3881
650
6858
1965
7364
4982
3877
7838
4427
66
8760
6806
1654
3084
8259
1198
8384
5766
1114
state
4199
9115
250
7448
125
6001
7785
5381
6564
8849
7861
6545
3853
3341
5262
3006
9460
9955
8971
6389
9302
5916
825
750
4611
1886
8003
1200
3795
9028
9264
3501
6551
4685
2926
4181
3041
7797
9171
3560
5086
4752
7787
4586
2257
314
6965
1561
1286
6292
49
6546
9935
6529
4220
1866
6447
4590
3382
8743
7783
2882
4457
8438
3680
4861
1634
8097
171
5760
2813
5451
8103
41
4241
2286
3340
9657
6060
8399
2824
8906
7729
1599
3656
4595
6905
937
6601
8855
6972
7804
7508
9445
9354
5564
1032
500
5283
7407
2619
150
9230
6126
5978
3289
442
6514
4155
5709
2471
4084
3204
8227
2316
9205
6256
326
8605
6171
8476
9871
4360
1614
2419
5880
2652
1850
4601
9438
5446
3139
5929
9874
6647
9465
107
5920
7876
5043
1630
5799
6670
3080
8825
2521
8010
1950
831
3798
1234
9022
8257
5448
901
7702
6817
4385
1670
4030
4819
135
3183
2620
5752
6283
4599
919
5992
9969
2982
2553
339
7816
843
6072
6602
7380
3511
2942
616
7994
6022
4000
8296
9255
9833
7576
4359
553
965
7445
6827
8046
8277
7153
9408
9094
6092
6363
3167
9595
7701
9708
6926
5253
5867
1564
3539
8995
7671
5426
4398
1330
7398
4781
7748
8018
5820
9769
7987
8468
8302
9019
4368
3179
1627
2658
4069
6346
7317
4227
2840
5706
8110
4484
8666
4697
8800
7002
2905
2462
6777
2634
5301
5798
8883
6019
5367
7412
2078
2113
9622
525
8898
9103
2133
4096
7806
9413
6175
3113
707
8588
2736
3384
8464
6411
9372
242
3855
1411
5637
2238
3581
557
5485
5843
5550
3142
6853
2394
4620
4201
3033
7836
5103
4391
7972
6654
7544
7955
8031
2991
8075
9959
1678
9674
b
2805
330
3040
9839
7489
5212
8601
1191
3234
2698
1696
3737
8071
744
2741
2240
3704
6383
8583
6384
8796
9994
6608
3510
1170
2583
956
7595
1533
5944
7888
9471
3878
8122
5031
6052
6495
140
6354
3944
3512
5856
4355
9077
2066
1833
9527
5193
5179
4445
8289
1152
600
4744
4511
1716
9852
4156
8135
7457
2131
9702
5919
9017
4247
196
5023
60
1919
4852
556
2644
4567
8512
2884
9787
4864
4708
5597
7532
8099
8808
8315
7732
8930
6951
3741
1073
4560
6730
782
1398
3856
5941
9915
7700
2468
7978
3531
5351
9316
7762
8783
9072
1826
1556
9398
2605
6482
2502
1178
9221
1434
4405
3540
8720
5192
631
1541
5976
9596
8840
99
6445
1565
2356
3291
2105
8101
6465
706
662
1301
4219
7037
6464
9910
v
363
4314
3007
4621
6836
3974
6348
6222
4887
8582
6217
2523
4005
8744
6071
3143
7189
1844
8390
2026
2426
915
3333
5672
6104
5718
5586
5651
2855
7429
7151
1343
6736
5012
7579
2489
9547
2762
3613
8016
3984
4631
3697
635
1719
9506
9807
8792
4617
5795
4886
2053
9949
7854
4932
393
4873
1830
1236
6651
7088
6414
6501
7973
1403
7922
3554
8691
4232
7893
6091
9014
7326
1201
5070
8751
5733
3324
4605
3421
7324
8294
4168
2062
8737
9577
6535
5804
3144
6442
8689
6011
139
4207
6468
5813
4790
7117
2576
9319
7335
7215
6632
3398
6485
7858
5855
1700
7868
7674
3168
3156
8165
3387
8038
6560
8942
8577
5737
4571
9867
589
6424
6534
8827
8859
7258
7138
5487
9338
9451
1877
4190
8584
4721
6152
3674
9879
2948
7435
2875
5427
1305
9286
1589
6708
5003
9141
6083
9300
3645
5240
6420
3753
8576
1119
2912
2854
2136
1186
2261
8256
721
7720
1966
8587
5465
8394
6903
8619
9524
2211
2
881
5982
4984
868
2287
4267
6352
6838
5571
685
4673
8183
1893
25
668
1735
1964
5486
2451
2289
7484
7265
6226
4954
5501
4068
5683
2525
1632
9188
6273
4547
8549
399
6439
2452
8361
8454
5168
4978
809
6645
9616
6819
6299
1071
8740
4002
5406
6799
2446
6506
3699
3584
5375
1266
9390
6045
6378
2398
1645
6433
224
8382
9362
9358
4473
940
3495
1757
537
263
8172
5900
7726
7046
8943
8033
9042
9249
8080
5534
9540
3634
6059
4159
9660
3954
2219
6140
9704
8486
3414
7304
9025
6586
9130
2776
164
4655
7045
4332
7848
4116
2234
5072
380
9655
966
2958
6740
2815
3962
2463
6154
7745
2071
9606
6536
8023
4237
6356
5646
5824
9864
7718
5404
7414
4065
4494
9791
3309
5579
648
834
1050
5507
6682
2413
s
142
9365
6953
1922
9364
3009
7331
2246
7251
1290
8210
5429
143
5370
630
5006
9075
1600
6821
5545
1899
6033
1872
3368
1142
745
1574
6515
202
8595
1028
2557
8966
6548
2917
7207
3249
5280
3367
3293
4588
86
1871
6613
5428
9978
6349
2639
3197
9356
2537
1333
1643
5211
2230
8876
9703
1906
5145
5274
4749
1505
3545
8027
4513
8791
198
5974
8002
4061
7231
7240
7734
4109
6188
5038
1183
6833
6698
3769
4856
8548
912
2618
4890
6387
3829
4756
4215
4213
1294
8575
5035
9555
4983
838
6481
6187
3846
550
4170
313
2306
2049
1482
8049
5
502
9257
4313
9369
5877
6456
470
7675
5462
9609
2607
7574
7309
6789
7193
9714
9611
252
5905
636
9082
3230
637
8722
536
3012
285
2789
165
8108
3850
856
##c
4399
2110
2655
9348
6155
2159
5322
1706
9789
2871
517
1076
3519
7610
5324
3832
4119
8457
6467
783
2957
1788
854
1576
4475
4734
6553
2533
8066
808
2545
8153
5136
9573
8521
8264
4985
6311
4367
9744
1095
9190
1041
373
7245
5922
6407
1159
9351
9475
5458
3119
9299
8742
7116
2171
1347
2034
3682
2412
271
3475
5241
9440
5359
6069
9202
8503
5302
832
452
3658
9808
1939
1804
7529
4732
1251
137
6170
5740
9691
6957
6310
4694
8639
8799
9782
3071
4553
9213
3939
9108
6406
3004
3848
673
7966
872
1233
4009
4177
4336
1207
2574
2760
3713
1775
5258
410
2810
6390
5492
2546
936
1446
3239
7942
9812
2479
7953
8138
3785
6811
1104
4926
1890
1385
7471
1677
3272
762
5209
8940
1824
3562
7616
5339
5112
5915
9268
8266
5353
374
4724
4238
6258
5142
2059
5447
6983
1062
6014
4307
<
1455
6804
9621
3222
8262
8281
3130
1117
1537
8043
1430
3784
9415
3349
2137
4034
999
1260
4268
9189
3145
##u
6204
9209
4302
995
5865
6125
8602
1133
2399
6147
3252
6339
9554
8362
5148
2935
9432
9480
9349
1414
7815
2740
8
968
1759
194
7856
2936
439
9107
2388
8376
5649
6909
5374
4745
9604
6150
3310
9054
4647
2442
2332
7757
9055
7318
3940
289
2925
4260
5281
2536
7692
6101
4285
1460
6428
1985
899
388
7375
4950
3981
282
5172
801
3766
7933
1413
7500
6041
2594
1166
8975
8035
8738
8348
5316
2112
4999
8180
8418
2417
8732
2304
3190
3160
4628
2126
4540
3171
4838
1374
4843
9289
6749
988
9973
3752
4248
1834
2635
1569
2376
9123
244
9721
8396
8337
6532
5687
4794
2418
6373
3284
6907
4947
3417
2959
8179
7578
9485
4597
2729
9753
2405
4032
4802
48
2732
4066
1358
3159
7176
6717
7416
4022
8563
7449
9557
8313
440
95
9155
1375
4191
3523
1094
7979
992
9559
8465
9452
6265
692
1789
7600
4927
7948
3728
1689
7466
2558
8640
1092
8671
5636
3251
5041
6968
218
1596
2144
3439
1546
3657
6889
6027
507
9982
4736
3342
7287
8750
6639
9932
3337
6184
9818
4485
8252
3690
3551
7476
5295
3681
3037
9192
3107
1464
9851
4869
308
6922
9809
9050
7105
5401
266
7515
1262
9920
4408
8706
6528
1982
7415
8675
5153
7432
8405
5899
5695
4315
2404
5875
3202
1022
7440
566
7615
6921
664
9401
7950
2216
4963
8450
6341
7270
5844
888
7516
1449
3871
6408
5598
3609
1815
7776
1891
3388
2227
4512
6274
623
9043
7517
7602
6843
2465
6496
6151
3966
7214
4087
3116
6285
6057
9953
4681
9373
2303
8314
2800
9533
5769
7826
3046
9912
9197
2803
3153
7985
111
3671
6735
8564
1972
4945
243
1604
3416
3021
7385
5115
2046
9768
6878
8088
2987
850
1443
7321
1225
4767
6368
625
7730
6847
3831
1422
3642
9990
6081
3059
9448
7594
6138
5102
8309
3718
8436
1573
9569
1683
7773
4824
4733
5602
8878
8093
3688
574
2441
9222
8834
6492
9052
3847
2512
9070
8594
7477
8197
9846
942
9479
6588
404
8843
3138
7386
6263
7090
7930
4440
9581
8359
4727
3911
532
2969
8078
1108
8566
3348
4305
4497
2887
7553
7926
2934
9814
725
6837
3092
4651
3594
944
7593
3018
8688
2724
514
info
9519
3945
9947
6193
6277
3574
126
9095
9269
7713
5524
876
9821
6906
9535
8321
2976
1026
2038
6122
7931
1136
4813
5594
8885
9129
4142
70
889
3182
5913
3014
8684
4317
7813
939
7290
2529
9407
9996
3985
1329
6127
9503
6156
6552
8680
1800
3622
3726
9938
8918
4047
9825
4143
4549
3811
4850
5080
3631
2248
7665
6603
9226
4103
6121
1401
8244
607
3715
2002
3597
1681
7897
2965
8176
453
9383
1996
438
5527
9869
1656
7269
1261
1796
9386
3134
147
5266
713
6839
9983
1988
7467
7660
4256
7421
1975
5792
3563
7925
3868
9203
1801
4125
8009
8231
2514
1083
820
5299
7148
1384
6741
3109
8635
7458
8106
1319
3052
9493
7126
6236
7436
428
83
4469
5704
6105
331
247
6412
2208
7754
2343
3051
934
4524
5027
5783
303
6770
2268
7028
3016
7077
5763
1897
5433
9537
2041
4123
7860
1027
3951
4318
3112
1827
4288
5438
8141
7372
2275
1496
9352
7147
2175
1383
8181
2045
2476
8238
4138
8287
8973
5777
1867
3487
2352
1158
2058
3496
441
3374
1376
8585
621
5818
7782
7036
7465
9478
9134
5143
3541
4231
1217
3776
591
st
4099
9279
7845
5932
5921
3836
6403
4912
9143
3397
1424
2844
8848
487
9785
6076
1870
9861
583
7252
3389
1957
1679
369
984
4676
2660
infod
6918
5582
8392
1754
3163
9634
6073
7029
1263
5515
5394
3810
1334
7192
1368
911
1043
5835
4667
6725
5983
2209
2701
5791
3455
1181
9091
6242
5677
3537
5882
4246
4924
7001
7376
5908
8461
759
7769
9784
8520
6755
8764
9489
2992
55
813
8308
4796
501
1984
5069
6785
2949
9109
1429
9571
7853
5960
3628
6074
1293
7512
3316
8157
5083
8733
1336
436
7598
2279
8773
7710
8679
216
8409
3266
3132
409
4942
2554
1389
3292
7668
1135
8513
4536
622
2830
5308
8484
3305
1373
7087
253
8875
904
5830
9347
3787
579
8812
5721
9376
2522
9972
5235
3813
2772
7213
7637
8017
4377
7233
7550
3625
6025
2788
9312
6180
2842
9419
335
6070
3343
5757
9282
6398
3783
4417
2580
8852
7142
7306
7708
2497
9849
2350
5953
4757
1023
9
945
7092
9217
6455
5911
7764
3345
3739
5260
1018
2003
1326
7530
7597
2956
4234
1875
6900
2585
1087
259
28
4515
1034
8636
3235
1928
5744
33
8894
7344
3595
3261
9486
8869
7204
9924
6865
9031
7034
9156
8725
5542
3872
6024
6491
1204
1717
8846
7428
2786
6616
7032
4277
2307
4178
7737
7878
7741
8012
7867
989
6249
6697
1622
6696
7642
7586
8353
5443
3108
7262
3749
3650
5416
4521
6401
157
6870
7802
4395
8439
3935
3759
9813
2193
5376
2057
3065
6452
642
5282
9530
9923
3005
1392
4996
8371
5838
8962
1695
3073
7509
8887
9617
4345
8917
9682
3462
9629
669
772
1149
5238