[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
,
0
1
2
3
4
5
6
7
8
9
=
a
b
c
d
e
f
i
l
n
o
s
t
u
v
##7
##0
##2
##1
##6
##5
##3
##8
##9
##4
##n
##f
##o
##b
##t
##a
##e
##l
##u
##c
##d
in
st
va
##fo
##te
##ate
##lu
info
state
valu
value
infod
infoa
infob
infoc
13
14
11
12
10
15
17
19
23
22
21
16
24
20
18
104
127
83
138
107
144
92
149
125
110
101
136
121
106
111
147
131
139
86
115
81
141
82
130
137
146
140
109
95
112
114
87
119
94
148
108
143
91
132
120
66
122
124
65
89
93
135
116
142
88
68
117
126
118
134
99
80
85
97
129
62
59
57
133
105
102
123
50
67
90
96
51
61
103
64
128
53
70
84
98
58
113
76
72
100
52
77
71
74
75
145
63
73
79
56
78
55
60
69
54
150
39
38
40
29
32
31
30
25
41
27
33
44
49
43
36
48
34
42
45
37
46
26
28
47
35
169
159
245
199
230
153
216
229
191
155
207
205
236
163
157
224
194
231
158
171
178
213
176
243
182
239
174
204
179
215
226
209
210
160
168
244
220
218
196
172
227
161
175
214
192
185
173
248
181
156
183
154
249
152
198
190
240
170
193
166
177
237
232
167
217
228
225
247
195
219
201
235
208
151
197
233
238
187
189
180
221
222
242
186
202
223
206
234
165
184
162
188
200
241
212
164
211
246
203
925
1449
1241
1360
1473
1430
1304
537
1071
1367
1110
1063
623
812
1117
1194
668
1109
617
981
831
659
1348
579
1302
1211
1219
1225
743
1395
1149
896
678
856
922
1253
1416
1408
1101
1324
1026
903
606
1405
1096
1123
1480
932
1259
1061
1316
959
1224
1333
1044
1060
1314
1397
1481
857
576
968
777
757
1497
877
655
1338
833
862
1152
1375
629
1384
1074
1107
1317
1312
1176
1341
1273
1070
1106
1012
1396
1342
851
701
760
735
1274
1381
923
1116
654
686
674
518
528
1388
1369
1476
1399
1466
1207
1166
682
707
1046
1250
1014
1393
1401
1198
1426
689
993
625
1025
1287
718
780
1141
729
1412
1371
1373
870
1193
1083
1084
592
591
511
520
558
1491
1319
1370
1482
651
687
900
619
538
1459
790
1382
1104
1418
821
1195
1086
1327
652
684
594
646
691
1387
1440
1306
1095
1197
942
913
683
593
573
1057
634
560
551
543
1100
816
1092
1146
912
1320
661
881
802
1293
504
717
1272
1385
1443
1495
1217
1472
822
666
1221
1266
1269
515
984
761
1278
836
920
1301
871
664
1170
1346
530
716
1457
630
928
1490
1065
868
1155
828
1467
656
1353
973
501
506
679
703
586
756
557
1042
1386
1494
952
1124
872
943
1435
1321
1228
936
680
809
960
541
838
1077
1448
929
1154
813
819
1410
827
919
1242
1163
1189
1288
759
562
540
924
1111
1474
1400
882
590
598
1034
536
768
604
1271
1216
1470
860
1147
1488
1433
1249
887
976
597
508
672
847
1135
765
771
564
1212
945
1087
1209
1220
884
571
906
982
772
698
545
1444
1256
1258
1366
1113
1411
1468
1122
1431
917
1294
572
500
670
961
611
644
1282
714
866
1307
957
915
1204
890
934
1425
1263
1185
1183
622
615
614
779
799
569
788
559
1270
834
1102
1069
1313
1153
1379
950
951
1329
1202
939
519
642
1280
1285
532
1131
728
753
794
785
699
1114
865
810
958
1142
1265
1181
998
1296
700
731
796
554
1277
1493
1215
1125
944
1484
1208
663
930
624
516
641
706
766
525
776
631
737
1047
1079
1067
864
1099
1489
1081
650
931
880
854
977
1053
1023
1237
905
966
647
643
848
587
1001
637
633
1498
1257
1392
824
1460
1098
1483
1326
1175
1179
1332
985
722
710
1048
1049
1447
1499
1011
1064
1156
1308
1463
1191
1196
1437
1355
1423
1424
889
801
979
1059
677
969
534
583
584
798
567
1108
1414
826
1088
1351
883
1186
1231
1233
1238
509
1037
1130
730
601
608
1040
1017
1010
1018
1419
956
948
1203
1229
658
1173
1262
1340
580
1133
527
774
745
749
784
1043
1214
817
818
1372
940
660
665
1359
1343
1052
517
613
719
750
1458
563
830
1073
1496
1112
1413
1376
1374
1465
1128
876
1199
1168
1177
994
852
1230
585
1132
1007
1004
1275
1446
1365
1462
1145
1247
1240
978
1028
505
902
635
697
1019
1404
1205
1227
895
898
1427
1422
1268
1039
649
845
983
720
724
752
755
565
547
832
1464
1094
955
946
1223
1350
1171
1182
800
808
626
577
904
967
723
524
747
1450
739
1442
1445
820
823
1309
1127
1201
667
669
893
1169
1164
1267
599
1056
1027
1139
839
1218
1068
1407
874
918
1357
1349
806
1290
1058
1006
521
748
548
835
1078
685
1187
807
1295
507
965
610
842
746
690
1500
1276
1103
1151
1121
873
879
1080
995
859
1291
621
570
1020
676
514
616
1038
1284
1003
770
711
1456
783
837
1478
867
1305
910
1246
1243
891
935
1428
1184
909
645
533
989
1134
526
778
712
758
1041
1279
1255
1016
1015
1363
869
1120
1126
1248
1354
1162
1161
1264
1180
1298
907
581
1137
782
602
1252
1315
1150
911
914
885
1261
999
1330
535
708
764
1002
773
696
1072
1013
1475
811
829
1140
1432
996
627
1339
502
1032
763
727
1008
754
1066
1390
1378
1144
653
886
1174
803
1292
595
1024
612
648
1377
875
1226
1358
1420
970
1050
1055
1236
769
529
791
1368
1364
1471
1097
947
899
1167
1429
1172
618
704
588
693
1380
1210
861
1157
1461
1406
1486
938
1188
997
1054
962
510
512
846
843
762
742
744
736
738
734
607
605
1076
1082
1421
992
1035
1289
721
725
1009
741
632
566
1415
953
1192
1323
1160
1260
675
849
986
740
1453
733
787
1213
1303
1403
941
949
1436
1030
1045
1389
1115
1477
1143
1200
972
975
1331
1232
1283
522
775
793
789
1251
1254
1090
1091
1190
1485
858
1297
575
1000
546
926
1391
1085
1345
804
578
513
1005
715
927
1105
1417
1328
937
853
974
1239
1281
582
1451
603
1325
1244
657
894
681
1334
1022
963
1031
705
841
523
609
1300
1438
1434
855
1336
503
1036
844
726
636
638
797
695
1158
1051
901
1286
988
713
751
1455
781
544
1311
825
1402
1487
1352
805
640
980
550
600
549
1318
954
1089
1356
620
628
1235
531
1138
1362
815
539
709
850
795
561
568
786
1383
1310
1394
897
1299
1136
552
555
553
1118
863
916
1245
892
1344
589
1119
1206
1178
1033
1337
1029
1492
1469
878
639
732
1361
1398
1234
840
1148
662
933
688
1335
671
767
1075
888
556
1441
1093
991
987
792
694
1322
673
964
1452
1165
542
971
1222
692
1479
1159
574
1062
702
1409
1129
990
814
908
921
1439
1347
1021
1454
596
250
2394
1698
1763
1537
1636
1567
1598
1764
1820
2094
1682
290
464
1995
2169
2241
1855
1560
1502
409
2135
1746
2447
1666
2458
1785
2040
2263
420
2076
1949
1798
1757
1674
2254
312
447
1691
1740
2276
1670
2351
406
272
482
2091
1885
322
1996
2167
2366
2431
1824
1856
1939
1506
261
1994
1555
2316
2432
1521
438
458
1592
2057
1631
2133
2044
1605
1923
2486
1986
1984
1516
2213
1847
2417
2303
2249
2244
1587
1613
2142
2496
1981
1904
2371
2412
1649
430
2452
2165
2294
1713
1780
1796
1969
1928
2329
2334
393
308
444
497
437
484
345
1596
1576
2043
1607
1724
2280
2479
2080
1898
2468
327
432
372
354
2309
2053
1760
2157
1726
2144
1925
1816
1832
1544
1529
1669
2322
1958
1954
1510
1879
2226
399
418
277
335
343
1697
1999
2308
1915
1718
2181
1737
2482
1810
2498
1520
1905
1776
2172
1899
1652
389
419
275
366
486
342
356
2302
1534
2293
2070
2364
1572
1574
1940
1582
2045
2448
1736
1672
2084
2335
1868
2340
2031
1509
276
1590
1538
2363
1630
2311
2395
1686
2184
1962
1610
1836
2370
2178
2474
2014
1802
2426
408
297
492
489
429
377
285
2450
1991
2292
1632
1571
1947
1781
1742
1745
2260
1689
2272
1614
1752
1661
2284
2087
1890
395
382
407
317
370
460
1536
2162
1910
1559
2367
1585
1583
2439
1829
2398
1790
2159
1965
2275
1618
1751
1985
2475
1511
1976
1978
2228
1860
2022
1507
328
316
258
414
498
340
268
282
472
1595
1916
2077
2361
2101
1687
1722
2145
1922
2487
1547
2259
1951
2357
2345
1844
2003
391
383
291
279
338
440
379
281
284
1690
1693
1591
1531
2298
1550
2051
2319
1711
1768
2430
2393
1743
1794
2152
2261
1601
1967
2406
1932
1772
2324
2019
1512
2025
2061
1653
2129
296
294
443
495
455
1532
1535
2247
1712
2136
1821
2399
2208
2480
1569
1541
1701
1708
2258
2477
2010
2339
2384
2424
1869
2026
295
298
300
304
491
346
375
465
468
264
1997
2291
1913
1553
2315
2435
2046
2099
2445
2207
2180
1964
1721
1725
1545
2497
1931
2283
2015
1804
2215
2218
2229
2060
2062
1623
2115
329
306
442
266
288
1695
2457
2455
2300
1918
2059
2369
1578
1710
1719
1788
2156
2107
1606
2443
2185
2183
2189
1720
1754
1739
1818
1524
2400
1709
1779
2194
2016
1975
1862
1863
2343
1650
2035
255
410
494
426
425
456
283
1990
2306
2304
1533
2161
2168
2299
1557
2052
2058
1946
1822
2098
2202
2182
2279
1854
1813
2401
1703
1937
2281
2255
2237
1624
2001
2418
2122
2463
2037
417
273
330
333
446
449
462
477
1692
1699
1594
2456
2307
2072
2055
1570
2130
1826
1791
2106
2109
1753
2147
1852
1858
1814
2407
2402
1933
1774
2320
2196
2350
2358
1972
2387
1875
1805
2069
2347
1841
1849
397
381
252
274
434
483
341
427
471
359
2454
2305
1912
1633
2240
1943
1944
2318
1767
2266
2268
1966
2270
1735
2484
1548
1900
1903
2287
2253
2193
2198
2355
2386
1870
1803
2428
2029
2235
2346
1657
1622
1625
1629
1888
1643
384
299
311
315
278
334
361
371
267
2453
1917
2071
2078
2074
1945
2097
2209
1728
1750
1756
1755
1815
1831
1834
2490
1706
1667
1775
2321
2179
2174
2199
2018
2353
2385
2389
2221
1865
2024
2238
1644
390
320
416
422
1694
2297
1551
1635
2312
2313
2049
2155
2095
1600
1683
2203
2187
2278
1612
1615
1921
1732
1731
1830
1543
2493
1982
1906
1705
2326
2177
2175
2173
1956
2197
2013
2359
1973
2330
2217
2231
2068
2415
1640
2462
325
307
412
411
436
369
262
2166
2362
1579
1783
2131
2139
1766
2436
2151
2440
2271
2140
1927
1857
2495
1908
2403
1934
1777
2379
2478
2333
2338
1893
1809
2429
1886
1889
2004
1504
319
445
488
373
289
470
1552
2075
2079
2054
1637
2134
1741
1799
2150
2108
1604
1681
2205
2204
2141
1733
1817
1525
1907
2404
1664
2372
2376
1679
2250
2470
1952
2012
2085
1513
2331
1874
2211
2223
1866
1659
1621
2111
396
398
400
404
321
431
364
1599
1911
1919
1914
1558
1554
2056
2360
1941
2314
1581
1588
1717
1786
1762
2042
2269
2096
2103
1707
1930
2374
2176
2471
1953
2381
1892
1808
2210
2427
2236
2348
1884
2008
1645
2113
2461
2038
324
301
253
271
496
365
423
475
478
357
1530
2073
2242
1586
2437
2397
2391
2154
2201
2146
2409
1704
1773
2375
1671
1955
1872
2420
2230
2233
1840
1846
1882
1883
2414
2119
2464
1505
402
403
259
415
337
487
428
350
352
355
2296
1639
2246
2248
1784
2137
1747
2158
2262
2105
1609
2441
1960
1929
2499
1909
2089
1891
2065
2005
2413
2117
2116
387
305
481
466
265
1696
1593
1993
2160
2365
1638
1634
1575
1716
2434
1827
1680
1684
2442
1968
2277
1738
2491
1523
2289
1971
1974
2332
2380
2382
1877
1878
1895
2423
1658
2127
2121
2123
380
323
303
331
363
424
269
2301
2163
2164
2295
1948
2310
1580
1589
1715
1782
2132
1797
2153
2090
1608
2200
2206
1963
1727
1616
2481
1566
1980
1901
1700
1935
1662
2373
2325
2288
2252
2191
2088
1876
1897
2214
2224
2422
2027
2028
1620
2007
2110
2114
385
270
499
485
454
467
476
1556
2317
1765
2433
1825
1748
1795
2104
2149
1730
1562
1568
1564
1837
1936
2378
2327
2192
2195
1515
1518
1970
2383
1873
2216
2227
2425
1848
2002
2419
2125
2128
1647
2030
386
326
313
257
336
433
360
457
450
451
474
2459
1998
2290
2265
1685
2444
2148
1734
1565
1838
1839
1542
1522
1988
1677
2170
1959
2017
2081
2021
2023
2063
2465
435
368
347
453
461
463
280
353
2245
2243
1714
1792
2267
2102
1619
1811
1563
1835
1938
1665
2282
2251
2473
1801
2064
1642
2466
2033
2034
314
251
469
263
473
1584
2438
2093
1688
2186
2274
2143
1540
1526
1983
1778
2328
1977
2009
2118
392
260
286
2451
1992
1577
1787
1789
2390
2092
2449
1617
1812
1819
2494
1989
2405
2408
1770
1771
1678
2256
2083
1979
1651
1628
2000
2126
1641
2460
2032
401
332
339
362
348
459
1823
2047
2100
1920
2388
1807
2212
1654
2120
2124
1508
394
302
413
493
349
378
374
351
2368
1793
2446
2485
1561
2171
2286
2082
1894
2219
2232
1887
2467
310
318
441
344
1597
1602
2488
1833
1546
1549
1660
1673
1957
2190
2352
1861
2239
1656
2410
2411
1501
293
2050
1573
1749
2041
1851
2483
1702
2472
1950
2356
2086
1517
1519
2337
1806
2225
2234
2067
2349
2344
292
479
2138
1603
1961
1729
1859
2285
1514
1896
2222
2341
1880
388
480
376
1942
1828
1850
1528
1800
2421
1864
2006
1648
2500
1503
405
254
490
421
2396
2264
1527
1902
2377
2323
1676
1871
1843
1881
256
448
287
1761
2048
1926
1924
2489
1663
2336
2342
1842
1626
1646
2036
439
367
2188
1611
1759
2066
1627
2039
1744
2492
1668
1675
2020
2257
2220
1867
1655
358
2476
1769
2416
2469
1539
2392
1723
1853
309
1758
2273
2011
2112
2354
1987
452
1845