[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
5961
7259
5071
9177
2978
9334
342
5503
4590
9623
4262
8760
6460
732
8324
7329
9561
604
6651
9041
6347
3837
1039
6403
9674
5322
3444
7977
3093
6346
5200
7986
4448
4748
3696
3168
2755
4208
1789
251
6584
7430
9892
5910
1349
4885
8819
7928
742
1381
3895
3207
4982
3912
1558
5728
5142
8895
5193
1863
8029
1725
4063
3971
263
2109
900
1639
3670
3457
6680
5639
7459
6136
3741
5879
3117
9826
412
8904
7669
941
1231
9902
3661
8156
6369
7705
7764
779
8979
3194
195
5945
402
5703
3455
3782
3969
6431
3152
5720
4952
5709
9936
4198
9968
5655
4098
9532
1394
6823
7283
1984
8687
3078
1304
1057
6103
4932
6254
2813
3
6049
8447
2364
528
7312
5532
8468
3968
6867
5262
8064
9884
1296
8448
5840
3962
1624
6216
2928
4518
7265
4927
3125
485
2777
6086
7694
7515
6730
6218
9686
173
7483
983
5955
9080
2068
2712
7344
9582
5684
3665
6133
2557
1669
853
8334
4910
3464
8808
8358
4782
9481
2584
7534
2196
9908
5968
8921
2945
3855
1839
1239
4131
9776
3739
7490
2599
8124
9443
4288
9295
5508
7302
7966
9221
4498
4810
9701
8173
1124
2632
7985
9273
7691
4900
1072
231
5190
4542
1731
9207
6054
5607
5438
1898
8230
7835
887
4488
8554
2817
306
4563
2222
8768
4246
2894
9611
5113
9747
1151
763
4255
1030
1343
1501
9361
2348
1015
2052
1052
4591
8348
2956
3521
1642
3189
8537
585
5439
2054
3819
223
5536
3127
6269
2759
248
8440
1607
9152
3821
5693
569
5935
9252
5896
1428
1933
2590
7555
7222
730
1171
5218
2191
7504
7221
5214
2047
6963
7203
8929
6812
9046
1536
8524
3179
8423
8627
2994
9559
259
8625
3345
1616
9632
4203
42
4745
5661
6806
1300
7894
262
5712
1696
2744
7003
217
8126
4769
1761
2188
5206
2603
4792
8911
4292
7426
3783
3342
8214
7923
868
7993
3245
2198
8944
5452
1143
7141
5817
1705
7431
5897
704
7880
7118
9117
464
6688
2609
345
5493
4529
7116
5535
2491
9736
7593
5079
1551
8190
2447
2149
8189
4760
6879
1267
4178
1476
5319
3701
5031
9440
9513
4798
125
1729
3720
7982
4979
230
787
3266
1783
5947
3900
1636
4260
1666
8856
5876
8389
9398
6088
3732
8167
3415
4303
329
1485
2142
523
4844
7650
851
6528
4322
9127
8916
7797
7270
3181
2578
4677
9975
3048
3618
2193
6742
3772
4991
1418
3862
1730
2944
62
7298
3631
5004
198
5967
165
9459
4869
35
1234
873
6980
1680
8433
7738
7103
2051
6599
6632
268
5226
9007
7808
9182
7951
5924
7123
2490
624
1205
8088
6743
1452
9860
590
7388
5837
458
7785
267
580
6320
7530
189
7626
1185
1748
2265
5626
7717
5070
3786
8452
480
4106
2873
8831
2211
7689
496
6513
8950
7224
7024
3271
3218
8882
2083
9181
3950
1355
6905
870
2303
1451
1922
98
4949
4864
126
9806
5039
9391
9843
9819
4527
203
2130
9550
6762
8056
2864
6889
8072
6966
4826
7749
7352
3166
38
4350
8399
7232
1821
1935
8617
3794
5738
2285
186
8376
6831
4778
3209
4984
9925
5722
6505
8084
8476
3137
1087
2565
6043
1005
4742
3000
8243
8239
1318
7681
8363
1490
5946
5900
2009
2064
8040
4445
364
8112
8335
2989
7545
3657
9990
3340
142
2897
2558
8026
2666
1999
7878
7971
7636
9149
2042
6115
6351
622
249
8516
3957
5422
3490
9365
9426
9226
6559
4995
9071
9619
2313
5068
7325
9447
2451
7646
8244
6411
8672
5119
9030
6543
9488
2957
4074
1953
205
2012
1321
4483
3460
2926
6785
1840
8307
1491
4560
4784
9212
712
6418
6466
475
145
9665
653
670
3135
2781
4561
7569
8141
4774
3523
4654
5995
4962
9464
7905
8843
1623
8857
6070
7968
7196
8829
5421
1372
1985
8467
671
2342
6186
6869
4078
7310
5401
5567
4386
6259
1135
6026
2133
8862
8593
3980
6855
7897
7575
8923
4736
8807
7904
9286
2849
7398
6715
4138
2825
7937
5426
4214
3959
599
9525
446
8117
4043
8818
8398
2853
2881
2315
8521
4640
6417
2419
2856
2870
5785
764
9072
3159
2403
6352
2120
7114
3013
2040
7518
36
1682
442
9691
5048
8295
7129
2065
8013
9764
1312
2605
2145
5157
6242
1582
2807
6722
3077
4538
6763
3027
5180
6974
3428
2486
1289
9294
5277
944
5252
6566
8142
2076
5899
3632
6699
2496
2536
6739
912
9115
7665
3944
5478
295
2735
6760
8187
5652
1531
9748
2693
1100
2132
1910
7803
9162
9924
7657
2667
6432
8662
9314
4015
9107
4818
9192
5041
5775
4369
817
741
4921
577
4536
6177
8346
3987
1966
156
3649
4631
6808
9957
9520
7359
630
9311
7307
3870
6295
5476
9774
7538
5204
9909
2521
8907
6073
880
9370
4419
3676
386
6853
2011
2655
2613
2889
1357
5118
9824
3847
4351
4707
3280
3811
5599
6694
3807
1592
6641
7171
2406
3349
8828
982
1664
3422
1929
8127
8975
6331
5350
4367
1925
5395
1608
2753
7401
9142
3875
1715
6326
7544
6332
4206
1805
8928
4809
5287
2857
2290
2118
3242
2929
3981
1454
4379
2136
1126
3615
5182
8261
2100
7541
5823
2972
9349
2386
7436
6567
5232
6919
4838
6002
7965
46
998
4454
9385
3992
8789
6706
4699
5865
9151
7631
4468
6582
2339
8689
9920
665
1790
3414
7075
1578
9271
8341
9514
6809
2327
6664
1364
5140
3332
2542
3303
557
2107
3219
8927
1737
1380
3014
3742
2414
374
3792
4617
7102
8020
1275
9543
5268
266
3901
1200
4056
6548
7456
3998
8678
5074
2194
8838
6240
9919
1685
2630
9670
2961
1644
2025
9174
5569
2979
8186
1944
9700
648
6800
9373
4711
8102
5286
6114
4612
7440
8852
5369
7885
3760
9445
9678
5647
2002
9915
4038
1129
1415
1111
3478
7416
1547
609
6795
8329
5431
1036
1561
4931
5734
4665
7320
7137
8407
7296
9000
1544
4251
4986
5053
8030
9912
5242
4217
968
8571
8010
3420
6008
7687
7040
4566
1542
1865
525
1757
6885
9029
8138
8123
7920
4865
3822
9587
3042
6703
4420
3799
2450
6293
3396
455
3988
2499
7001
7025
3500
692
9535
8291
7304
2808
8879
7855
2546
6771
5026
2437
466
2727
5759
8200
3273
1062
8898
2337
5993
3546
4418
9033
8487
9014
8977
2084
3109
5753
5133
3279
9296
1896
7122
6928
6661
3754
1686
1733
9657
4357
77
1758
9059
8338
3410
2869
8605
3294
7019
7180
6429
6550
9813
2545
7445
7671
573
5270
2460
6569
7677
4733
7695
7154
2815
6672
97
8108
9269
9085
1654
4657
685
6645
7708
3566
3826
2150
2760
936
7187
549
8589
6281
9807
9137
3797
7081
1261
9163
7552
4205
2157
6013
1385
2697
1279
5101
6894
3130
7353
4849
400
9799
9065
6079
6277
5355
9781
8955
7429
4192
9201
6618
1859
5522
2525
8253
5018
245
6065
4687
276
2645
9298
3012
8354
1878
545
1987
1897
4293
553
5782
7127
2650
5744
8754
5862
1870
2046
1350
2452
1604
5250
1744
1167
9343
6975
4950
2910
1346
5642
6175
6236
2105
4059
9857
1176
9358
8824
8644
509
5093
683
9839
4158
6019
999
5916
5784
2060
8868
3480
6951
7939
7132
8787
1657
9020
6150
5058
9928
4540
5052
1949
2091
7565
5903
3737
9434
6483
1362
9621
1867
9348
4157
3891
9809
9478
5777
2572
3593
6304
5174
4329
6925
6294
8188
3006
7536
9986
2912
5340
6952
4361
2079
7628
6805
8837
5317
5471
4204
6220
8197
144
4660
2104
2752
8515
7537
9877
626
4816
9921
3197
1085
9469
1459
3787
5754
5653
2333
8865
6871
1825
5149
4115
2308
7900
6390
8277
1475
9333
3704
356
3236
6024
1903
5062
2975
995
1954
4764
4712
5482
1368
8508
421
4683
3237
2244
1836
3766
3372
1001
8885
72
7929
8120
2277
8538
2942
3711
290
1921
5266
9011
9439
6129
44
9932
1923
4475
4129
3955
6623
5275
9627
6802
6578
8178
9894
2408
9709
6917
9943
8412
1907
5869
5676
1593
4356
1188
6857
7991
5937
4632
9095
9184
4416
6363
2169
9101
8753
2114
5203
2319
3623
6020
6979
3868
8323
6707
753
1936
7449
8397
2378
8322
4943
6412
2402
9945
5464
7056
3729
2455
5548
9019
1962
1684
1530
1808
3905
7356
5555
4169
6391
7264
5751
3789
8388
4167
6665
2086
1566
6830
7606
7289
9194
4708
5940
4567
9254
4431
3028
3056
2375
9008
7408
4332
2074
5932
7571
4663
6000
755
6313
8951
7529
9154
6983
6191
2585
6434
3350
3708
81
6471
9230
5818
6272
2990
8814
8022
960
6807
2898
3053
4058
9978
6676
4230
5237
5761
4402
3086
4615
9038
74
694
7066
2255
9823
9503
1043
1510
9744
4289
1473
6134
3310
8184
9198
6206
3776
922
6001
5606
8416
710
2526
1864
4701
6624
1316
226
3893
4229
8428
9553
4839
3691
3123
2385
9376
495
129
7659
3753
8725
8700
3524
6255
3806
1647
916
7439
9450
8042
3017
6229
5434
3863
3354
3221
1319
1396
7364
6898
6285
3307
4587
7193
3002
9457
7666
3355
8317
2532
6964
2776
635
353
2619
5072
9663
7023
1835
921
4929
3974
5302
5282
6090
4906
1988
5122
5432
4102
5029
5222
9538
9487
4439
9792
5771
926
2156
311
4854
5635
2669
2893
6122
7918
8609
5583
5460
9327
7177
5641
8415
2326
9782
2399
9078
5863
3412
8965
5324
1766
6862
3733
2446
7423
1741
7815
9215
2297
425
371
123
3531
5152
8256
369
2789
877
7373
1233
8216
9369
9356
2257
102
1833
9012
6436
1574
4767
7457
4768
2479
4124
352
5415
5634
8825
6647
2770
9667
8236
23
5588
9812
7237
9591
6044
6719
6552
409
2816
4633
4987
7479
550
9197
7105
2123
240
1160
6196
177
6791
865
6012
7246
1243
6199
6047
990
6860
9888
9821
1956
3124
7396
4824
2716
368
437
4978
8550
3640
6689
8204
5776
620
9001
503
583
974
4686
4644
5328
6854
143
1213
1441
7637
2538
1377
9981
891
2739
5541
6074
3550
5542
4265
200
4016
9838
3788
790
9989
5690
2134
6644
7683
9504
8283
560
7198
1260
9172
4666
3370
3512
1063
3122
179
6053
4110
5131
2964
5409
6502
8724
2500
3331
980
9692
8402
5931
708
8967
2023
9615
6973
4155
8036
4596
7027
663
3483
3834
7227
4121
9468
5308
6141
1590
3119
4437
4045
6627
2749
1948
909
4039
5353
5908
3389
558
9405
5230
9132
9831
1056
7461
1525
7210
2266
2577
6682
2356
8390
8074
4783
7910
8048
4228
326
6716
493
337
8632
8060
8105
8615
864
9996
9994
9266
9027
5528
5574
997
2461
6377
6387
7889
9178
8037
4820
272
7898
297
9940
6816
5656
5413
2886
6085
3356
6920
2579
218
9521
2976
7086
1632
5527
4120
1026
1822
8453
7950
7031
6815
4123
6181
5926
8736
9155
9216
3675
2044
4489
7115
148
4961
8741
1610
8936
3049
5748
8070
4040
9180
774
5716
43
748
4506
4652
3547
3035
6051
4075
6095
4593
9769
8603
3658
3226
5136
2304
2286
2987
8464
4716
1069
6303
4572
9288
9866
4455
5374
9279
4837
8519
6658
8874
9620
9942
9718
5410
3163
7372
8803
2512
5600
4642
6204
1555
4326
4076
9371
3064
1509
3344
3936
5760
6345
4512
808
4692
3796
5593
5788
6382
7262
662
7692
9032
2711
9310
3781
1674
7403
1795
8035
2014
3055
4263
4675
3292
5354
1663
8812
4320
5185
9121
2566
5035
7596
4163
2959
3964
7487
4401
5806
4414
1469
1818
2203
9235
2478
418
701
3564
5352
7133
2480
8430
1487
967
7491
858
8940
5518
3764
9515
8540
7142
5668
2155
8816
8557
6311
6798
7467
7737
8381
673
4086
9375
5736
840
7588
3975
1797
6725
7882
760
9062
6226
9585
7119
7201
5386
5592
1630
8642
8881
6061
4653
9680
5849
7213
7756
4888
6025
472
2962
2782
1580
9262
3150
3459
4671
8520
3115
8185
8667
7432
7073
9714
5481
7925
1928
1811
6279
6438
7522
9581
8427
2298
641
9518
6246
946
8602
2075
9911
7277
5494
5367
3465
7104
9695
5991
3758
9536
9755
2747
9881
7182
6185
7381
2334
178
5194
2737
3612
1553
1528
3495
6119
1423
8845
1114
6667
7686
5114
7419
6262
3295
9148
1048
9342
3022
7178
7124
2229
9882
6775
9710
1700
5594
7474
2984
8228
4511
903
7967
6605
1330
5877
7305
2232
513
2966
5278
4925
6433
9124
2905
4241
552
2745
4291
5958
9605
2208
3965
1961
933
565
7107
378
4941
321
564
5106
1975
714
4999
6372
5554
4895
2282
7468
4137
8671
1187
537
4353
3046
8159
5919
6948
4479
1554
7013
461
7735
288
8518
6850
5221
1110
132
7969
6828
1065
351
5065
2730
4094
4028
8420
68
3966
6256
2722
4281
7410
3643
6892
5512
221
636
9395
6231
2895
8383
7135
4427
7342
9793
8894
3112
5894
7166
7157
6208
6987
4135
6111
7798
8373
3492
8081
7510
6799
7715
7348
6104
375
5523
3517
2398
8227
408
8573
3598
5584
6520
2219
8805
4308
5962
1703
7206
6572
8686
1251
2748
6
6443
1034
151
5107
6781
8417
7071
8649
2024
7038
5141
7726
721
434
3558
7512
1977
6776
11
4793
8394
7698
6675
3254
2768
8509
8299
1339
2199
1281
2681
623
2221
5404
5820
7992
4889
4139
8481
6516
4739
902
9058
2802
5658
3591
9934
8192
1478
9482
1743
2718
7394
8704
2662
1443
2983
1220
2081
5893
2764
3814
6107
9569
2318
4977
305
869
6555
5948
3930
7911
6878
5942
4154
3305
8987
6473
6764
5859
1535
2444
9530
9675
6561
9225
2927
6610
784
3190
5951
945
3769
920
1096
1388
3872
8922
9694
6770
1943
1971
1130
8990
847
5368
7570
4725
4359
8650
3051
9626
515
5150
5195
7778
5601
736
602
6318
3032
2388
7269
6164
4435
9241
7553
9028
4645
9044
6260
7389
2996
4873
3092
1919
739
3857
5376
9301
29
2520
1456
3622
9313
5134
1157
370
600
5269
2689
3740
9143
5964
296
5112
5260
7096
1612
989
4799
2462
3596
5509
7660
7184
2470
3603
4759
9862
7627
4254
3244
895
1397
3762
3920
5343
8313
3111
1652
8215
882
1118
3204
2497
7063
7869
7567
4892
7824
3096
4398
2170
4476
4044
4259
9737
8393
2361
8751
2715
5525
4425
707
3856
8005
8588
807
8891
3756
3088
8121
6300
1749
6400
3951
6773
4913
3375
892
9284
7164
2612
6669
1826
4920
7473
7961
6731
9976
690
8982
1227
1976
8043
2089
4693
9382
9013
14
5254
566
9345
1477
8702
5458
241
1320
3276
5928
6113
9560
2041
8405
3368
1264
15
1471
4829
6067
149
9004
2231
7818
597
6374
8772
5814
9586
9125
2804
8629
1068
8052
4465
5433
1292
8612
4136
821
2908
2029
4749
5304
6142
3660
3060
836
1307
6542
9622
5934
6169
6028
1926
9609
3329
3132
8585
1328
682
6503
1583
5428
403
4096
6419
5737
8536
8505
5021
1662
9470
4403
4109
3851
4629
1181
5155
9283
2517
8125
1442
2819
4751
8093
3265
136
6563
7172
9889
2967
9522
9381
6989
6639
6933
7293
5239
543
76
8691
6016
854
3869
117
174
6774
1148
7963
2890
4323
7633
7887
1121
9372
1462
4005
3299
651
4087
3382
9493
508
9389
2949
7261
8915
4248
9362
9565
1719
2766
6440
3352
2294
1660
1595
1862
2353
147
3047
5845
713
7547
9329
6414
2056
6797
2336
1614
2980
392
9970
8174
1253
2463
3843
5756
8278
6244
5179
2680
1932
252
3442
5794
8811
6380
5205
1635
2786
2256
953
3070
3311
7822
5725
3087
3963
3341
664
5664
4517
95
8685
2723
4347
7890
6170
4202
201
1667
856
6446
2574
5037
1800
6765
7442
717
7065
1446
8491
12
3954
6553
3016
522
4662
5936
3906
9067
6821
3541
7789
9378
7093
5448
4682
8273
1229
2997
120
593
1738
6348
4352
2357
3973
3746
5545
9702
2162
2695
4568
2510
1406
1518
4638
397
6674
5885
4037
3610
8099
9642
5223
7030
9094
2826
8840
574
7912
8161
4513
5981
202
776
981
871
3887
3146
7276
8563
6826
229
4989
4696
3252
4834
8431
5700
1515
5042
8449
6321
57
3471
6955
1891
2872
6101
1325
5988
4755
3071
7413
2153
7877
644
4579
8240
4928
1444
3707
9219
5087
484
385
8357
8696
1403
6312
6223
979
3445
1282
3937
7244
986
89
501
5551
8045
3105
3890
1803
2896
7331
7643
4916
7337
2780
8316
1529
5137
303
6832
1003
7519
9528
445
3511
5732
211
4658
7821
991
4287
7240
1620
3790
5719
4709
1960
1088
4583
5360
4550
4189
3458
1412
1549
6128
424
7160
8836
4744
9814
6454
2176
3816
1400
2174
894
2876
5546
8231
1780
5740
109
4003
6396
4922
5135
3581
538
1904
6301
32
9896
4835
1588
391
7501
4934
598
4907
826
9783
8869
5517
572
4595
7907
5860
6551
7295
1788
6880
328
9899
3844
3743
7615
658
5241
376
7507
5561
7838
5217
8114
5994
84
3001
7983
8065
3952
3217
6811
6749
1739
7673
7173
8648
2418
7699
225
8217
299
2948
2032
6779
8841
7605
768
4193
1079
3498
164
2185
6652
2583
1379
8409
1433
1815
7158
4108
6596
4691
9057
3229
5790
8580
7999
5014
2258
5559
6249
2253
3475
1075
9887
9684
278
4166
7736
4880
9249
1354
9545
7002
4242
2220
8019
3467
9787
9360
1095
875
7155
7179
1980
1594
3853
6822
7395
6891
1310
8101
7090
9746
8266
6882
1791
2350
7033
6789
4491
2181
6172
2993
6213
6485
4061
5336
8460
5169
7594
3383
9351
8049
4738
2845
1329
9679
9907
7740
546
6375
8203
2148
1845
810
315
3539
9719
6923
6353
7784
4648
1045
6620
4012
1572
7720
9566
3947
4507
6914
4613
7706
5484
2750
5163
5680
669
3479
2374
3183
6140
5742
1958
9102
7975
6836
2918
7585
1099
3850
7584
2554
2821
5081
4747
2592
4299
5487
4972
7061
3174
5745
9312
3160
5589
6662
1899
6735
8364
7308
9021
5702
8888
1414
7407
9433
2340
3698
3430
8499
9922
8757
8804
5874
2658
4025
504
6349
5396
4828
827
8438
6522
7947
5412
9026
2514
1147
6193
1361
9186
4462
2569
1317
2073
7770
3823
3516
6633
8392
3656
3448
2871
6535
3220
9281
8721
2438
3469
3984
8900
9987
1848
7690
208
7819
6077
9731
1221
3394
2653
2299
1850
6354
5215
5290
3613
843
9772
1713
452
9118
6333
9524
219
7251
1170
5739
4894
8475
8729
8318
6153
1688
8332
9800
3588
6245
2110
6558
4973
8783
7168
7768
3894
8511
9832
4801
1776
6777
6772
9064
977
4481
7682
1324
1877
7347
1195
4528
567
678
7994
6017
5933
8584
6209
1033
4176
2228
6817
140
6541
9848
4717
3873
1716
4698
5359
273
1500
9396
6713
2053
6546
4002
8608
5521
9145
7095
3866
5211
7437
185
4543
9099
7412
6143
9715
1853
3309
3841
7321
428
9451
7194
6222
8899
59
8002
6131
5406
1159
3961
9711
3328
6961
6488
4836
771
2213
4649
6481
9927
3395
21
8285
1621
5272
8484
2354
4153
9563
5688
4610
937
7732
318
5764
8801
8327
4466
4268
4514
3216
7088
3690
5378
9010
4924
6679
9865
5034
6978
1493
582
5077
7326
632
6405
3392
7234
5267
3499
9671
3324
5768
6608
1348
681
5089
9291
2026
1681
2841
6476
5249
834
7452
6941
615
188
4469
6597
5811
9135
8777
9847
2852
4143
3456
1472
9917
2210
5197
9930
4626
634
4556
265
6337
2328
2295
4160
5816
5834
3251
8091
4722
7447
9272
4180
5257
9113
2154
4797
3780
961
9416
4177
6565
449
4421
7211
1494
1011
8909
2596
457
2838
6649
8057
1571
7425
9303
8459
9282
7362
844
6540
2489
3576
521
6423
2564
5043
361
448
976
7386
7315
2914
1727
5927
9923
2580
860
3542
407
7903
469
1203
7047
1419
9926
4091
9828
9506
7113
7757
886
4451
1927
9039
9995
7417
9820
9905
4438
6954
3030
8621
6308
3809
8347
8871
6406
2125
715
4196
2880
2094
8613
6591
621
160
2535
9646
5579
4808
2676
4996
9051
3269
5109
1288
4620
5950
2516
3785
3590
4145
8561
4017
9458
2
7018
7303
52
2061
1165
8782
2182
7914
8198
4581
232
6146
8404
6864
9816
1334
4853
4426
5577
4415
4077
8634
1851
8154
1756
8530
9374
2172
7249
7783
2021
51
9756
7424
1386
2242
647
1194
3143
8656
4505
9421
9818
7460
6780
7311
2805
7175
3427
9697
1480
5909
2656
5454
6901
2684
8287
4049
9223
2033
9712
4185
5706
1883
7208
966
3316
7044
9647
8978
6717
6740
3170
4306
2575
2791
3958
131
7062
4474
4150
4066
1417
5073
4240
1073
8079
7814
9636
8759
7805
7451
4258
9761
4485
6267
5750
465
7750
5953
3054
9009
2241
5013
365
9116
3339
5687
9096
3813
3068
1568
2705
7697
9167
6123
8739
3641
5857
6430
4650
1120
9463
1211
7574
5839
4182
5854
7253
759
4697
8764
7260
7623
8252
1823
9723
7354
112
3264
2235
7241
1241
8652
9278
3943
5998
9335
372
3443
2850
6585
2005
9660
2358
2843
2551
579
411
2713
7909
7360
9875
8937
1767
6037
8794
3793
9608
3213
3149
1093
2473
9765
2638
9285
7037
6635
6042
1849
6568
2714
1140
3239
7185
8658
5017
8835
6576
2368
3320
6261
1308
5366
6368
4634
9854
1278
3878
7254
2306
1309
5108
2934
9833
8106
6842
8209
300
3322
2302
529
4899
3249
7072
7931
1109
8932
1410
5504
3141
7981
1366
3985
3156
9412
7989
6389
7842
8827
2384
83
6833
2598
4868
5587
7632
2955
2769
9061
6844
8833
8046
7058
1772
2892
8795
8587
4911
7229
8562
8677
6212
8470
9913
8912
4222
4495
3186
3408
2844
1435
2096
8326
9418
7701
9173
3461
4472
8104
7759
7846
542
4018
6509
8444
339
1911
6116
8579
3600
8264
2085
5060
676
5330
4471
777
5530
7378
7009
4779
8336
2694
9749
8740
3224
8024
4872
7721
7601
8007
2430
3508
3642
236
3510
3617
8859
3359
3554
3142
9594
2919
8128
3633
8478
7535
4383
8328
6984
3425
1886
1804
3972
8110
4147
7365
3629
5715
4718
1496
9239
7021
4667
1084
2325
6190
3089
6670
7052
7444
3069
13
2292
1601
9409
3609
2859
3817
3518
9868
8457
9901
3038
3842
1775
8697
5417
1698
9537
4963
7346
1152
500
8568
1306
2631
1150
8025
7274
9430
6250
5743
2124
3976
101
8408
2201
155
2846
2020
2200
9247
1858
1659
3663
4443
2738
9275
9119
2365
6911
7802
9999
6228
6729
6977
6916
4478
7775
6767
9937
4396
4856
5696
516
7517
7026
6574
7299
5575
7700
8015
8254
9489
2933
8095
379
6562
6292
9880
3231
2236
2106
7340
2513
1436
5490
8614
4266
1796
3211
9984
5449
1017
8926
5944
696
4297
5463
4233
7485
7581
5289
1628
7462
6093
5675
9950
5382
1378
5441
5370
1906
8594
3700
85
4405
6532
6407
9969
8191
957
2043
581
5181
7867
1398
5408
2301
2923
8137
9261
2381
9811
3338
8583
4071
3015
7896
5285
4719
6659
4397
6741
6263
890
9728
2773
4053
4545
4156
1679
7455
2710
7014
872
8626
9280
2238
3705
4673
8391
1523
2305
2004
9644
2911
3424
9379
7711
7169
9724
7087
2115
958
8544
4243
8474
2433
6588
3919
9785
1973
8732
4315
3592
4788
9796
6461
7794
4840
884
5812
9579
5829
9411
4411
8377
7502
6046
3557
3384
94
1857
7647
695
8385
6737
3010
5444
5650
6803
8908
8834
1773
6083
2167
8938
893
9248
7902
1718
9441
7341
1562
6501
6192
7562
6918
845
1559
9070
9766
601
5326
7060
9849
8559
6881
8970
514
9716
6714
6687
8790
5059
6711
1986
959
6334
7847
40
8076
1235
5623
1569
8564
9277
8830
3298
2724
8411
7820
5207
1505
2606
5145
8247
4803
206
7762
7840
8623
3688
8914
8847
7899
4866
6041
8674
9654
5708
9669
2639
5300
5804
6899
1793
4848
9456
1489
9810
8698
2863
8280
7839
838
2224
789
1854
5492
4958
5293
2762
4630
702
5698
7257
7953
1522
8750
9315
4688
1271
6634
7713
8165
7200
9436
3050
5617
8349
700
5391
3182
9614
7418
3858
9437
6698
3768
3063
7288
5992
111
1710
5049
7707
5941
3377
8953
6156
9992
1575
8906
1905
5880
4635
2279
9834
9238
2291
4328
8181
5778
2383
8809
3687
7434
3672
1399
5979
8733
2038
8169
677
4270
3037
6176
1245
6010
8601
1145
1648
4622
6422
7612
5088
4168
1256
3909
6527
7499
9244
3454
1526
9944
9829
3118
7825
3411
8506
18
6287
9914
735
6626
2426
6265
3097
1083
3993
5383
7710
7301
3507
3771
1967
9770
8500
1232
3929
4424
8496
7004
2562
8272
5922
347
5983
5930
2135
7996
4993
3232
4406
6681
638
5305
19
5828
9103
4833
486
7048
4199
5148
5096
4100
4845
5974
6960
153
6840
9392
3381
9965
6507
5111
9208
2732
576
8426
5457
4586
7339
1050
4370
2311
5235
7675
6908
3501
534
5628
3258
8918
6686
8942
3187
8762
2412
5051
1042
8340
4766
3065
9689
4643
8087
9490
5558
5144
3628
6723
8355
1066
6187
9835
5766
823
4389
6612
1655
4791
7028
9364
7494
4661
8301
6902
0
928
3994
104
6233
5627
3918
942
9916
2259
9754
5162
7895
8461
4360
8442
9985
924
5025
757
4267
8259
6068
5827
9073
752
4577
7941
5430
3723
6593
2454
2840
1247
7332
476
7702
7861
6441
6929
6149
2741
5323
5274
8997
7242
3680
9452
6395
4763
2549
8144
1819
9036
8488
8611
5553
246
8555
7393
1600
831
832
1019
7810
5581
4238
3296
427
3318
5100
3757
4187
3343
3162
5914
6934
6640
3674
8286
9750
8305
4392
114
6056
6611
5780
3752
4508
157
9428
6394
9126
799
3434
6148
4908
5455
4275
2217
5365
4250
4339
5892
4541
8312
3223
1269
9268
2683
4944
5281
4388
8038
6695
4664
8258
8731
5447
6338
5646
4070
7602
1521
5121
5172
244
4104
9906
1374
8855
6577
4578
294
3178
2362
5977
6163
6838
8604
4391
7324
7471
1506
4294
1484
7008
8517
935
243
282
7624
8032
1699
8485
3907
6886
8788
8368
4621
9778
1866
8969
3164
2568
883
5511
1387
4223
9703
8014
6298
3481
171
837
6956
3567
9549
8395
6637
7470
6705
2379
6200
3206
8798
5292
1345
7287
1051
9050
6981
766
3188
1979
769
286
6031
316
1846
1136
6936
4946
1581
1499
75
2329
2186
3684
9771
6480
6766
359
4417
3312
9720
3630
775
8365
3008
3525
7563
8873
955
1276
2930
4117
8384
4883
6512
7078
9629
4257
4985
8062
6544
9789
3848
7674
9648
6007
9598
4669
1108
88
7651
6021
9083
4092
2369
3040
7273
7484
1341
9682
1736
6953
3486
9304
3983
7758
3158
8893
3100
1974
861
4499
1010
6615
7011
6498
9498
591
5023
4128
2963
7592
5335
1183
6355
8033
6619
7678
5284
4312
5094
4923
4846
7979
8489
3859
8688
1089
5686
9562
1641
6050
7480
3238
3928
4047
7786
3045
8910
8930
5183
1067
6684
4410
3575
8018
90
7962
3560
2250
610
7743
9161
5704
7199
1021
8260
8495
2392
8941
4020
1931
441
191
416
5659
5996
8284
7641
5019
9500
6517
1242
5868
7478
8999
3334
9588
3435
5507
6276
3261
422
3488
3815
6018
2560
4446
7053
6523
5064
1301
2774
8131
9836
1914
8664
9255
4068
6386
1785
4988
2058
3061
3348
4174
8297
292
1078
8465
119
3659
4060
804
7138
8639
7486
1470
2116
5437
6445
9203
7600
3627
7322
3390
2346
7704
8436
4530
3205
878
6510
3052
9961
8745
8763
4496
6642
4113
5010
1627
8905
2610
9265
1369
520
8800
239
3533
978
5345
438
3323
3387
672
79
8194
4261
4974
7879
430
4676
6837
4604
6179
9220
9544
5872
7780
8047
215
9893
8546
1280
7767
2205
7932
460
6450
4606
8765
6793
6819
6465
2501
5127
4503
9492
1401
5309
7409
3916
8006
7079
9548
4219
5465
7528
37
1618
6174
63
6524
6371
7864
719
5902
8635
6168
2035
1602
3308
2862
7809
4186
2352
6459
254
419
8075
323
7791
9617
4148
539
3828
7414
9444
5188
2439
3260
5115
3555
8314
3447
849
1006
5773
4616
4355
8630
3041
5633
362
7017
7258
2016
410
743
1383
9317
3599
8134
2726
8367
5552
4487
8195
4197
6525
7668
436
4860
3134
5884
4195
2586
1022
1053
274
7282
3076
6758
9693
6557
6040
3476
8989
5747
3616
1055
8985
8776
915
6508
7046
4592
9735
3210
8162
7542
2678
2627
4366
197
7833
7454
4878
6594
4966
7134
3818
4690
8382
2936
7557
8086
7582
4901
1224
1070
6182
395
3802
6930
2661
2668
451
4552
1691
4165
2682
5067
30
9425
9305
9005
8933
6663
2965
9169
3136
5234
6638
4842
5524
8021
3023
3990
4000
253
7525
6023
4754
2366
8008
2360
571
698
9309
8935
9706
5783
96
8844
2515
2332
3169
8054
3033
3317
2192
9213
6420
3730
4278
4524
5519
1492
4559
7126
9743
8551
3777
1968
1133
2411
5468
7773
5097
1824
313
7763
8492
4850
9729
3938
952
8779
3248
2376
6469
6907
3832
1218
7034
7397
1116
7586
8362
3450
2007
7068
4863
8241
6556
4914
9
9091
3620
2237
1113
7153
5238
2281
8413
9031
885
4741
8767
6336
4231
8202
9572
3727
531
6846
9584
1565
5969
2541
1284
6884
2166
2706
5963
8051
2189
8657
1893
9991
6903
2160
556
2553
3453
8441
4597
9637
6127
7693
4737
6554
6991
6421
2573
3283
9394
532
3165
9696
5130
6887
4031
3335
227
8152
3515
5123
7170
9590
3019
2482
2147
5496
8533
4082
7351
6367
6361
1363
9640
9635
2969
161
9462
994
3706
7120
4277
7268
5372
722
9797
4237
9110
1252
5407
9947
1852
5801
9347
6147
3812
3451
3287
1586
2355
7958
2246
1263
6137
2924
3678
6504
7084
2168
3365
5613
6709
7804
1774
355
6859
3330
2410
1717
9129
8151
9628
7509
4796
3683
4062
7539
6383
3717
5685
7271
8482
9407
5044
8599
8359
5619
5918
3441
8681
5539
2508
2891
5841
7871
4727
1887
8956
4735
3403
8850
4183
3253
3652
4980
1024
2324
2331
159
4656
8948
965
7863
9938
2057
2416
6521
6151
9015
7511
1964
9610
3908
6341
8016
6589
1548
9023
7385
3559
1411
4817
3225
1996
8867
3214
8577
2139
3854
6718
3306
3113
7597
1255
5085
1112
3436
5247
9105
3072
3897
4668
4628
390
1265
9596
3131
5245
9516
2278
1637
4279
31
6139
194
8435
1457
124
7358
5027
285
250
3662
4812
1071
5307
4970
3939
71
9645
1168
596
9859
5805
8574
4296
8310
1573
277
3011
9341
7465
6385
1683
4307
6976
4897
2382
7754
879
8668
4041
6913
6033
9200
3503
1847
4557
8034
8993
6482
53
4976
2860
6648
1709
1146
6211
4965
2117
3636
2435
293
67
454
9633
4175
2453
4036
9757
2245
1587
9253
1546
2373
8711
2488
6967
4486
9721
8945
1706
5867
9191
8171
6671
5640
5344
8619
8590
8308
1091
7448
6909
5803
6570
9801
1781
3639
474
8875
8080
7599
3363
4144
7285
1468
5486
9523
2660
3233
9063
6059
3463
2204
1236
1295
7760
6531
471
6900
2484
8964
6656
1262
5838
607
1879
9788
9688
9558
1434
718
4942
511
1359
9954
918
507
1028
5689
1894
7015
3689
6870
9068
5901
8401
7661
518
6330
4001
7718
5547
1029
6060
3513
7998
4065
1946
9043
4882
655
6342
8897
6804
9745
4084
4584
64
6754
6378
3005
7376
9390
4216
848
3877
8371
92
3996
3449
6189
2273
7658
7709
3440
8578
4546
1799
9387
9762
1645
4926
5356
984
5167
2422
6866
5576
9625
8004
367
5850
8145
9093
4327
9427
5280
9613
3281
7916
8344
5105
9164
1438
9732
5040
1037
8924
2158
80
8281
103
4975
2847
3007
478
9997
3267
5236
7978
7868
5341
1023
7742
6607
4482
5853
1890
2842
6790
7318
1040
7806
9274
4172
7888
1237
4006
1939
6373
5224
9108
8304
9196
5184
8889
4274
1268
2227
1722
1913
498
6401
1843
1
1508
9218
3401
6130
1097
2811
7328
6693
3353
4598
4702
5151
8618
9494
4715
1178
184
7751
2958
5099
3256
6937
6600
1827
139
3153
2839
9554
5844
8539
6710
3373
6214
2492
6876
3107
4571
4940
767
8582
224
4956
6039
6533
5453
9741
7245
9120
2017
7935
9040
1123
9054
3126
4758
8963
8532
5380
3650
343
2445
1416
7020
3036
8991
1970
7883
6724
433
4623
5425
4464
5649
1732
5264
5477
6161
3321
592
4232
751
6105
8886
2099
1912
1605
1576
1676
8675
2803
1421
1182
6203
6988
5388
4703
152
9879
5154
6999
4373
2178
5904
8262
3144
6950
2692
6120
6442
8690
8302
6232
6081
4825
6237
1244
7197
2022
8455
5171
6097
1519
8659
6874
2230
6839
3314
5459
3921
450
334
3605
7826
4685
196
1125
1391
41
7323
7959
5755
2932
8666
6167
6138
3313
1453
3073
8813
4614
9123
1426
2690
6601
1868
8670
6820
7476
4264
463
1497
1889
5402
5098
8934
9081
2884
2212
1273
6080
4083
6227
2833
2498
746
7108
5445
8771
4141
8712
8548
3579
60
6197
7140
7830
2239
7801
8396
9206
5921
9977
8041
8343
9251
9904
8849
7934
9056
1687
2030
8146
2900
2947
6992
9069
2037
340
387
2504
828
4525
1941
6968
7422
2733
3926
3911
5731
7761
750
4252
7945
9354
8709
8425
4118
1502
7580
6949
4473
988
7391
373
6875
9495
130
344
8319
6014
4721
4283
9472
2015
4069
4502
2899
8225
398
2763
816
6468
3429
1656
6268
2530
917
3759
7913
5332
7286
1763
2540
1161
4050
3085
3619
1495
9401
526
8422
6155
2593
264
346
9406
8887
5389
8480
4756
1291
4523
8858
6135
5957
7278
7092
6530
5864
9897
8535
3840
1169
8234
432
3574
6178
6435
8876
5016
4097
9233
8541
1951
9962
5917
6472
3825
6064
1760
468
8003
5673
122
608
3288
1585
5672
2045
4302
4456
2405
8661
2784
2779
6769
925
9438
4374
5333
233
9499
9803
2902
6381
7074
5103
9840
3836
1344
949
3582
4734
1527
7873
9534
562
1991
4375
2465
1402
6511
2915
4181
2677
3824
6861
182
4319
8504
8810
2543
4200
5513
2215
9681
5379
4276
4554
859
1567
9935
9098
4335
4213
5871
4054
8695
118
394
1427
1285
7111
1807
956
6940
3493
5510
4179
4881
4393
5086
3200
9442
3738
3867
2636
5473
5585
482
8153
1764
1440
462
2093
9852
5120
9998
927
1225
6052
9045
1646
8183
4558
9798
6205
6109
7640
7243
308
6890
8785
4710
8148
3452
4337
3227
7319
8115
5009
8251
3154
1812
954
5544
310
3604
2986
5399
9863
210
5905
3529
8068
3025
6757
7841
3721
302
7564
6063
7343
1955
6165
6959
1086
2809
6092
4209
2006
9822
8799
5351
940
9656
4354
2247
9414
7591
2988
911
4300
2271
8092
7832
4704
3538
8866
9630
4589
8353
5670
7294
2394
8931
34
8294
9727
4903
2069
749
9511
9322
2617
9624
2931
2671
440
1751
9733
7361
5231
5256
5911
6985
1947
9603
8920
9948
5632
8713
2634
4608
4771
551
4234
9340
4674
8954
2643
3327
9861
7136
9641
2725
7891
9455
8218
7247
7189
7076
9742
643
8901
3889
2389
431
1266
9128
2159
697
330
7956
2720
8454
50
2226
5424
2031
2882
9751
2708
7884
8572
4101
8705
6195
9359
6700
7811
4847
5491
3477
2458
1916
2466
2548
2400
2848
4190
4380
1370
7085
4861
2449
7813
4318
6477
2968
7765
1692
8289
5392
7162
5189
3584
8292
4434
3474
5997
7165
3208
1000
8703
7837
9874
6617
2275
175
4627
4463
5735
4099
4436
9502
4651
7051
7497
9431
9435
5666
7578
4048
3044
2794
7823
4105
9578
3568
1458
7496
4953
2867
6463
7548
209
4235
9795
4726
5813
1543
7317
8822
9042
6484
4344
7748
3719
4807
4805
6539
629
9573
7083
4533
5129
2824
4342
1708
6319
1577
2359
141
4814
4429
17
3885
8249
3948
4085
5116
6098
1122
9510
3031
1090
5571
7382
3646
5361
2563
4575
3731
7629
9777
993
8439
9112
6173
7355
3202
1990
611
2341
7777
7463
5110
4387
578
9222
5645
8600
4111
9316
9485
2468
1373
4772
6628
6514
9529
548
4428
2483
9229
972
3624
6604
830
5488
5069
2771
6690
5723
5984
7236
689
4619
3933
3805
7205
2628
4886
4149
1998
2664
3898
6270
6462
2729
5826
5800
7560
5405
1226
3376
9931
2877
5662
7980
228
3191
1606
5881
3767
3779
8683
2954
5178
6248
2567
6027
9898
9432
8201
866
8527
8009
8743
2260
9918
7745
1650
3527
1204
5338
3685
8523
8749
786
2594
8050
4680
5357
9086
4459
3426
7654
1677
758
8957
6393
8139
8591
1393
5718
2783
9941
3734
1959
9321
7226
686
8719
4080
2396
2111
5092
5608
4582
4968
3589
2494
4532
396
561
9403
388
8718
3668
3697
4720
4285
5469
1658
2616
9260
8443
4770
9869
5084
7272
1721
275
5050
2456
3140
6581
4501
7110
547
3553
3250
7921
6239
9147
7543
9827
6560
3751
1179
3485
9136
3184
2960
7653
5033
8434
6895
8596
1305
8576
6241
8896
3999
7400
2868
3102
7922
6944
7152
5461
4441
7377
86
5373
6759
8723
8510
6392
3496
939
2165
3578
7186
934
9325
6315
1779
9332
5644
4009
9486
2663
4819
7250
9551
7836
7608
6755
6549
3360
1860
6402
6288
5416
7723
107
2675
5691
2019
435
4981
8342
3407
3827
6184
8570
7774
4433
2686
1246
506
9853
3565
9048
5325
8303
6668
8826
5975
1102
2261
7435
3761
733
5024
5472
8641
9075
6810
9209
8361
1035
3240
7275
3347
6935
3667
554
5303
1420
3880
1533
6117
7788
5985
948
5273
5682
4440
2524
8872
5978
8136
2721
3881
3145
2276
4034
9363
5683
5390
1013
8839
839
5787
809
1613
4609
2062
950
6048
8263
3468
6058
3082
9293
4841
8205
5677
7438
3473
4859
9234
2427
9245
47
4624
8410
1880
5611
2522
9318
1693
595
8290
6643
9959
4372
6290
3536
8094
6506
9825
7516
2851
2126
7976
4641
6536
9290
1223
5173
2459
2901
8339
5913
2703
8791
1482
6704
2970
2991
7573
5483
7230
6492
415
2953
260
7306
6110
9967
4057
794
8235
4298
7279
1153
69
8462
5209
778
1206
1598
8177
2284
3702
4173
8267
6970
9599
9357
5202
5003
1337
8586
9179
9175
4713
4225
1016
7223
9567
8748
5339
9087
9653
8366
5699
4207
8692
4573
6863
901
793
8345
7334
9971
4224
5842
4795
5882
6893
9779
6302
5220
7531
8552
5314
7795
4786
6712
2036
8774
3433
25
6932
747
4681
7679
4324
8424
5146
7314
199
9256
8135
6307
7267
603
7800
3606
7151
6144
5943
3544
78
8494
5830
1293
9153
9556
2001
1720
3058
4093
2008
3431
2757
5451
5890
899
7316
639
1175
1286
5125
7957
6087
8734
1512
9479
6030
8631
4325
3413
6865
1750
238
5618
1061
2539
3400
1992
8971
8109
1834
4544
2995
2214
652
3956
9738
9276
4678
127
709
9576
1520
4852
3391
9199
1025
2699
9677
2648
570
7156
6910
1633
3067
8968
4452
932
4008
1081
5681
9018
659
4458
8207
3549
3192
1615
1778
7263
1560
9850
8832
5843
1430
2999
3915
39
4971
2254
8707
8575
4400
3418
7458
2604
947
222
962
2187
7143
4305
4295
8017
3083
798
2251
5384
28
6235
7917
7619
783
167
2367
4385
9104
7191
2225
5502
7829
2533
4785
1027
1272
7772
9157
4937
9960
9024
5729
4236
6297
2800
5296
8044
8100
1792
9699
5175
1619
6841
9210
8374
4042
3066
3979
3505
3270
1563
1054
3243
5498
6500
7000
2907
825
8451
6732
1431
5952
3712
897
9512
2652
9972
5697
5318
7233
4830
9366
1193
5973
9542
4341
9497
8653
4843
4221
6636
8747
6489
483
8337
5499
5596
5971
8058
1012
606
2146
9851
3104
5982
429
9400
4731
9980
7663
7080
5538
7235
1901
1207
1918
7843
1184
9666
7005
1856
5870
7984
9289
9631
9144
9600
8212
633
616
1180
6529
7022
842
4600
716
2252
4915
2429
7642
8730
5117
7662
7540
6786
6982
1872
8172
5898
3278
9815
9725
4997
8
6210
1924
6066
9753
9300
4413
91
4636
8503
1098
4762
7406
4119
1570
8854
3177
9330
4637
2476
3946
8222
9526
4904
1514
3695
7672
8122
7284
335
1074
1734
6796
5467
2474
605
6413
2440
7752
7012
9138
7146
6788
6271
625
8679
4130
3694
3583
257
6258
4647
4898
5572
5334
8959
9328
2673
1331
502
8456
2865
6289
8565
8386
9097
6282
913
9388
6678
9393
2363
2624
1464
280
541
108
7514
8995
587
6571
2537
4569
2832
9883
824
512
6580
1299
7100
8913
9505
8463
9156
1631
5349
7676
6852
7549
6592
5147
6376
489
3272
792
3255
4896
4964
8223
3043
5889
7050
5602
3703
7167
5348
3021
8738
5883
3057
1591
3548
7554
2370
2679
5418
656
1723
4875
7043
3829
314
7865
8160
4331
1044
2767
2701
4743
404
8220
8155
4601
2407
2685
453
9872
675
3080
1228
423
8375
533
5938
7421
2190
1049
4089
2875
9002
5229
4409
9397
888
6995
7853
5791
1673
8097
1786
7266
214
3922
2707
1550
9568
7949
8780
2018
1327
3351
8059
6327
169
4336
6625
8107
9890
6171
6124
5208
5298
2646
1963
5622
530
9955
8669
3379
9319
4384
5781
3838
1950
4823
4194
2274
213
2472
7796
2180
2338
5261
3522
2888
8815
204
1670
8311
2623
2709
8469
9079
1392
3795
3138
9768
2140
350
4151
1794
331
3466
5586
1769
9690
1649
1838
7069
8001
7524
7029
4547
3494
7622
1759
1429
5411
9100
7872
1117
8606
8378
4992
2916
3199
304
320
1132
7370
5306
1101
6035
5002
971
8784
4862
5311
3241
2070
1707
2464
8673
2387
7952
8988
5597
4549
6782
9555
4444
6291
4969
4684
5915
929
6603
5015
9243
9979
3319
5533
8735
3139
2268
9236
4750
6702
7145
6408
7174
3770
7741
3601
9501
4282
8728
1752
4813
5847
3713
7006
4618
2992
8680
5833
2740
4555
7520
7190
8498
2597
3654
1198
1425
3263
7281
4345
9649
6004
6986
1532
3151
3587
6006
3491
1816
9856
7441
1202
4269
9557
9183
6108
3888
1801
6379
7117
6922
740
4033
8620
2421
5819
2788
7469
3941
4806
7464
6883
2717
6243
3724
4548
492
5694
9380
3586
540
6072
3543
8168
7300
1212
6082
4377
5605
8450
1041
6814
5227
7988
1742
6157
4504
1726
9049
1196
914
8380
3262
3275
9055
1094
220
679
154
2240
4625
5450
6397
8360
2798
7995
3180
6971
3268
7558
2163
3358
5310
6494
6873
1189
2380
850
150
2981
207
9211
2322
1164
3545
8917
8370
6904
1597
9141
2141
6118
2288
5393
55
9583
6183
2922
964
5320
9386
9589
1389
9415
1665
3520
3927
1445
822
2787
2216
5852
7016
9448
640
613
1997
688
2641
3903
5560
8863
5671
2316
8206
5906
744
187
10
9876
8943
8947
9953
5832
5102
8027
2409
8663
2518
3577
7411
2283
9966
7859
4655
5624
745
5375
8180
9593
7769
3367
9698
467
797
5474
889
8883
1841
1938
3405
2742
333
5248
1784
687
4007
9658
2830
3755
8246
3526
3945
2293
8477
8245
3585
2469
312
772
7481
9988
4912
6426
9541
910
7886
4580
4314
3285
1965
7207
3274
4450
6096
5789
7204
8597
269
8566
7036
3864
7598
5321
2702
5036
3155
2974
833
5054
3902
401
1969
9195
1107
5259
8640
6728
1486
4286
8446
1405
6388
7290
9337
3020
1258
8472
2547
975
4378
4706
1409
3970
341
6927
943
6358
1735
4140
2835
5692
3325
9956
2395
6752
8073
7482
7974
5
8684
5297
2946
2654
4011
2027
8429
2102
176
8096
1746
6609
1103
289
1092
2837
4247
5822
2731
969
1556
261
4212
2704
7685
4874
6343
9509
8090
734
1762
2527
7733
3148
5225
3167
8133
16
5219
490
5856
4484
7181
7106
6614
6496
8232
9483
2055
7955
8746
8796
5648
5216
8823
2925
9308
9326
5531
7333
5534
788
7363
5887
761
9580
5643
7070
6896
2137
317
1842
1875
4371
138
7466
9257
4893
5807
8213
2243
5047
2687
3551
5403
5799
6748
7734
7427
7500
725
756
5032
2404
5798
4765
279
6942
8132
6323
3246
4218
2887
2581
720
6646
66
8111
1216
8219
1564
9190
2175
7919
8113
3147
5701
5851
7338
2595
1174
5549
2082
3462
1106
2611
70
9958
802
9895
8077
1038
3446
9402
8437
73
8175
7595
9643
5758
3173
1395
8952
729
4994
9717
5912
7933
1855
9323
4161
2448
2471
7215
1144
2885
7472
1584
9287
1238
559
2829
7688
2330
3470
9739
5972
6360
2391
4171
8103
2335
4562
349
4936
4284
9465
1020
5563
3421
7420
9758
8445
818
3637
7212
3514
657
7450
1861
3185
9855
9993
4382
1230
2608
5526
3552
8980
8288
5007
6029
3228
100
4831
6745
5733
9353
5470
5377
7906
6448
9606
9017
4432
9350
5713
3195
3830
6427
3409
5000
7827
2097
8147
8655
9344
727
4358
4574
4535
2128
3528
5516
1248
3949
4348
3925
9217
7621
820
7327
3882
3301
5056
726
4672
9187
4304
1672
7159
2943
4201
7908
2615
2218
9185
6972
4024
5165
6738
896
6602
3839
3247
5609
6284
6310
7753
2197
5327
5240
5578
3748
8406
6474
3282
7572
4870
5063
8610
1697
987
3129
3393
2728
9297
2397
4789
3876
6497
805
9604
1119
499
2778
6843
1009
3472
5679
7392
3725
2622
3714
8432
3075
6264
5440
8660
7255
4802
5565
8421
3374
7097
2320
8483
1837
3923
6998
5423
1382
1902
1138
7345
3438
4430
4064
4249
3715
4152
6613
2818
9160
2507
9687
8890
4890
8676
2941
6943
938
5363
6316
5075
4362
4787
6692
497
7828
8758
5566
477
8645
7875
258
5080
773
1589
3284
4588
3942
4781
4746
8268
7498
6447
6787
4394
588
7616
4316
7375
7508
852
6564
9324
5638
6845
7644
5419
3106
6132
9837
3651
7744
9429
1900
7188
1524
393
8208
9527
3091
8250
8726
4611
6152
3765
6931
3114
1753
6399
9449
7634
5765
4317
5621
82
3121
2127
4521
3931
8984
2635
1895
6032
2801
7960
7252
5255
6579
8769
5170
4777
8229
2506
5669
7589
3563
2039
4480
1869
3286
6697
4211
6486
8860
7384
2309
5506
7892
6734
487
1481
9193
8023
3108
2144
7609
5866
7860
6362
6825
6158
2262
7532
5138
7712
7523
3385
9189
6328
765
4909
2425
2487
4132
9870
4918
874
4960
7817
9140
1483
6761
2561
6526
216
8275
6470
1829
1201
5078
2248
5786
7415
8129
1695
4333
7620
919
4191
443
8403
8543
357
4081
770
8083
3059
1513
2183
650
9683
6357
7147
3535
9704
7942
8547
813
2223
5939
4127
5667
1104
7489
2531
8418
8821
6456
9730
8331
8130
3594
7139
6756
6325
6464
8011
642
7506
5394
5529
2233
2493
7930
3679
3361
2820
800
5271
9763
1353
4021
6251
5891
9417
6317
4740
6495
9602
2797
2263
4935
8752
7972
1032
5126
6921
3710
3416
9707
711
3432
9331
5011
782
9267
8379
3198
3277
3653
3399
7369
8490
9546
5612
3103
9773
4919
1989
3388
134
9475
6996
563
3671
6726
970
2874
8525
4939
6306
3212
646
6159
2113
7901
7635
2034
8560
2640
705
3074
5159
5614
6188
8055
4449
3029
2077
5177
6827
6145
4290
9466
5139
3101
9166
1215
8528
829
2698
5824
1460
7477
645
8224
9616
6575
6202
7216
2651
7297
8958
5651
3831
5213
2417
2649
9084
9650
7607
4857
1283
9446
5595
7787
1128
4032
1390
9473
3892
6834
2879
1127
7443
6180
3034
9413
762
2620
2415
7101
2761
4565
4659
9228
8053
4537
7816
2013
1770
4492
6666
7475
2982
4313
9784
6329
5315
3986
2602
1934
494
4280
5442
479
9597
3883
8182
5083
5556
5364
8974
7390
6444
439
1675
6547
1335
5199
6515
2270
3302
7964
1209
2269
7387
1651
7098
1704
8558
3439
6595
2078
1407
3116
7722
4670
9231
5724
1820
9133
5005
5770
3419
1142
6112
5124
2390
594
4990
5923
8870
5543
5398
336
4519
863
5301
3024
7128
7684
133
9089
9508
8996
1249
3774
7790
8853
857
9841
9791
237
3572
7039
6912
684
4164
7280
2443
481
6746
8163
1376
1488
7383
3110
8473
4399
1270
3997
3899
5132
4867
9652
7617
812
168
4014
8592
7746
8742
9661
2048
1274
8257
9595
1537
7799
8919
9726
4055
1131
3357
7862
2131
2854
3259
4072
2556
4363
7256
4876
8063
7219
1671
781
7131
7943
6897
7042
3402
8962
1629
699
4103
1424
5956
2321
7851
9146
6696
9131
3484
2659
6629
7866
5435
5835
5637
7915
9306
2621
1250
1952
855
1881
6299
270
6691
4273
9035
5717
7380
319
930
447
1539
2310
3896
5580
4470
2985
9651
8706
7366
2601
3573
6685
2589
8716
5057
8744
5802
1190
9672
6404
9886
1060
8158
9794
9634
193
9224
8842
1404
2861
8351
1557
5792
5980
7495
4
9025
4134
389
2028
4877
9171
9204
5337
7716
5283
2151
738
9638
3644
3336
5128
212
414
322
3362
3534
6384
7313
4879
1259
7335
2164
7546
8350
9170
3634
3686
2202
9575
3378
668
5861
8255
2143
6365
4227
661
9134
1413
1115
4457
6751
5055
3235
7309
5610
8775
1149
9188
846
4516
5582
1765
1909
6126
8199
2637
3081
9074
8298
4757
9676
1338
5929
7719
7231
5825
3800
4272
9082
2264
1638
6926
6906
4811
2642
3810
3369
4551
7446
2827
6215
7731
8085
2814
3371
8529
2719
3784
8274
9577
7404
2858
5342
9662
5485
6768
1290
8761
3026
4800
8067
1191
8522
190
8665
6958
1871
527
9423
4887
2822
8179
6622
9242
5263
8727
8766
6493
8616
459
8330
4338
6121
2003
3773
7973
2836
7556
9419
7144
8806
9708
3571
6344
9060
3914
9410
9949
8276
1314
2793
7729
5660
6230
2108
3745
7639
2161
5381
2700
7077
6792
7924
1678
6201
589
9760
9570
7579
1609
7559
9780
1777
8781
325
383
4381
667
9655
1479
7032
5160
5495
5564
9804
9752
8372
6650
3747
8878
7238
693
9034
2420
6314
1888
1712
48
1511
4442
8282
4723
8333
8884
1545
8607
2088
7696
6657
9952
9346
8309
517
1653
5604
4602
1972
9983
7852
4026
5316
6490
1724
2785
8242
9176
5520
3502
3884
8693
5970
9900
6322
8534
3722
3804
9355
4395
7638
9367
9307
1058
7228
4948
6102
1210
9910
7091
3326
2428
1158
9668
4022
8226
6479
7940
1192
2528
7655
6783
366
5176
2765
2831
8545
2938
2799
3791
5198
6849
6458
1302
3099
4046
5665
9786
3291
6015
6359
1994
9844
5385
1298
3537
4321
7225
9864
9946
618
1352
9734
4832
3366
3655
6005
8949
2101
4520
3735
4301
1384
5620
5400
9480
61
4079
568
5767
1828
8512
4013
6583
9302
2746
9338
8986
5258
6071
247
8773
6653
116
1199
4346
7183
9420
8651
9491
2505
1844
6266
4804
2587
4522
382
8233
5397
6335
3398
1007
2103
348
1287
5598
7812
166
8682
2977
6340
6924
7374
1993
985
674
1978
7793
3977
2434
2092
1503
5265
1876
7714
1995
4954
4959
1449
2267
785
4095
791
2481
1257
1981
1937
6538
9232
3845
9077
907
3175
5466
2523
5164
9263
8221
4510
8526
5762
1105
6847
3846
9454
1371
33
7493
1552
8325
5288
8939
8000
146
5949
1465
5153
6106
4564
4851
706
5210
2790
5752
6286
8210
2743
8708
4052
9618
3386
9571
9790
87
5291
1661
6475
9659
7725
1367
6022
5429
7336
6750
6455
9484
6437
2921
815
5721
2644
6045
2952
4728
6057
9903
2795
9951
1448
3300
6069
2544
2184
3540
5769
5443
2066
9939
5201
3874
7550
9237
9384
1755
2937
162
5038
617
3989
192
3062
9168
6428
256
3346
2296
9227
8164
2920
8078
8542
8549
4705
4364
1611
6630
3924
5749
9114
4244
9460
2431
4639
1579
7292
8300
1504
7724
3133
1014
1920
9404
1690
3728
3003
4729
3798
1447
8486
992
7755
4500
3561
1254
8265
7428
4245
510
801
6350
1450
8315
7648
6858
6606
6003
7590
6207
5714
9352
8992
8031
6655
7492
2272
4067
8238
1622
1240
2625
9845
1917
1166
2940
301
5726
3852
9453
2344
1507
6425
1141
4159
7664
5090
6252
3865
8211
3506
1817
5695
5831
6273
1156
1463
8714
9259
2734
5192
7176
3333
332
3079
6084
6946
2495
2665
1643
3736
7094
6835
4311
8633
5001
3201
5228
1625
2371
703
6701
3677
491
6075
6965
2067
5143
9408
6545
5244
723
3611
7218
7987
5420
9270
2935
4714
9873
4515
6078
8903
8792
6275
381
5312
1831
9292
1813
4027
6534
7402
4215
8998
780
7779
6519
5082
1059
754
7625
7291
2570
6753
324
5976
6439
8166
8643
2312
65
8369
6234
4029
8628
7944
584
1467
5795
5727
3290
1082
1046
5387
3913
5591
6451
4646
1873
2810
470
2588
2529
9122
6938
5808
7035
1455
4423
5573
6100
3778
105
7379
2607
2249
7728
4761
2436
6801
8624
7611
8846
862
7209
5196
45
2119
4933
2098
2138
5925
7049
7399
6453
235
4570
8755
99
6915
3315
2049
1002
4170
4871
2792
9336
5550
7613
5456
2063
6324
1768
3222
7330
9467
8269
2883
1303
3744
4004
9830
2906
9885
5710
7202
8925
2509
9106
3820
4340
1830
8654
7121
5462
8089
4679
4858
9531
5846
9088
7946
4855
1466
7771
4125
7007
3682
1809
4390
6720
4827
9802
3098
2432
6824
8961
2289
7521
2903
158
5076
3763
417
8976
3978
9139
3995
2670
6280
115
2576
5436
8877
3645
8320
5537
8296
6537
3749
5616
7649
8646
728
9891
6478
9006
27
2457
612
1541
2475
6736
8567
9973
4951
8994
803
8797
3304
4732
4794
7782
4526
1155
814
9539
3380
4477
3808
6296
4188
2314
7577
4114
5630
4309
3861
2600
9205
6278
7505
4694
7059
619
5570
4884
7747
3176
1517
6166
8458
5253
2503
7781
3090
5191
1908
5095
4133
3982
6990
6217
1810
7927
9664
327
9933
3234
8737
3004
1004
931
1322
4724
7357
281
9805
7844
9964
8581
680
2287
6225
3196
5091
121
5514
4461
7874
8143
5603
3570
4531
7630
3084
4603
8513
3171
7112
8981
9929
473
8802
3423
1217
2657
8701
2828
1814
4271
3935
2345
4365
6994
1596
8279
3293
3257
8638
3910
6034
1747
5562
9130
8756
5705
2152
2550
7610
5779
2559
5557
291
2317
9399
2280
9246
8466
8248
4226
113
1076
3607
6947
9299
9477
4534
2393
5168
5810
2626
2080
8983
3835
6744
8066
2823
8502
5836
973
3917
172
3120
1711
5629
3666
2806
7776
1297
9817
7568
6364
5166
6194
535
7807
8098
5158
5657
7010
4376
1714
3673
898
163
4368
7130
8598
4116
3833
3337
691
3614
8820
4585
5028
135
3509
1336
1137
8973
586
1311
8514
1740
9016
6747
6416
242
7527
7099
5848
7214
7670
951
1798
1728
1474
4998
7876
5161
7561
1018
906
5347
8497
1219
7583
1689
5895
7526
5631
5186
9092
5959
1365
6238
5815
7881
1347
4412
7
1892
5030
3482
1197
8293
1498
6616
2502
1437
1640
3871
3161
8039
2050
6969
7350
4780
9111
6415
8061
4453
8400
170
8270
2691
2347
20
9076
2401
6055
876
6518
2072
4030
1332
3417
488
7488
4599
6621
4343
4490
4773
5045
5886
9713
7566
5772
3718
2633
8892
737
1882
1222
3595
2112
1360
354
1540
9165
6673
9808
7163
4051
3621
2343
1982
6062
5012
3094
9022
5990
3692
8556
7057
9673
5590
908
8193
6872
3932
405
1173
7587
8306
4775
2618
627
7652
7990
7576
7766
3504
5615
7045
7792
8553
9158
8902
2209
536
6457
5757
56
867
9037
9258
9422
3018
4509
4815
3681
6939
9607
6089
2179
406
8720
9775
5346
8140
5763
2796
7368
4700
3726
2555
4493
7667
1277
7893
4122
271
1294
654
1163
8414
1884
4930
7730
7997
3991
8157
731
4334
544
2129
2413
5920
4253
9547
8637
4967
666
1516
1422
3497
6487
1351
8149
7604
9066
5878
4752
5480
575
905
2754
8150
841
6409
6452
4146
2591
9552
8647
1326
2059
3693
3519
5331
8493
9109
5066
2372
420
137
4902
2855
6727
8356
3487
5187
1599
2377
7503
8116
5427
106
4695
2913
5500
2834
6491
1617
7739
1945
1031
1787
6957
7433
4162
10000
4497
3172
1461
2323
7161
399
5294
3669
9047
9214
8864
4023
8419
519
2010
9722
796
5212
6011
6888
8237
4957
1915
9767
5873
631
7856
7727
6851
4035
3635
8770
7845
8694
5104
6573
8710
9202
4822
7055
5654
628
9476
9150
2917
1983
2998
3580
9740
8715
9759
6424
5020
2300
2177
7848
6586
2511
3297
1080
384
5501
2477
4088
7948
2973
5888
5746
7870
5741
3364
3626
9368
4210
3775
2071
9471
413
5156
3556
2207
2571
5358
3940
4330
8170
3716
7850
1874
377
6198
4605
6283
6221
806
4539
6708
4142
3934
8622
255
338
6997
24
2087
3203
8861
2878
287
2519
6038
5774
4494
524
6224
1333
5711
1358
5875
6398
8069
9496
4947
1701
3803
6794
9858
7054
555
5954
5233
4467
4404
1534
6587
637
6660
1315
5008
1634
5793
2234
5479
7858
963
6219
234
9052
8851
6829
5809
1538
4460
6721
2812
4220
8569
1940
1745
9461
22
7656
3597
2582
8501
6598
298
8196
3879
724
7148
1439
9612
9878
8960
8507
3095
795
2696
505
8176
8082
4594
6094
2758
2423
6449
7954
380
5279
5636
360
7041
1356
2647
6590
8071
3967
3128
7551
6499
8966
8471
7192
9003
8636
7618
9963
8271
3953
4310
4112
6993
9685
5663
6370
6160
2939
5989
6076
7089
2485
5251
9320
3562
2614
54
358
4107
1432
9871
5568
614
2424
6257
2688
5965
5329
8479
2090
6305
2467
7067
6945
5371
6410
284
3437
7849
4576
2095
9540
4938
2349
8972
5674
5960
4607
4256
3849
2442
5858
180
3625
7645
7936
1942
881
1134
3664
4553
1626
6856
5730
6253
6091
7217
1806
2552
2195
1342
9519
6125
8531
2173
7195
1702
1754
6631
4408
3039
9383
1323
5022
9639
8778
2772
904
5489
9240
3960
6467
183
2171
1930
5299
4821
1162
5295
4983
9377
6274
7367
4689
7834
5707
835
7831
6877
6339
6247
7248
2736
5855
1077
4422
1047
9601
7857
3215
1340
1064
8321
3489
5987
8717
7938
1885
9574
9507
1214
9982
2534
2751
5907
4447
26
1313
1008
5796
5313
6733
9533
9564
2629
307
2307
1177
7680
2441
5999
2904
8793
660
9867
4776
1782
1668
3647
4239
9339
3009
7064
5246
8786
7220
4730
7149
2971
8387
4917
309
5006
58
8946
110
5986
1186
9474
6154
3406
8118
9250
5515
5475
996
9264
2000
7453
6683
5446
3648
2206
3886
3638
444
6778
426
2775
2756
2121
4790
6099
93
6366
5061
5678
3230
7926
6677
1139
923
6868
3602
3801
5276
3860
7125
3750
4891
456
5821
811
1771
5966
6818
2866
5362
4955
9053
4753
7109
1154
2674
8722
363
1802
1832
5625
2950
5243
7239
9424
1408
7614
7150
283
3404
6654
1208
3530
9842
6848
9592
2951
3904
8595
181
9090
7854
7405
3157
5046
819
3699
5497
6962
7371
8817
6813
8880
1375
2672
9846
6356
1172
4073
9517
4184
1694
7970
4349
4090
9974
49
8012
7603
6309
2351
7703
6009
5414
2909
3709
4019
8848
1957
7082
8119
3397
9159
5505
4407
4905
2122
128
4126
7349
8028
3193
5797
3289
5540
4010
9705
4945
3569
7533
7513
649
1603
6784
6036
3608
8699
6162
8352
3532
,
=
a
b
c
d
e
f
i
l
n
o
s
t
u
v
##7
##0
##2
##4
##8
##3
##9
##6
##1
##5
##n
##f
##o
##a
##b
##c
##d
##t
##e
##l
##u
in
st
va
##fo
##at
##lu
info
stat
valu
state
value
infod
infoa
infob
infoc